[
  {
    "name": ["ইমাম নাসাঈ (রহ.)", "Imam Nasa'i (RA)", "الإمام النسائي (رح)"],
    "desc": [
      "ইমাম নাসাঈ (রহ.) ইলমে হাদিসের আকাশে এক উজ্জ্বল নক্ষত্র। তিনি সিহাহ সিত্তার অন্যতম বিশুদ্ধ হাদিস গ্রন্থ ‘নাসাঈ শরীফ’সহ অনেক মূল্যবান গ্রন্থ প্রণয়ন করে মুসলিম বিশ্বে অবিস্মরণীয় হয়ে আছেন।\n\nসততা, বিশ্বস্ততা, ন্যায়পরায়ণতা ও আল্লাহভীরুতায় তিনি ছিলেন অনন্য। হাদিস চর্চায় তিনি নিজেকে উৎসর্গ করেছিলেন। মৃত্যু অবধি তিনি সহিহ হাদিসের সন্ধানে সময় কাটিয়েছেন। তার মতো নিবেদিতপ্রাণ হাদিস গবেষকদের কারণে আমাদের কাছে হাদিসের অালো এসে পৌঁছে।\n\nইমাম নাসাঈর প্রকৃত নাম আহমাদ, পিতার নাম শোয়াইব। ইমাম নাসাঈ (রহ.) ২১৫ হিজরি মোতাবেক ৮৩০ খ্রিস্টাব্দে মতান্তরে ২১৪ হিজরিতে খোরাসানের ‘নাসা’ নামক স্থানে জন্মগ্রহণ করেন। এ স্থানের দিকে সম্বন্ধিত করে তাকে আন-নাসাঈ বলা হয়। এ নামেই তিনি সমধিক প্রসিদ্ধি লাভ করেছেন।\n\nইমাম নাসাঈ (রহ.)-এর সময়ে খোরাসান ও তার পার্শ্ববর্তী এলাকাসমূহ জ্ঞান-বিজ্ঞান ও ইলমে হাদিসের কেন্দ্রভূমি হিসেবে পরিচিত ছিল। সেখানে অনেক খ্যাতনামা বিদ্বানের সমাবেশ ঘটেছিল। তিনি সেখানেই প্রখ্যাত আলেমদের তত্ত্ববধানে পড়া-লেখা শুরু করেন। ২৩০ হিজরিতে উচ্চশিক্ষা অর্জনের জন্য তৎকালীন সময়ের বিভিন্ন দেশ ও জনপদ সফর করেন।\n\nইমাম যাহাবি (রহ.) বলেন, ‘জ্ঞান অন্বেষণের জন্য তিনি খোরাসান, হিজায, মিসর, ইরাক, জাযিরা, সিরিয়া এবং সীমান্ত এলাকায় ভ্রমণ করেন। অতঃপর মিসরে স্থায়ীভাবে বসবাস শুরু করেন। ’\n\nদেশ-বিদেশে উচ্চশিক্ষা গ্রহণের পর ইমাম নাসাঈ (রহ.) হাদিসের দরস প্রদান শুরু করেন। অনেক শিক্ষার্থী তার নিকট থেকে ইলমে হাদিস শিক্ষা লাভ করেছে।\n\nইমাম নাসাঈ (রহ.) সুনানে নাসাঈ ছাড়াও কয়েকটি মূল্যবান গ্রন্থ রচনা করেছেন। তবে বেশি প্রসিদ্ধ লাভ করেছে নাসাঈ শরীফ। সুনানে নাসাঈতে সংকলিত হাদিস সংখ্যা ৪৪৮২টি। শায়খ নাছিরুদ্দীন আলবানীর গণনা অনুযায়ী নাসাঈর মোট হাদিস সংখ্যা ৫৭৫৮টি। এতে মোট একান্নটি অধ্যায় রয়েছে।\n\nসুনানে নাসাঈর এমন কিছু বৈশিষ্ট্য রয়েছে যা তাকে অপরাপর হাদিস গ্রন্থ থেকে পৃথক স্বাতন্ত্র্য দান করেছে। যেমন-\n\nঅন্য বিশুদ্ধ হাদিস গ্রন্থগুলোর ন্যায় সুনানে নাসাঈতে পুনঃউল্লিখিত হাদিসের সংখ্যা খুব কম। এতে পুনঃউল্লিখিত হাদিস নেই বললেই চলে।\n\nএ গ্রন্থে কোনো কোনো স্থানে হাদিসের দুর্বোধ্য শব্দসমূহের ব্যাখ্যা করা হয়েছে।\n\nইমাম নাসাঈ স্বীয় গ্রন্থে শক্তিশালী ও সহিহ সনদের ভিত্তিতে হাদিস সন্নিবেশিত করেছেন।\n\nইমাম নাসাঈ (রহ.) এ গ্রন্থে জীবনের প্রায় সকল দিক সম্পর্কিত ক্ষুদ্র ক্ষুদ্র শাখা-প্রশাখায় হাদিস সন্নিবেশিত করেছেন।\n\nসুনানে নাসাঈর হাদিসের অধ্যায়, অনুচ্ছেদ-পরিচ্ছেদগুলো ধারাবাহিকভাবে বিন্যস্ত। এ গ্রন্থের অনুচ্ছেদ-পরিচ্ছেদের শিরোনাম অত্যন্ত সংক্ষিপ্ত ও সহজবোধ্য। হাদিস ও শিরোনামের মধ্যে সাযুজ্য বিদ্যমান।\n\nএ গ্রন্থে ‘অনুচ্ছেদ’-এর অনুকূলে কোরআনে কারিমের কোনো আয়াত থাকলে তাও সন্নিবেশিত করা হয়েছে।\n\nইমাম নাসাঈ (রহ.) নির্মল চরিত্র মাধুর্যের অধিকারী ছিলেন। তিনি সদাসর্বদা আল্লাহতায়ালার ভয়ে ভীতবিহবল থাকতেন। একদিন পরপর তিনি সারা বছর নফল রোজা পালন করতেন। রাতে তাহাজ্জুদ নামাজ ও সময় পেলেই ইবাদত-বন্দেগিতে মনোনিবেশ করতেন। তিনি একাধিকবার হজব্রত পালন করেছেন।\n\nতার মৃত্যু ও দাফনের স্থান নিয়ে মতবিরোধ রয়েছে। কেউ বলেন তিনি মক্কায় মৃত্যুবরণ করেছেন। আবার কেউ বলেন তিনি ফিলিস্তিনে ইন্তেকাল করেছেন।\n\nহাফেয যাহাবি ‘তাযকিরাতুল হুফফাজ’ গ্রন্থে লিখেছেন, ইমাম নাসাঈ (রহ.) ৩০৩ হিজরির সফর মাসের ১৩ তারিখ সোমবার ফিলিস্তিনে মৃত্যুবরণ করেন। ’\n\nঐতিহাসিক ইবনে খাল্লিকান বলেন, ৩০৩ হিজরির শাবান মাসে তিনি মৃত্যুবরণ করেন। মৃত্যুকালে তার বয়স হয়েছিল ৮৮/৮৯ বছর। সাফা ও মারওয়া পাহাড়ের পাদদেশে তাকে দাফন করা হয়।\n\nঅন্য বর্ণনায় এসেছে, হাফেজ আবু আমির বলেন, ‘তিনি ফিলিস্তিনের রামাল্লায় ৩০৩ হিজরির ১০ সফর সোমবার রাত্রে মৃত্যুবরণ করেন এবং বায়তুল মোকাদ্দাসের সন্নিকটে তাকে দাফন করা হয়। ’\n\nইলমে হাদিসের প্রচার-প্রসার, হাদিস সংকলন ও সংরক্ষণে ইমাম নাসাঈ (রহ.)-এর অবদান অতুলনীয়। এ ক্ষণজন্মা মহামনীষীর জীবনের প্রতিটি পরতে পরতে রয়েছে আমাদের জন্য বহু শিক্ষণীয় বিষয়। আরবি তারিখ হিসেবে আজ তার মৃত্যু দিবস। এই দিনে তার প্রতি রইল অামাদের অসীম শ্রদ্ধা। দোয়া করি আল্লাহতায়ালা তার কবরকে জান্নাতের বাগানে পরিণত করুন। আমিন।",
      "Imam Nasa'i (RA) is a bright star in the sky of Ilm Hadith. He has become unforgettable in the Muslim world by producing many valuable books including Sihah Sitta's one of the purest hadith book 'Nasa'i Sharif'.\n\nHe was unique in honesty, faithfulness, justice and God-fearing. He devoted himself to the practice of hadith. Until his death he spent time searching for Sahih Hadith. The light of hadith reached us because of dedicated hadith researchers like him.\n\nImam Nasa'i's real name is Ahmad, father's name is Shoaib. Imam Nasa'i (RA) was born in 214 A.H. at a place called 'Nasa' in Khorasan in 830 A.D. according to 215 A.H. It is called An-Nasa'i in reference to this place. With this name, he has gained a lot of fame.\n\nDuring the time of Imam Nasa'i (r.a.), Khorasan and its surrounding areas were known as the center of science and knowledge of Hadith. Many famous scholars gathered there. He started studying there under the supervision of renowned scholars. In 230 Hijri, he visited different countries and towns of that time to acquire higher education.\n\nImam Zahabi (RA) said, 'In search of knowledge, he traveled to Khorasan, Hijaz, Egypt, Iraq, Jazira, Syria and border areas. Then he started living permanently in Egypt. '\n\nAfter receiving higher education in the country and abroad, Imam Nasa'i (RA) started teaching Hadith. Many students have learned Hadith from him.\n\nImam Nasa'i (R.A.) wrote some valuable books besides Sunan Nasa'i. But Nasai Sharif gained more fame. The number of hadiths compiled in Sunan Nasa'i is 4482. According to Sheikh Nasiruddin Albani's calculation, the total number of hadiths of Nasa'i is 5758. It has fifty one chapters in total.\n\nSunan Nasa'i has certain characteristics that distinguish it from other hadith books. For example-\n\nLike other pure hadith books, the number of hadith repeated in Sunan Nasa'i is very small. There is no hadith mentioned in it.\n\nIn some places in this book, the incomprehensible words of the hadith are explained.\n\nImam Nasa'i has inserted hadiths in his book based on strong and authentic chain of transmission.\n\nIn this book, Imam Nasa'i (R.A.) has included hadiths related to almost all aspects of life.\n\nIn Sunan Nasa'i hadith chapters, paragraphs are arranged sequentially. The section headings of this book are very short and easy to understand. Consistency exists between the hadith and the title.\n\nIn this book, in favor of 'paragraphs', if there are any verses of the Qur'an, they have also been inserted.\n\nImam Nasa'i (R.A.) was possessed of pure character and sweetness. He was always in fear of God. One day after another, he used to observe Nafal fast throughout the year. At night, Tahajjud prayed and when he had time, he concentrated on worship. He has performed Hajj several times.\n\nThere is disagreement about his place of death and burial. Some say he died in Mecca. Others say he died in Palestine.\n\nHafez Zahabi wrote in the book \"Tazkiratul Huffaz\", Imam Nasa'i (RA) died in Palestine on Monday, 13th of the month of Safar, 303 Hijri. '\n\nHistorian Ibn Khallikan said that he died in the month of Shaban of 303 Hijri. He was 88/89 years old at the time of his death. He was buried at the foot of the hills of Safa and Marwa.\n\nIn another narration, Hafez Abu Amir said, \"He died on Monday night, 10 Safar 303 Hijri, in Ramallah, Palestine, and was buried near Baitul Moqaddas.\" '\n\nThe contribution of Imam Nasa'i (R.A.) in propagation of hadith in science, collection and preservation of hadith is incomparable. There are many lessons for us in every aspect of the life of this momentous great thinker. Today is his death anniversary in Arabic. We have immense respect for him on this day. May Allah turn his grave into a paradise garden. Amen.",
      "الإمام النسائي (رضي الله عنه) نجم ساطع في سماء علم الحديث. لقد أصبح لا يُنسى في العالم الإسلامي من خلال إنتاج العديد من الكتب القيمة بما في ذلك كتاب الصحاح ستة وهو من أنقى كتب الحديث \"النسائي شريف\".\n\nوكان فريدا في الصدق والإخلاص والعدالة ومخافة الله. كرس نفسه لممارسة الحديث. حتى وفاته أمضى وقتًا في البحث عن الحديث الصحيح. وقد وصل إلينا نور الحديث بفضل باحثين متخصصين في الحديث مثله.\n\nالاسم الحقيقي للإمام النسائي هو أحمد، واسم الأب شعيب. ولد الإمام النسائي (رضي الله عنه) سنة 214 هجرية في مكان يسمى ناسا بخراسان سنة 830 م الموافق 215 هجرية. ويسمى النسائي نسبة إلى هذا المكان. وبهذا الاسم اكتسب شهرة كبيرة.\n\nوفي عهد الإمام النسائي (رضي الله عنه)، كانت خراسان والمناطق المحيطة بها معروفة بأنها مركز علوم ومعرفة الحديث. اجتمع هناك العديد من العلماء المشهورين. وبدأ الدراسة هناك على يد كبار العلماء. وفي عام 230 هجرية، زار بلدان ومدن مختلفة في ذلك الوقت للحصول على التعليم العالي.\n\nقال الإمام الذهبي (رضي الله عنه): رحل في طلب العلم إلى خراسان والحجاز ومصر والعراق والجزيرة والشام والنواحي. ثم بدأ يعيش بشكل دائم في مصر. '\n\nبعد حصوله على التعليم العالي في البلاد وخارجها، بدأ الإمام النسائي (رضي الله عنه) بتدريس الحديث. وقد تعلم منه كثير من الطلاب الحديث.\n\nللإمام النسائي (رضي الله عنه) عدة كتب قيمة إلى جانب سنن النسائي. لكن ناساي شريف اكتسب المزيد من الشهرة. عدد الأحاديث المجمعة في سنن النسائي 4482 حديثا. وبحسب حسابات الشيخ ناصر الدين الألباني فإن مجموع أحاديث النسائي هو 5758. وهو يتألف من واحد وخمسين فصلا في المجموع.\n\nلسنن النسائي خصائص معينة تميزه عن غيره من كتب الحديث. على سبيل المثال-\n\nوكغيره من كتب الحديث الشريف فإن عدد الأحاديث المكررة في سنن النسائي قليل جداً. وقيل: ليس فيه حديث مكرر.\n\nوفي بعض المواضع من هذا الكتاب شرح ألفاظ الحديث غير المفهومة.\n\nوقد أدخل الإمام النسائي في كتابه أحاديث بإسناد قوي وصحيح.\n\nوقد أدرج الإمام النسائي (رضي الله عنه) في هذا الكتاب أحاديث تتعلق بجميع جوانب الحياة تقريبًا.\n\nوفي فصول حديث سنن النسائي، يتم ترتيب الفقرات بالتسلسل. عناوين أقسام هذا الكتاب قصيرة جدًا وسهلة الفهم. هناك تطابق بين الحديث والعنوان.\n\nفي هذا الكتاب، لصالح \"الفقرات\"، إذا كان هناك أي آيات من القرآن، فقد تم إدراجها أيضًا.\n\nوكان الإمام النسائي (رضي الله عنه) يتمتع بصفاء الخلق والحلاوة. وكان دائما في خوف من الله. وكان يومًا بعد يوم يصوم النفل طوال العام. في الليل كان يصلي التهجد وعندما يكون لديه وقت يركز على العبادة. وقد أدى فريضة الحج عدة مرات.\n\nهناك خلاف حول مكان وفاته ودفنه. ومنهم من قال إنه مات بمكة. ويقول آخرون إنه مات في فلسطين.\n\nكتب الحافظ الذهبي في كتاب تذكرة الحفاظ أن الإمام النسائي (رضي الله عنه) توفي في فلسطين يوم الاثنين 13 من شهر صفر سنة 303 هجرية. '\n\nوقال المؤرخ ابن خلكان إنه توفي في شهر شعبان سنة 303 هجرية. كان عمره 88/89 عامًا وقت وفاته. ودفن عند سفح جبلي الصفا والمروة.\n\nوفي رواية أخرى قال حافظ أبو عامر: توفي ليلة الاثنين ١٠ صفر سنة ٣٠٣ هـ بمدينة رام الله بفلسطين، ودفن بالقرب من بيت المقدس. '\n\nإن مساهمة الإمام النسائي (رضي الله عنه) في نشر الحديث في العلوم وتجميع الحديث وحفظه لا تضاهى. هناك العديد من الدروس لنا في كل جانب من جوانب حياة هذا المفكر العظيم. اليوم هو ذكرى وفاته باللغة العربية. لدينا احترام كبير له في هذا اليوم. جعل الله قبره روضة من رياض الجنة . آمين."
    ],
    "image": "https://i.ibb.co/k3KYXJm/islamic-man.jpg"
  }
]
