[
  {
    "_id": "667dc0768f6f312a681e9cab",
    "name": [
      "ইমাম ইবনে মাজাহ (রহ)",
      "Imam Ibn Majah (RA)",
      "الإمام ابن ماجه (رح)"
    ],
    "desc": [
      "ইমাম ইবনে মাজাহ (রহ)- এর ডাক নাম মুহাম্মদ উপনাম আবু আবদুল্লাহ। নিসবতি নাম আল বরি আল কাজবিনি। পূর্ণনাম হাফিজুল হাদিস ইমাম আবু আবদুল্লাহ মুহাম্মদ ইবনে ইয়াজিদ ইবনে আবদুল্লাহ ইবনে মাজাহ আর রবিয়ি আল কাজবিনি। তিনি কাসপিয়ান সাগরের উপকূলের অধিবাসী ছিলেন বলে তাঁকে কাজবিনি বা কাসপিয়ানি বলা হয়। কিন্তু ইবনে মাজাহ নামেই তিনি অধিক প্রসিদ্ধি লাভ করেন।\n২০৯ হিজরি সনে ইবনে মাজাহ কাজবিন নামক স্থানে জন্মগ্রহণ করেন। এই শহর তৃতীয় খলিফা হযরত উসমান ইবনে আফফান (রা)-এর শাসনামলে বিজিত হওয়ার পর থেকেই ইসলামী জ্ঞান-বিজ্ঞানের কেন্দ্রে পরিণত হয়। তৃতীয় হিজরি শতক থেকেই এ শহর ইলমে হাদিসের চর্চায় বিশেষ উৎকর্ষতা লাভ করে। ফলে ইবনে মাজাহ বাল্যকাল থেকেই ইলমে হাদিস চর্চার অপূর্ব সুযোগ লাভ করেন।\nপারিবারিক পরিবেশেই তিনি প্রাথমিক শিক্ষা লাভ করেন। আরবি ও ফার্সি ভাষায় তিনি অপূর্ব দক্ষতা অর্জন করেন। প্রাতিষ্ঠানিক শিক্ষা কাজবিনেই সমাপ্ত করেন। এরপর দীর্ঘ একুশ বছরকাল আপন জন্মস্থানে হাদিস অধ্যয়ন সমাপনান্তে মক্কা, মদিনা, দামেশক, কুফা, বসরা, বাগদাদ, হিমস, খুরাসান, বলখ, মিসর, তিন্নসি, ইসপাহান, নিশাপুর, ওয়াসত প্রভৃতি জ্ঞানকেন্দ্র সফর করে হাদিস শিক্ষা ও হাদিস সংগ্রহ করেন। এ সময় তিনি যুগশ্রেষ্ঠ মুহাদ্দিসগণের নিকট হাদিস অধ্যয়ন করেন এবং বিশেষ ব্যুৎপত্তি লাভ করেন। ইবনে মাজাহ যে সমস্ত মুহাদ্দিসের নিকট হাদিস অধ্যয়ন করেন তাঁদের মধ্যে আলী ইবন মুহাম্মদ, আবু হাসান তানফেসী, আবু বকর আবদুল্লাহ ইবন মুহাম্মদ, আবু সাদ আবদুল্লাহ আল আসাদ, ইবন হিব্বান তামিমি, মুহাম্মদ ইবন আবদুল্লাহ নুমায়র, আবু বকর আন আবি শায়বাহ, ইবরাহিম ইবন মুনসযির হিশামি, দাউদ ইবন রশিদ, আবদুল্লাহ ইবন মুআবিয়াহ, আমর ইবন রাফে, আবু হাজার বিজলি, ইসমাইল ইবন মুসা ইবন হাইয়ান তামিমিী, হিশাম ইবন উমারাহ এবং মুহাম্মদ ইবন আবু খালেদ আবু বকর কাজবিনি প্রমুখের নাম সবিশেষ উল্লেখযোগ্য।\nইমাম ইবন মাজাহ অল্প দিনের মধ্যেই ইলমুল হাদিসে পাণ্ডিত্য অর্জন করেন এবং সমকালীন যুগে একজন প্রতিষ্ঠিত মুহাদ্দিস হিসেবে পরিচিতি লাভ করেন। তাঁর যশ, খ্যাতি চতুর্দিকে ছড়িয়ে পড়ে। অসংখ্য বিদ্যার্থী তাঁর নিকট এসে বিদ্যার্জন করে তাদের জ্ঞান-তৃষ্ণা নিবারণ করত। তাঁর ছাত্রের সংখ্যা অনেক বেশি। তন্মধ্যে সুলায়মান ইবন ইয়াযিদ, ইবরাহিম ইবন দিনার, আবুল হাসান ইবন কাত্তান, মুহাম্মদ ইবন ঈসা আস সাফিয়ার, ঈসা ইবন আবসার (রহ) প্রমুখের নাম সবিশেষ উল্লেখযোগ্য।\nইমাম ইবনে মাজাহ অসাধারণ মেধা, নিষ্ঠা, অধ্যবসায় ও প্রজ্ঞা দিয়ে হাদিস যাচাই-বাছাই করেন। তিনি হাদিস গ্রহণ ও যাচাই-বাছাইয়ের ক্ষেত্রে যে নীতিমালা অনুসরণ করেন তা নিম্নরূপ :\n১.    বর্ণনাকারীকে অবশ্যই ন্যায়পরায়ণ হতে হবে;\n২.    বর্ণনাকারীকে ফাসিক ও বিদআতি হওয়া চলবে না;\n৩.    সহীহ আকিদার অনুসারী হতে হবে;\n৪.    আদব ও শিষ্টাচারের অধিকারী হতে হবে;\n৫.    বর্ণনাকারীদের বিশ্বস্ততা ও দোষ-গুণ বিশ্লেষণপূর্বক হাদিস গ্রহণীয়;\n৬.    সনদের বলিষ্ঠতা দ্বারা সমর্থন পাওয়া গেলে অপর বর্ণনাসূত্রে বিচ্ছিন্নতা দেখা দিলেও তা আপাতত গ্রহণযোগ্য;\n৭.    বুখারি ও মুসলিমের সূত্রে বর্ণিত সকল হাদিস গ্রহণযোগ্য;\n৮.    খ্যাতনামা আলেম ও ফকীহগণ যে সমস্ত হাদিসের ওপর আমল করেছেন সেসব হাদিস গ্রহণযোগ্য;\n৯.    দুর্বল হাদিস অপরাপর সহীহ হাদিস দ্বারা সমর্থিত হলে তা সাধারণভাবে গ্রহণযোগ্য।\nইবনে মাজাহ রচনা করেন বিখ্যাত গ্রন্থ ‘আস সুনান’ যা সুনানে ইবনে মাজাহ বা ইবনে মাজাহ শরিফ নামে সুপরিচিত। এ হাদিস সঙ্কলনখানি সব দিক দিয়ে সমস্ত সিহাহ সিত্তা গ্রন্থাবলির মধ্যে বিশিষ্ট মর্যাদার অধিকারী। প্রথম এর রচনা, সজ্জায়ন, সৌকর্য। দ্বিতীয়ত, এ গ্রন্থের হাদিসসমূহে বিশেষ পুনরাবৃত্তি নেই। অপর কোনো সঙ্কলনে এই বিশেষত্ব দেখতে পাওয়া যায় না। মুহাদ্দিস শাহ আবদুল আজিজ দেহলবী (রহ) ইবনে মাজাহ শরিফের উচ্চ প্রশংসা করেছেন। অপরিসীম শ্রম সাধনা ও যাচাই বাছাইয়ের পর ইমাম ইবনে মাজাহ এ গ্রন্থখানার প্রণয়নকার্য সম্পন্ন করেন। লাখ লাখ হাদিস থেকে বাছাই করে চার হাজার হাদিসকে তিনি বিভিন্ন অধ্যায়ে সাজিয়ে দিয়েছেন। এ গ্রন্থে মোট ৩২টি পরিচ্ছেদ। মোট হাদিসের সংখ্যা ৪৩৩৮টি।\nইমাম ইবনে মাজাহ এ গ্রন্থ ছাড়াও আরো বহু মূল্যবান গ্রন্থ রচনা করেন। হাদিসের ভিত্তিতে কুরআনের একটি বিরাট তাফসির গ্রন্থও তিনি রচনা করেন। তারিখে মিলিহ তাঁর অন্যতম উল্লেখযোগ্য গ্রন্থ। এ গ্রন্থে তিনি সাহাবাদের যুগ থেকে নিজের সময়কাল পর্যন্ত বিস্তারিত ইতিহাস আলোচনা করেছেন।\nইমাম ইবনে মাজাহ ২৭৩ হিজরির ২২ রমজান সোমবার ৬৪ বছর বয়সে কাজবিন শহরে ইন্তেকাল করেন।",
      "Imam Ibn Majah (RA) nicknamed Muhammad alias Abu Abdullah. Nisbati name Al Bari Al Kazbini. Full name Hafizul Hadith Imam Abu Abdullah Muhammad Ibn Yazid Ibn Abdullah Ibn Majah and Rabi'i Al Kazbini. He was called Kazbini or Caspiani because he was a native of the coast of the Caspian Sea. But he gained more fame under the name of Ibn Majah.\nIbn Majah was born in the year 209 Hijri in a place called Kazbin. This city became the center of Islamic knowledge after its conquest during the reign of Hazrat Uthman Ibn Affan (RA), the third Caliph. From the third century of Hijri, this city gained special excellence in the practice of knowledge and hadith. As a result, Ibn Majah got a wonderful opportunity to practice hadith in science since childhood.\nHe received his primary education in a family environment. He acquired excellent skills in Arabic and Persian languages. Completed formal education without work. After completing the study of hadith in his hometown for twenty one years, he visited Mecca, Madinah, Damascus, Kufa, Basra, Baghdad, Hims, Khurasan, Balkh, Misr, Tinnsi, Ispahan, Nishapur, Wasat etc. to learn hadith and collected hadith. During this time, he studied Hadith with the greatest muhaddiths of the age and gained a special etymology. Among the muhaddiths with whom Ibn Majah studied Hadith were Ali Ibn Muhammad, Abu Hasan Tanfasi, Abu Bakr Abdullah Ibn Muhammad, Abu Sa'd Abdullah Al Asad, Ibn Hibban Tamimi, Muhammad Ibn Abdullah Numayr, Abu Bakr An Abi Shaybah, Ibrahim Ibn Munshir Hishami. , Dawud Ibn Rashid, Abdullah Ibn Muabiyah, Amr Ibn Rafe, Abu Hazar Bijli, Ismail Ibn Musa Ibn Hayyan Tamimi, Hisham Ibn Umarah and Muhammad Ibn Abu Khaled Abu Bakr Kazbini etc. are particularly noteworthy.\nImam Ibn Majah mastered Ilmul Hadith within a short time and became known as an established Muhaddith in the contemporary era. His success and fame spread far and wide. Many students came to him and quenched their thirst for knowledge. His number of students is very high. Among them, the names of Sulaiman Ibn Yazid, Ibrahim Ibn Dinar, Abul Hasan Ibn Kattan, Muhammad Ibn Isa As Safiar, Isa Ibn Absar (RA) etc. are particularly noteworthy.\nImam Ibn Majah scrutinized the hadith with extraordinary talent, devotion, perseverance and wisdom. The principles he follows in accepting and verifying hadith are as follows:\n1. The narrator must be fair;\n2. Narrator must not be a heretic and heretic;\n3. Be a follower of Saheeh Aqeedah;\n4. Must have good manners and manners;\n5. The hadith is acceptable after analyzing the narrators' reliability and fault-quality;\n6. If supported by the strength of the charter, it is acceptable for the time being, even if the separation appears on other accounts;\n7. All hadiths narrated by Bukhari and Muslim are acceptable;\n8. All the hadiths which have been acted upon by renowned scholars and jurists are acceptable;\n9. A weak hadith is generally accepted if it is supported by another authentic hadith.\nIbn Majah wrote the famous book 'As Sunan' which is popularly known as Sunan Ibn Majah or Ibn Majah Sharif. This hadith collection has a distinguished status among all Sihah Sitta books in all respects. First, its composition, decoration, comfort. Secondly, there is no particular repetition in the hadiths of this book. This feature is not found in any other compilation. Muhaddis Shah Abdul Aziz Dehlabi (RA) praised Ibn Majah Sharif highly. Imam Ibn Majah completed the design of this library after immense labor pursuits and selections. He has selected four thousand hadiths from millions of hadiths and arranged them in different chapters. There are total 32 chapters in this book. The total number of hadiths is 4338.\nImam Ibn Majah wrote many other valuable books besides this book. He also wrote a great commentary on the Qur'an based on hadiths. One of his most notable works is Milih on Tarikh. In this book, he has discussed the history in detail from the age of Sahabad to his own time.\nImam Ibn Majah died on Monday, 22 Ramadan 273 Hijri at the age of 64 in the city of Kazbin.",
      "الإمام ابن ماجه (رضي الله عنه) الملقب بمحمد أبو عبد الله. نسباتي اسم الباري الكزبيني. الاسم الكامل حافظ الحديث الإمام أبو عبد الله محمد بن يزيد بن عبد الله بن ماجه وربيع الكزبيني. كان يُدعى كازبيني أو قزوين لأنه من مواليد ساحل بحر قزوين. لكنه نال شهرة أكبر باسم ابن ماجه.\nولد ابن ماجه سنة 209 هجرية في مكان يسمى كازبين. أصبحت هذه المدينة مركز المعرفة الإسلامية بعد فتحها في عهد الخليفة الثالث عثمان بن عفان. ومنذ القرن الثالث الهجري اكتسبت هذه المدينة تميزًا خاصًا في ممارسة العلم والحديث. ونتيجة لذلك، حصل ابن ماجه على فرصة رائعة لممارسة الحديث في العلوم منذ الصغر.\nتلقى تعليمه الابتدائي في بيئة عائلية. اكتسب مهارات ممتازة في اللغتين العربية والفارسية. أكمل التعليم الرسمي بدون عمل. وبعد أن أكمل دراسة الحديث في مسقط رأسه بإحدى وعشرين سنة، زار مكة والمدينة ودمشق والكوفة والبصرة وبغداد وحمص وخراسان وبلخ ومصر وتنسي وأصفهان ونيسابور والوسط وغيرها ليتعلم الحديث ويجمعه. الحديث. خلال هذا الوقت، درس الحديث مع أعظم محدثي العصر واكتسب أصولا خاصة. ومن المحدثين الذين درس عليهم ابن ماجه الحديث علي بن محمد، وأبو الحسن التنفاسي، وأبو بكر عبد الله بن محمد، وأبو سعد عبد الله الأسد، وابن حبان التميمي، ومحمد بن عبد الله نمير، وأبو بكر عن أبي شيبة، وإبراهيم بن منشير. هشامي، داود بن رشيد، عبد الله بن معبية، عمرو بن رافع، أبو هزار البجلي، إسماعيل بن موسى بن حيان التميمي، هشام بن عمارة، ومحمد بن أبو خالد أبو بكر الكزبيني وغيرهم.\nأتقن الإمام ابن ماجه علم الحديث في فترة قصيرة وأصبح يُعرف بالمحدث الراسخ في العصر المعاصر. وانتشر نجاحه وشهرته في كل مكان. وكان يأتي إليه كثير من الطلاب ويروي عطشهم للمعرفة. - عدد طلابه مرتفع جداً . ومن بينها أسماء سليمان بن يزيد، وإبراهيم بن دينار، وأبو الحسن بن قطان، ومحمد بن عيسى الصفيار، وعيسى بن أبصار (رضي الله عنه) وغيرهم.\nوقد دقق الإمام ابن ماجه في الحديث بموهبة غير عادية، وإخلاص، ومثابرة، وحكمة. والأصول التي يتبعها في قبول الحديث والتحقق منه هي كما يلي:\n1. يجب أن يكون الراوي عادلاً؛\n2. ألا يكون الراوي زنديقاً ومهرطقاً؛\n3. كن من متابعي العقيدة الصحيحة؛\n4. يجب أن يتمتع بالأخلاق والأخلاق الحميدة؛\n5. والحديث مقبول بعد تحليل موثوقية الرواة وجودة خطأهم؛\n6. وإذا أيدته قوة الميثاق فهو مقبول في الوقت الراهن، حتى لو ظهر الانفصال على حسابات أخرى؛\n7. وجميع الأحاديث التي رواه البخاري ومسلم مقبولة؛\n8. وجميع الأحاديث التي عمل بها أعلام العلماء والفقهاء مقبولة؛\n9. والحديث الضعيف مقبول عموماً إذا كان مدعوماً بحديث آخر صحيح.\nوقد ألف ابن ماجه كتاب \"السنن\" الشهير المعروف بسنن ابن ماجه أو ابن ماجه الشريف. تتمتع مجموعة الأحاديث هذه بمكانة متميزة بين جميع كتب الصحاح الستة من جميع النواحي. أولا، تكوينه، والديكور، والراحة. ثانياً: ليس هناك تكرار خاص في أحاديث هذا الكتاب. هذه الميزة غير موجودة في أي تجميعة أخرى. وأشاد محدثي شاه عبد العزيز الدهلبي (رضي الله عنه) بابن ماجه شريف بشدة. أكمل الإمام ابن ماجه تصميم هذه المكتبة بعد جهد شاق واختيارات. وقد اختار أربعة آلاف حديث من ملايين الأحاديث ورتبها في أبواب مختلفة. هناك إجمالي 32 فصلا في هذا الكتاب. مجموع الأحاديث هو 4338.\nوقد ألف الإمام ابن ماجه العديد من الكتب القيمة الأخرى إلى جانب هذا الكتاب. كما كتب تفسيرًا عظيمًا للقرآن بناءً على الأحاديث. ومن أبرز أعماله مليح على تاريخ. وقد تناول في هذا الكتاب التاريخ بالتفصيل من عصر الصحابة إلى عصره.\nتوفي الإمام ابن ماجه يوم الاثنين 22 رمضان 273 هجرية عن عمر يناهز 64 عاما في مدينة كازبين."
    ],
    "image": "https://i.ibb.co/k3KYXJm/islamic-man.jpg"
  },
  {
    "_id": "667dc0f88f6f312a681e9cac",
    "name": ["ইমাম নাসাঈ (রহ.)", "Imam Nasa'i (RA)", "الإمام النسائي (رح)"],
    "desc": [
      "ইমাম নাসাঈ (রহ.) ইলমে হাদিসের আকাশে এক উজ্জ্বল নক্ষত্র। তিনি সিহাহ সিত্তার অন্যতম বিশুদ্ধ হাদিস গ্রন্থ ‘নাসাঈ শরীফ’সহ অনেক মূল্যবান গ্রন্থ প্রণয়ন করে মুসলিম বিশ্বে অবিস্মরণীয় হয়ে আছেন।\n\nসততা, বিশ্বস্ততা, ন্যায়পরায়ণতা ও আল্লাহভীরুতায় তিনি ছিলেন অনন্য। হাদিস চর্চায় তিনি নিজেকে উৎসর্গ করেছিলেন। মৃত্যু অবধি তিনি সহিহ হাদিসের সন্ধানে সময় কাটিয়েছেন। তার মতো নিবেদিতপ্রাণ হাদিস গবেষকদের কারণে আমাদের কাছে হাদিসের অালো এসে পৌঁছে।\n\nইমাম নাসাঈর প্রকৃত নাম আহমাদ, পিতার নাম শোয়াইব। ইমাম নাসাঈ (রহ.) ২১৫ হিজরি মোতাবেক ৮৩০ খ্রিস্টাব্দে মতান্তরে ২১৪ হিজরিতে খোরাসানের ‘নাসা’ নামক স্থানে জন্মগ্রহণ করেন। এ স্থানের দিকে সম্বন্ধিত করে তাকে আন-নাসাঈ বলা হয়। এ নামেই তিনি সমধিক প্রসিদ্ধি লাভ করেছেন।\n\nইমাম নাসাঈ (রহ.)-এর সময়ে খোরাসান ও তার পার্শ্ববর্তী এলাকাসমূহ জ্ঞান-বিজ্ঞান ও ইলমে হাদিসের কেন্দ্রভূমি হিসেবে পরিচিত ছিল। সেখানে অনেক খ্যাতনামা বিদ্বানের সমাবেশ ঘটেছিল। তিনি সেখানেই প্রখ্যাত আলেমদের তত্ত্ববধানে পড়া-লেখা শুরু করেন। ২৩০ হিজরিতে উচ্চশিক্ষা অর্জনের জন্য তৎকালীন সময়ের বিভিন্ন দেশ ও জনপদ সফর করেন।\n\nইমাম যাহাবি (রহ.) বলেন, ‘জ্ঞান অন্বেষণের জন্য তিনি খোরাসান, হিজায, মিসর, ইরাক, জাযিরা, সিরিয়া এবং সীমান্ত এলাকায় ভ্রমণ করেন। অতঃপর মিসরে স্থায়ীভাবে বসবাস শুরু করেন। ’\n\nদেশ-বিদেশে উচ্চশিক্ষা গ্রহণের পর ইমাম নাসাঈ (রহ.) হাদিসের দরস প্রদান শুরু করেন। অনেক শিক্ষার্থী তার নিকট থেকে ইলমে হাদিস শিক্ষা লাভ করেছে।\n\nইমাম নাসাঈ (রহ.) সুনানে নাসাঈ ছাড়াও কয়েকটি মূল্যবান গ্রন্থ রচনা করেছেন। তবে বেশি প্রসিদ্ধ লাভ করেছে নাসাঈ শরীফ। সুনানে নাসাঈতে সংকলিত হাদিস সংখ্যা ৪৪৮২টি। শায়খ নাছিরুদ্দীন আলবানীর গণনা অনুযায়ী নাসাঈর মোট হাদিস সংখ্যা ৫৭৫৮টি। এতে মোট একান্নটি অধ্যায় রয়েছে।\n\nসুনানে নাসাঈর এমন কিছু বৈশিষ্ট্য রয়েছে যা তাকে অপরাপর হাদিস গ্রন্থ থেকে পৃথক স্বাতন্ত্র্য দান করেছে। যেমন-\n\nঅন্য বিশুদ্ধ হাদিস গ্রন্থগুলোর ন্যায় সুনানে নাসাঈতে পুনঃউল্লিখিত হাদিসের সংখ্যা খুব কম। এতে পুনঃউল্লিখিত হাদিস নেই বললেই চলে।\n\nএ গ্রন্থে কোনো কোনো স্থানে হাদিসের দুর্বোধ্য শব্দসমূহের ব্যাখ্যা করা হয়েছে।\n\nইমাম নাসাঈ স্বীয় গ্রন্থে শক্তিশালী ও সহিহ সনদের ভিত্তিতে হাদিস সন্নিবেশিত করেছেন।\n\nইমাম নাসাঈ (রহ.) এ গ্রন্থে জীবনের প্রায় সকল দিক সম্পর্কিত ক্ষুদ্র ক্ষুদ্র শাখা-প্রশাখায় হাদিস সন্নিবেশিত করেছেন।\n\nসুনানে নাসাঈর হাদিসের অধ্যায়, অনুচ্ছেদ-পরিচ্ছেদগুলো ধারাবাহিকভাবে বিন্যস্ত। এ গ্রন্থের অনুচ্ছেদ-পরিচ্ছেদের শিরোনাম অত্যন্ত সংক্ষিপ্ত ও সহজবোধ্য। হাদিস ও শিরোনামের মধ্যে সাযুজ্য বিদ্যমান।\n\nএ গ্রন্থে ‘অনুচ্ছেদ’-এর অনুকূলে কোরআনে কারিমের কোনো আয়াত থাকলে তাও সন্নিবেশিত করা হয়েছে।\n\nইমাম নাসাঈ (রহ.) নির্মল চরিত্র মাধুর্যের অধিকারী ছিলেন। তিনি সদাসর্বদা আল্লাহতায়ালার ভয়ে ভীতবিহবল থাকতেন। একদিন পরপর তিনি সারা বছর নফল রোজা পালন করতেন। রাতে তাহাজ্জুদ নামাজ ও সময় পেলেই ইবাদত-বন্দেগিতে মনোনিবেশ করতেন। তিনি একাধিকবার হজব্রত পালন করেছেন।\n\nতার মৃত্যু ও দাফনের স্থান নিয়ে মতবিরোধ রয়েছে। কেউ বলেন তিনি মক্কায় মৃত্যুবরণ করেছেন। আবার কেউ বলেন তিনি ফিলিস্তিনে ইন্তেকাল করেছেন।\n\nহাফেয যাহাবি ‘তাযকিরাতুল হুফফাজ’ গ্রন্থে লিখেছেন, ইমাম নাসাঈ (রহ.) ৩০৩ হিজরির সফর মাসের ১৩ তারিখ সোমবার ফিলিস্তিনে মৃত্যুবরণ করেন। ’\n\nঐতিহাসিক ইবনে খাল্লিকান বলেন, ৩০৩ হিজরির শাবান মাসে তিনি মৃত্যুবরণ করেন। মৃত্যুকালে তার বয়স হয়েছিল ৮৮/৮৯ বছর। সাফা ও মারওয়া পাহাড়ের পাদদেশে তাকে দাফন করা হয়।\n\nঅন্য বর্ণনায় এসেছে, হাফেজ আবু আমির বলেন, ‘তিনি ফিলিস্তিনের রামাল্লায় ৩০৩ হিজরির ১০ সফর সোমবার রাত্রে মৃত্যুবরণ করেন এবং বায়তুল মোকাদ্দাসের সন্নিকটে তাকে দাফন করা হয়। ’\n\nইলমে হাদিসের প্রচার-প্রসার, হাদিস সংকলন ও সংরক্ষণে ইমাম নাসাঈ (রহ.)-এর অবদান অতুলনীয়। এ ক্ষণজন্মা মহামনীষীর জীবনের প্রতিটি পরতে পরতে রয়েছে আমাদের জন্য বহু শিক্ষণীয় বিষয়। আরবি তারিখ হিসেবে আজ তার মৃত্যু দিবস। এই দিনে তার প্রতি রইল অামাদের অসীম শ্রদ্ধা। দোয়া করি আল্লাহতায়ালা তার কবরকে জান্নাতের বাগানে পরিণত করুন। আমিন।",
      "Imam Nasa'i (RA) is a bright star in the sky of Ilm Hadith. He has become unforgettable in the Muslim world by producing many valuable books including Sihah Sitta's one of the purest hadith book 'Nasa'i Sharif'.\n\nHe was unique in honesty, faithfulness, justice and God-fearing. He devoted himself to the practice of hadith. Until his death he spent time searching for Sahih Hadith. The light of hadith reached us because of dedicated hadith researchers like him.\n\nImam Nasa'i's real name is Ahmad, father's name is Shoaib. Imam Nasa'i (RA) was born in 214 A.H. at a place called 'Nasa' in Khorasan in 830 A.D. according to 215 A.H. It is called An-Nasa'i in reference to this place. With this name, he has gained a lot of fame.\n\nDuring the time of Imam Nasa'i (r.a.), Khorasan and its surrounding areas were known as the center of science and knowledge of Hadith. Many famous scholars gathered there. He started studying there under the supervision of renowned scholars. In 230 Hijri, he visited different countries and towns of that time to acquire higher education.\n\nImam Zahabi (RA) said, 'In search of knowledge, he traveled to Khorasan, Hijaz, Egypt, Iraq, Jazira, Syria and border areas. Then he started living permanently in Egypt. '\n\nAfter receiving higher education in the country and abroad, Imam Nasa'i (RA) started teaching Hadith. Many students have learned Hadith from him.\n\nImam Nasa'i (R.A.) wrote some valuable books besides Sunan Nasa'i. But Nasai Sharif gained more fame. The number of hadiths compiled in Sunan Nasa'i is 4482. According to Sheikh Nasiruddin Albani's calculation, the total number of hadiths of Nasa'i is 5758. It has fifty one chapters in total.\n\nSunan Nasa'i has certain characteristics that distinguish it from other hadith books. For example-\n\nLike other pure hadith books, the number of hadith repeated in Sunan Nasa'i is very small. There is no hadith mentioned in it.\n\nIn some places in this book, the incomprehensible words of the hadith are explained.\n\nImam Nasa'i has inserted hadiths in his book based on strong and authentic chain of transmission.\n\nIn this book, Imam Nasa'i (R.A.) has included hadiths related to almost all aspects of life.\n\nIn Sunan Nasa'i hadith chapters, paragraphs are arranged sequentially. The section headings of this book are very short and easy to understand. Consistency exists between the hadith and the title.\n\nIn this book, in favor of 'paragraphs', if there are any verses of the Qur'an, they have also been inserted.\n\nImam Nasa'i (R.A.) was possessed of pure character and sweetness. He was always in fear of God. One day after another, he used to observe Nafal fast throughout the year. At night, Tahajjud prayed and when he had time, he concentrated on worship. He has performed Hajj several times.\n\nThere is disagreement about his place of death and burial. Some say he died in Mecca. Others say he died in Palestine.\n\nHafez Zahabi wrote in the book \"Tazkiratul Huffaz\", Imam Nasa'i (RA) died in Palestine on Monday, 13th of the month of Safar, 303 Hijri. '\n\nHistorian Ibn Khallikan said that he died in the month of Shaban of 303 Hijri. He was 88/89 years old at the time of his death. He was buried at the foot of the hills of Safa and Marwa.\n\nIn another narration, Hafez Abu Amir said, \"He died on Monday night, 10 Safar 303 Hijri, in Ramallah, Palestine, and was buried near Baitul Moqaddas.\" '\n\nThe contribution of Imam Nasa'i (R.A.) in propagation of hadith in science, collection and preservation of hadith is incomparable. There are many lessons for us in every aspect of the life of this momentous great thinker. Today is his death anniversary in Arabic. We have immense respect for him on this day. May Allah turn his grave into a paradise garden. Amen.",
      "الإمام النسائي (رضي الله عنه) نجم ساطع في سماء علم الحديث. لقد أصبح لا يُنسى في العالم الإسلامي من خلال إنتاج العديد من الكتب القيمة بما في ذلك كتاب الصحاح ستة وهو من أنقى كتب الحديث \"النسائي شريف\".\n\nوكان فريدا في الصدق والإخلاص والعدالة ومخافة الله. كرس نفسه لممارسة الحديث. حتى وفاته أمضى وقتًا في البحث عن الحديث الصحيح. وقد وصل إلينا نور الحديث بفضل باحثين متخصصين في الحديث مثله.\n\nالاسم الحقيقي للإمام النسائي هو أحمد، واسم الأب شعيب. ولد الإمام النسائي (رضي الله عنه) سنة 214 هجرية في مكان يسمى ناسا بخراسان سنة 830 م الموافق 215 هجرية. ويسمى النسائي نسبة إلى هذا المكان. وبهذا الاسم اكتسب شهرة كبيرة.\n\nوفي عهد الإمام النسائي (رضي الله عنه)، كانت خراسان والمناطق المحيطة بها معروفة بأنها مركز علوم ومعرفة الحديث. اجتمع هناك العديد من العلماء المشهورين. وبدأ الدراسة هناك على يد كبار العلماء. وفي عام 230 هجرية، زار بلدان ومدن مختلفة في ذلك الوقت للحصول على التعليم العالي.\n\nقال الإمام الذهبي (رضي الله عنه): رحل في طلب العلم إلى خراسان والحجاز ومصر والعراق والجزيرة والشام والنواحي. ثم بدأ يعيش بشكل دائم في مصر. '\n\nبعد حصوله على التعليم العالي في البلاد وخارجها، بدأ الإمام النسائي (رضي الله عنه) بتدريس الحديث. وقد تعلم منه كثير من الطلاب الحديث.\n\nللإمام النسائي (رضي الله عنه) عدة كتب قيمة إلى جانب سنن النسائي. لكن ناساي شريف اكتسب المزيد من الشهرة. عدد الأحاديث المجمعة في سنن النسائي 4482 حديثا. وبحسب حسابات الشيخ ناصر الدين الألباني فإن مجموع أحاديث النسائي هو 5758. وهو يتألف من واحد وخمسين فصلا في المجموع.\n\nلسنن النسائي خصائص معينة تميزه عن غيره من كتب الحديث. على سبيل المثال-\n\nوكغيره من كتب الحديث الشريف فإن عدد الأحاديث المكررة في سنن النسائي قليل جداً. وقيل: ليس فيه حديث مكرر.\n\nوفي بعض المواضع من هذا الكتاب شرح ألفاظ الحديث غير المفهومة.\n\nوقد أدخل الإمام النسائي في كتابه أحاديث بإسناد قوي وصحيح.\n\nوقد أدرج الإمام النسائي (رضي الله عنه) في هذا الكتاب أحاديث تتعلق بجميع جوانب الحياة تقريبًا.\n\nوفي فصول حديث سنن النسائي، يتم ترتيب الفقرات بالتسلسل. عناوين أقسام هذا الكتاب قصيرة جدًا وسهلة الفهم. هناك تطابق بين الحديث والعنوان.\n\nفي هذا الكتاب، لصالح \"الفقرات\"، إذا كان هناك أي آيات من القرآن، فقد تم إدراجها أيضًا.\n\nوكان الإمام النسائي (رضي الله عنه) يتمتع بصفاء الخلق والحلاوة. وكان دائما في خوف من الله. وكان يومًا بعد يوم يصوم النفل طوال العام. في الليل كان يصلي التهجد وعندما يكون لديه وقت يركز على العبادة. وقد أدى فريضة الحج عدة مرات.\n\nهناك خلاف حول مكان وفاته ودفنه. ومنهم من قال إنه مات بمكة. ويقول آخرون إنه مات في فلسطين.\n\nكتب الحافظ الذهبي في كتاب تذكرة الحفاظ أن الإمام النسائي (رضي الله عنه) توفي في فلسطين يوم الاثنين 13 من شهر صفر سنة 303 هجرية. '\n\nوقال المؤرخ ابن خلكان إنه توفي في شهر شعبان سنة 303 هجرية. كان عمره 88/89 عامًا وقت وفاته. ودفن عند سفح جبلي الصفا والمروة.\n\nوفي رواية أخرى قال حافظ أبو عامر: توفي ليلة الاثنين ١٠ صفر سنة ٣٠٣ هـ بمدينة رام الله بفلسطين، ودفن بالقرب من بيت المقدس. '\n\nإن مساهمة الإمام النسائي (رضي الله عنه) في نشر الحديث في العلوم وتجميع الحديث وحفظه لا تضاهى. هناك العديد من الدروس لنا في كل جانب من جوانب حياة هذا المفكر العظيم. اليوم هو ذكرى وفاته باللغة العربية. لدينا احترام كبير له في هذا اليوم. جعل الله قبره روضة من رياض الجنة . آمين."
    ],
    "image": "https://i.ibb.co/k3KYXJm/islamic-man.jpg"
  },
  {
    "_id": "667dc1018f6f312a681e9cad",
    "name": ["ইমাম তিরমিজি (রহ.)", "Imam Tirmidhi (RA)", "الإمام الترمذي (رح)"],
    "desc": [
      "যুগে যুগে যারা প্রিয়নবী (সা.)-এর হাদিসের আঞ্জাম দিয়েছেন, তাদের মধ্যে উল্লেখযোগ্য একজন হচ্ছেন ইমাম তিরমিজি (রহ.)। কর্মজীবনে মুসলিম উম্মাহর জন্য যে খেদমত তিনি করেছেন, তাতে মুসলিম জাতি তাকে শ্রদ্ধার সঙ্গে স্মরণ করবে অনন্তকাল। এই মহান ব্যক্তির আসল নাম মুহাম্মদ, উপনাম আবু ঈসা। পূর্ণনাম আবু ঈসা মুহাম্মদ ইবনে সারওয়াহ ইবনে মুসা ইবনে দাহহাক ইবনে তিরমিজি। ইমাম তিরমিজি নামেই তিনি পরিচিত, নন্দিত।\n\nখলিফা আবদুল্লাহ আল মামুনের যুগে হাদিসবিদ ইমাম তিরমিজি (রহ.) মধ্য এশিয়া ট্রান্স-অক্সিয়ানার পাশে জীহুন নদীর বেলাভূমে অবস্থিত ‘তিরমিজ’ নামক প্রচীন শহরে ২০৯ হিজরি সনে সম্ভ্রান্ত মুসলিম পরিবারে জন্মগ্রহণ করেন। তিনি বাল্যকাল নিজ জন্মস্থানেই অতিবাহিত করেন এবং সেখানেই কুরআন, তাজবিদ, ফিকহ, সাহিত্য, দর্শন ইত্যাদি বিষয়ে জ্ঞান অর্জন করেন। বাল্যকালেই হাদিস শ্রবণ এবং হাদিস সংগ্রহ করার প্রতি তার ছিল প্রবল আগ্রহ। তাই তিনি হাদিস শিক্ষার জন্য খুরাসানের নিশাপুরে এরপর সমরকন্দ, কুফা, বসরা, হিজাজ ও বাগদাদে খ্যাতনামা মুহাদ্দিসদের কাছে হাদিস শিক্ষাগ্রহণ করেন।\n\nইমাম তিরমিজি (রহ.) যে সব মুহাদ্দিসের কাছে হাদিস শিক্ষাগ্রহণ করেন, তাদের মধ্যে প্রসিদ্ধ হচ্ছেন-ইমাম বোখারি (রহ.), ইমাম মুসলিম (রহ.), ইমাম আবু দাউদ (রহ.), হজরত কুতাইবা ইবনে সাইদ (রহ.), ইসহাক ইবনে মুসা (রহ.), মুহাম্মদ ইবনে গাইলান (রহ.), সাইদ ইবনে আবদুর রহমান (রহ.), মুহাম্মদ ইবনে বাশশার (রহ.), আলী ইবনে হাজার (রহ.), মুহাম্মদ ইবনে মুসান্না (রহ.), সুফিয়ান ইবনে ওয়াকী (রহ.), আহমদ ইবনে মানী (রহ.) প্রমুখ। (আল হাদিস ওয়াল মুহাদ্দিসুন : ৩৬০)।\n\nইমাম তিরমিজি (রহ.) তীক্ষÈ মেধা ও অসাধারণ স্মৃতিশক্তির অধিকারী ছিলেন। তিনি হাদিস একবার শুনেই তা পুনরায় হুবহু শোনাতে পারতেন। তার উস্তাদরা পাঠদানের সময় তার কাছ থেকেও উপকৃত হতেন। এ প্রসঙ্গে ইমাম বোখারি (রহ.) বলেন, ‘ইসতাফাদতু মিনকা মা লাম তাসতাফিদু মিন্নি’-অর্থাৎ আমি তোমার কাছ থেকে যতটা উপকৃত হয়েছি, তুমি আমার থেকে ততটা উপকৃত হতে পারনি।\n\nইমাম তিরমিজি (রহ.)-এর মুখস্থ শক্তির একটি চমকপ্রদ ঘটনা রয়েছে। একবার জনৈক মুহাদ্দিসের বর্ণিত কয়েকটি হাদিসাংশ তিনি শ্রবণ করেছিলেন। কিন্তু সে মুহাদ্দিসের সঙ্গে দীর্ঘদিন তার সাক্ষাৎ হয়নি। ফলে তিনি মনে মনে সে মুহাদ্দিসের সন্ধানে উদগ্রীব ছিলেন। একদিন পথিমধ্যে মুহাদ্দিসের সাক্ষাৎ পেয়ে তার কাছ থেকে পুরো হাদিস শোনার বাসনা প্রকাশ করলেন ইমাম তিরমিজি (রহ.)। তৎক্ষণাৎ সেই মুহাদ্দিস পুরো হাদিস পথিমধ্যে দাঁড়ানো অবস্থায় শুনিয়ে দিলেন। ইমাম তিরমিজিও (রহ.) তা শ্রবণের সঙ্গে সঙ্গেই মুখস্থ করে ফেললেন। তা দেখে সেই মুহাদ্দিস বড়ই বিস্মিত হন। ইমাম তিরমিজি (রহ.)-এর স্মরণশক্তি পরীক্ষা করার জন্য তিনি আরো চল্লিশটি বিশেষ হাদিস পাঠ করেন। ইমাম তিরমিজি (রহ.) ইতিপূর্বে এই হাদিসগুলো কোনো দিন শুনেননি, তা সত্ত্বেও মাত্র একবার শুনে সম্পূর্ণ মুখস্থ হাদিসগুলো তাকে শুনিয়ে দিলেন, এতে একটি শব্দও ভুল হয়নি। (মুকদ্দমায়ে তরজুমানুস সুন্নাহ : ১/২৬১)।\n\nইমাম তিরমিজি (রহ.) পুরো কর্মজীবন হাদিস শিক্ষাদানে কাটান। ইমাম বোখারি (রহ.)-এর ইন্তেকালের পর খুরাসানে তার সমকক্ষ আর কোনো হাদিসবিদ ছিলেন না। হাদিস অধ্যয়নের জন্য খুরাসান, তুর্কিস্তান ও অন্যান্য প্রত্যন্ত অঞ্চল থেকে মানুষ তার কাছে হাদিস শিক্ষার জন্য আসতেন। তার ছাত্রদের মধ্যে উল্লেখযোগ্য হচ্ছেন, আবু আহমদ ইবনে আবদুল্লাহ (রহ.), হাইসাব ইবনে কুলাইব (রহ.), আবুল আব্বাস মুহাম্মদ ইবনে আহমদ (রহ.), আহমদ ইবনে ইউসুফ নসফি (রহ.), আবদ ইবনে মুহাম্মদ (রহ.) এবং আবু দাউদ ইবনে নসর (রহ.) প্রমুখ।\n\nইমাম তিরমিজি (রহ.)-এর মাজহাব সম্পর্কে বিভিন্ন মত রয়েছে। আল্লামা কাশ্মীরি (রহ.) তার ফয়জুল বারী গ্রন্থে লিখেছেন, ‘ইমাম তিরমিজি (রহ.) শাফিই মাজহাবের অনুসারী ছিলেন।’ শাহ ওয়ালি উল্লাহ মুহাদ্দিস দেহলভী (রহ.) বলেন, ‘তিনি একজন মুজতাহিদ; যদিও তাকে ইমাম আহমদ ইবনে হাম্বল ও ইসহাক ইবনে রাহওয়াই-এর মাজহাবের অনুসারী বলা হয়।’ আল্লামা জাহবী বলেছেন, ‘ইমাম তিরমিজি মুজতাহিদ ছিলেন।’ (তাজকিরাতুল মুহাদ্দিসিন : ১/৩২২)।\n\nইমাম তিরমিজি (রহ.) ছিলেন অত্যন্ত বিনয়ী ও পরহেজগার ব্যক্তি এবং উত্তম চরিত্রের অধিকারী। দিনের বেশিরভাগ সময় তিনি ইবাদতে কাটাতেন এবং আল্লাহর ভয়ে সর্বদা কাঁদতেন। এমনকি আল্লাহর ভয়ে কাঁদতে কাঁদতে শেষ বয়সে চোখের দৃষ্টি হারিয়ে অন্ধ হয়ে গিয়েছিলেন। (বুসতানুল মুহাদ্দিসিন : ১৮৫)। ইমাম বোখারি (রহ.) তার সম্পর্কে অনেক প্রশংসা করেছেন। মুহাদ্দিসরা তাকে ইমাম বোখারি (রহ.)-এর খলিফা বলেও উল্লেখ করেছেন। ইমাম বোখারি (রহ.) নিজেও ইমাম তিরমিজি (রহ.) থেকে হাদিস গ্রহণ করেছেন এবং বর্ণনাও করেছেন। (মুকদ্দমায়ে তরজুমানুস সুন্নাহ : ১/২৬১)।\n\nইমাম তিরমিজি (রহ.) ছাত্রদের পাঠদানের পাশাপাশি অনেক গ্রন্থও রচনা করেছেন। তার অন্যতম প্রসিদ্ধ গ্রন্থগুলো হচ্ছে- জামে তিরমিজি, শামায়েলে তিরমিজি, কিতাবুল ইলাল, কিতাবুত তারিখ, কিতাবুল আসমা ওয়াল কুনা, আল ইলালুল কুবরা, আল ইলালুস সুগরা, কিতাবুল মুফরাদ, কিতাবুল জুহদ ইত্যাদি। তার গ্রন্থগুলোর মধ্যে সহিহ তিরমিজি একটি অন্যতম গ্রন্থ। সর্বাধিক প্রসিদ্ধ দুটি জামে হাদিস গ্রন্থের মধ্যে এটি একটি। কতিপয় মুহাদ্দিস গ্রন্থটিকে ‘সুনান’ বললেও বেশিরভাগ মুহাদ্দিস ‘জামে’ নামে গ্রহণ করেছেন। গ্রন্থটিতে ৩৮১২টি হাদিস সংকলিত হয়েছে। হাদিসগুলো ৪৬টি অধ্যায় এবং ২৪১৪টি পরিচ্ছেদে সাজানো হয়েছে।\n\nইমাম তিরমিজি (রহ.) প্রণীত ‘জামে তিরমিজি’ গ্রন্থটি অনেক বৈশিষ্ট্যের অধিকারী। যেমন- ১. প্রতিটি হাদিসের বর্ণনা শেষে বিভিন্ন মাজহাবের ইখতিলাফ (মতভেদ) এবং এর সমর্থনে প্রমাণ উল্লেখ হয়েছে। ২. এ গ্রন্থটি সুসজ্জিত এবং হাদিসগুলো সুবিন্যস্তভাবে সংকলিত। ৩. পুনরুল্লিখিত হাদিসের সংখ্যা খুবই নগণ্য। ৪. হাদিসের প্রকারভেদ সহিহ, হাসান, জইফ, গরিব ও মুআল্লাল প্রভৃতির স্তর নির্দেশিত হয়েছে। ৫. রাবী বা হাদিস বর্ণনাকারীদের নাম, উপনাম, উপাধি এবং চরিত্র সম্পর্কে বহু তথ্য সন্নিবেশিত হয়েছে। ৬. কোনো জটিল শব্দ প্রয়োগ হলে তার ব্যাখ্যা প্রদান করা হয়েছে। ৭. কোনো হাদিসের সনদ বা মতনের মধ্যে সন্দেহ হলে তা পৃথকভাবে বর্ণনা করা হয়েছে। ৮. ‘সুনান’ শাস্ত্রের মতো ফিকহ শাস্ত্রের নিয়মানুযায়ী তাহারাত, সালাত, জাকাত, সাওম প্রভৃতি বিষয় ধারাবাহিকভাবে বর্ণনা করা হয়েছে। ৯. প্রতিটি হাদিসের মূল বর্ণনাকারী হতে শেষ বর্ণনাকারী পর্যন্ত বর্ণনা-শৃঙ্খলে প্রত্যেকের নাম সনদে উল্লেখ করা হয়েছে। ১০. প্রতিটি হাদিস বর্ণনাকারীর পর এর নির্ভরযোগ্যতা সম্পর্কে সংক্ষিপ্ত মন্তব্য দেওয়া হয়েছে। জামে তিরমিজির বৈশিষ্ট্যের প্রতি ইঙ্গিত দিয়ে শাহ ওয়ালিউল্লাহ (রহ.) বলেছেন, ‘হাদিসের জ্ঞান-সাধকদের জন্য ইমাম তিরমিজি (রহ.) তার হাদিস গ্রন্থে প্রয়োজনীয় কিছুই বাদ রাখেননি।’ এই জন্যই বলা হয়, জামে তিরমিজি মুজতাহিদ ও মুকাল্লিদ উভয়ের প্রয়োজন মেটাতে যথেষ্ট।\n\nইমাম তিরমিজি (রহ.)-এর গ্রন্থগুলো মধ্যে আরেকটি অন্যতম গ্রন্থ হচ্ছে, ‘শামায়েলে তিরমিজি’। এ গ্রন্থে রাসুল (সা.)-এর ব্যক্তিজীবন, চারিত্রিক বৈশিষ্ট্য, আচার-আচরণ এবং পোশাক-পরিচ্ছদ সম্পর্কিত চারশ’ হাদিস সন্নিবেশিত হয়েছে। গ্রন্থটি মোট ৫৬টি পরিচ্ছেদে ভাগ করা হয়েছে। এ গ্রন্থের মাধ্যমে প্রিয়নবী (সা.)-এর সার্বিক জীবনের পুরো চিত্রটি ফুটে উঠেছে। ইমাম তিরমিজির অন্য একটি গ্রন্থ হচ্ছে, ‘কিতাবুল ইলাল’। এ গ্রন্থে হাদিসের অন্তর্নিহিত সূক্ষ্মতা দোষ-ত্রুটিগুলো নিরূপণ করা হয়েছে। এতে ইমাম তিরমিজি (রহ.)-এর গভীর জ্ঞান ও তীক্ষ্ন বিচার-বুদ্ধির পরিচয় পাওয়া যায়।\n\nইমাম তিরমিজি (রহ.) দীর্ঘকাল হাদিসচর্চা করে ৭০ বছর বয়সে ২৭৯ হিজরিতে ১৩ রজব সোমবার তিরমিজ নামক শহরে ইন্তেকাল করেন। ইমাম তিরমিজি (রহ.) তার নিরলস প্রচেষ্টায় হাদিস শাস্ত্রে যে অবদান রেখেছেন, তাতে তিনি মুসলিম বিশ্বজুড়ে খ্যাতির অধিকারী হয়ে আছেন আজও অবধি।",
      "Imam Tirmidhi (R.A.) is one of the most important narrators of the hadiths of the Prophet (S.A.W.) throughout the ages. The Muslim nation will forever remember him with respect for the service he did for the Muslim Ummah during his career. This great man's real name is Muhammad, alias Abu Isa. Full name Abu Isa Muhammad Ibn Sarwah Ibn Musa Ibn Dahhak Ibn Tirmidhi. He is known as Imam Tirmidhi, Nandit.\n\nHadith scholar Imam Tirmidhi (RA) was born in 209 Hijri to a noble Muslim family in the ancient city of 'Tirmidhi' located on the banks of the Jihun river in Central Asia Trans-Oxiana during the era of Caliph Abdullah Al Ma'mun. He spent his childhood in his native place and acquired knowledge of Quran, Tajwid, Fiqh, Literature, Philosophy etc. there. He had a keen interest in listening to hadith and collecting hadith since childhood. So he studied Hadith in Nishapur, Khurasan and then in Samarkand, Kufa, Basra, Hijaz and Baghdad from famous Muhaddis.\n\nImam Tirmidhi (R.A.) studied Hadith with Imam Bukhari (R.A.), Imam Muslim (R.A.), Imam Abu Dawud (R.A.), Hazrat Qutaiba Ibn Said (R.A.), Ishaq ibn Musa (r.), Muhammad ibn Ghailan (r.), Said ibn Abdur Rahman (r.), Muhammad ibn Bashhar (r.), Ali ibn Hazar (r.), Muhammad ibn Musanna (r.), Sufyan Ibn Waki ​​(RA), Ahmad Ibn Mani (RA) etc. (Al Hadith Wal Muhaddisun: 360).\n\nImam Tirmidhi (R.A.) was possessed of sharp intelligence and extraordinary memory. He could recite the hadith exactly once after hearing it. His masters also benefited from him while teaching. In this context, Imam Bokhari (RA) said, 'Istafadtu minka ma lam tastafidu minni' - that is, as much as I have benefited from you, you have not benefited from me as much.\n\nThere is an amazing case of Imam Tirmidhi's (RA) memorizing power. Once he heard some hadith narrated by a muhaddith. But he did not meet Muhaddis for a long time. As a result, he was eager to find that Muhaddith in his heart. One day Imam Tirmidhi (RA) met Muhaddith on the way and expressed his desire to hear the entire hadith from him. Immediately that muhaddith recited the entire hadith while standing on the road. Imam Tirmidhi (RA) memorized it as soon as he heard it. The muhaddith was very surprised to see that. In order to test Imam Tirmidhi's (RA) memory, he recited forty more specific hadiths. Imam Tirmidhi (R.A.) had never heard these hadiths before, yet he recited the entire hadiths to him by heart after just one hearing, without a single word missing. (Tarjumanus Sunnah in the case: 1/261).\n\nImam Tirmidhi (RA) spent his entire career teaching hadith. After the death of Imam Bokhari (r.a.), there was no hadith scholar of his equal in Khurasan. People from Khurasan, Turkestan and other remote areas used to come to him for the study of Hadith. Notable among his students were Abu Ahmad ibn Abdullah (r.a.), Haysab ibn Kulaib (r.a.), Abul Abbas Muhammad ibn Ahmad (r.a.), Ahmad ibn Yusuf Nasfi (r.a.), Abd ibn Muhammad (r.a.) and Abu Dawud Ibn Nasr (RA) and others.\n\nThere are different opinions about the Madhhab of Imam Tirmidhi (RA). Allama Kashmiri (RA) wrote in his book Faizul Bari, 'Imam Tirmidhi (RA) was a follower of the Shafi'i Madhhab.' Shah Wali Ullah Muhaddis Dehlavi (RA) said, 'He was a Mujtahid; Although he is said to be a follower of the Madhhab of Imam Ahmad Ibn Hanbal and Ishaq Ibn Rahwai. Allama Zahabi said, \"Imam Tirmidhi was a Mujtahid.\" (Tajkirat al-Muhaddisin: 1/322).\n\nImam Tirmidhi (RA) was a very humble and pious person and had good character. He spent most of the day in worship and always wept in fear of Allah. He even lost his eyesight and became blind at his last age crying out of fear of Allah. (Bustanul Muhaddisin: 185). Imam Bokhari (RA) praised him a lot. The Muhaddis also refer to him as the Caliph of Imam Bukhari (RA). Imam Bokhari (R.A.) himself accepted and narrated hadith from Imam Tirmidhi (R.A.). (Tarjumanus Sunnah in the case: 1/261).\n\nBesides teaching students, Imam Tirmidhi (RA) also wrote many books. Some of his famous books are - Jame Tirmidhi, Shamayel Tirmidhi, Kitabul Ilal, Kitabut Tarikh, Kitabul Asma Wal Kuna, Al Ilalul Kubra, Al Illalus Sugra, Kitabul Mufarad, Kitabul Juhd etc. Sahih Tirmidhi is one of his books. It is one of the two most famous Jame Hadith books. Some Muhaddis call the book 'Sunan' but most Muhaddis accept it as 'Jame'. 3812 hadiths have been compiled in the book. The hadiths are arranged in 46 chapters and 2414 chapters.\n\nThe book 'Jamae Tirmizi' written by Imam Tirmizi (RA) has many characteristics. For example- 1. At the end of the description of each hadith, the ikhtilaf (disagreement) of different madhhabs and the supporting evidence are mentioned. 2. This book is well organized and the hadiths are well organized. 3. The number of narrated hadiths is negligible. 4. The types of hadith are indicated as Sahih, Hasan, Zaif, Gharib and Mu'allal etc. 5. A lot of information is inserted about the names, surnames, titles and character of the rabies or hadith narrators. 6. Explanations are provided when any complex terms are used. 7. no limit",
      "يعد الإمام الترمذي (رضي الله عنه) أحد أهم رواة الأحاديث النبوية (ص) على مر العصور. وستتذكره الأمة الإسلامية إلى الأبد باحترام الخدمة التي قدمها للأمة الإسلامية خلال مسيرته. الاسم الحقيقي لهذا الرجل العظيم هو محمد، الملقب بأبي عيسى. الاسم الكامل أبو عيسى محمد بن صرواح بن موسى بن الضحاك بن الترمذي. وهو معروف بالإمام الترمذي، نانديت.\n\nولد المحدث الإمام الترمذي (رضي الله عنه) عام 209 هجرية لعائلة مسلمة شريفة في مدينة 'الترمذي' القديمة الواقعة على ضفاف نهر جيحون في آسيا الوسطى عبر أوكسيانا في عهد الخليفة عبد الله المأمون. أمضى طفولته في موطنه الأصلي واكتسب هناك المعرفة بالقرآن والتجويد والفقه والأدب والفلسفة وما إلى ذلك. كان شديد الاهتمام بسماع الحديث وجمع الحديث منذ الصغر. فدرس الحديث بنيسابور وخراسان ثم في سمرقند والكوفة والبصرة والحجاز وبغداد من مشاهير المحدثين.\n\nدرس الإمام الترمذي (R.A.) الحديث مع الإمام البخاري (R.A.)، الإمام مسلم (R.A.)، الإمام أبو داود (R.A.)، حضرة قتيبة بن سعيد (R.A.)، إسحاق بن موسى (ص)، محمد بن غيلان (ص.) ، سعيد بن عبد الرحمن (ص)، محمد بن بشار (ص)، علي بن حضر (ص)، محمد بن مصنع (ص)، سفيان بن وكيع (رض)، أحمد بن ماني (رض) الخ . (الحديث والمهندسون: 360).\n\nكان الإمام الترمذي (رضي الله عنه) يتمتع بذكاء حاد وذاكرة غير عادية. وكان يستطيع أن يعيد الحديث بمجرد سماعه. كما استفاد منه أسياده أثناء التدريس. وفي هذا السياق قال الإمام البخاري (رضي الله عنه): \"استفادت منكا ما لم تستفد مني\" - أي بقدر ما استفدت منك، لم تستفد مني بقدر ما استفدت منه.\n\nهناك حالة مذهلة من قوة حفظ الإمام الترمذي (رضي الله عنه). ذات مرة سمع حديثاً رواه محدث. لكنه لم يلتق بالمحدثي لفترة طويلة. ونتيجة لذلك، كان حريصًا على أن يجد ذلك المحدث في قلبه. ذات يوم التقى الإمام الترمذي (رضي الله عنه) بالمحدث في الطريق وأعرب عن رغبته في سماع الحديث كاملاً منه. وعلى الفور قرأ ذلك المحدث الحديث كاملاً وهو واقف في الطريق. وقد حفظه الإمام الترمذي (رضي الله عنه) فور سماعه. فتعجب المحدث كثيراً من ذلك. ومن أجل اختبار ذاكرة الإمام الترمذي (رضي الله عنه)، قرأ أربعين حديثًا محددًا. الإمام الترمذي (رضي الله عنه) لم يسمع هذه الأحاديث من قبل، لكنه قرأ عليه الأحاديث كاملة عن ظهر قلب بعد سماع واحد فقط، دون أن تفقد كلمة واحدة. (ترجمان السنة في القضية: 1/261).\n\nأمضى الإمام الترمذي (رضي الله عنه) حياته المهنية بأكملها في تدريس الحديث. وبعد وفاة الإمام البخاري (رضي الله عنه) لم يكن هناك مثله من المحدثين في خراسان. وكان أهل خراسان وتركستان وغيرهما من النواحي يأتون إليه لدراسة الحديث. ومن تلاميذه البارزين: أبو أحمد بن عبد الله (رضي الله عنه)، وهيصب بن كليب (رضي الله عنه)، وأبو العباس محمد بن أحمد (رضي الله عنه)، وأحمد بن يوسف نسفي (رضي الله عنه)، وعبد بن محمد (رضي الله عنه)، وأبو داود بن نصر (رضي الله عنه). ) و اخرين.\n\nهناك آراء مختلفة حول مذهب الإمام الترمذي (رضي الله عنه). كتب العلامة الكشميري (رضي الله عنه) في كتابه فيض الباري، “كان الإمام الترمذي (رضي الله عنه) من أتباع المذهب الشافعي”. وقال شاه ولي الله محدث دهلوي (رضي الله عنه): “كان مجتهدًا؛ وإن كان يقال إنه من أصحاب مذهب الإمام أحمد بن حنبل وإسحاق بن راهويه قال: \"الإمام الترمذي مجتهد\" (تجيرة المهندسين: 1/322).\n\nوكان الإمام الترمذي (رضي الله عنه) إنساناً متواضعاً وتقياً جداً وكان يتمتع بخلق حسن. كان يقضي معظم يومه في العبادة ويبكي دائمًا من خشية الله. حتى أنه فقد بصره وأعمى في آخر عمره، وهو يبكي من خشية الله. (بستان المهندسين: 185). وقد أثنى عليه الإمام البخاري (رضي الله عنه) كثيراً. ويشير إليه المحدثون أيضًا بخليفة الإمام البخاري (رضي الله عنه). الإمام البخاري (R.A.) قبل نفسه وروى الحديث عن الإمام الترمذي (R.A.). (ترجمان السنة في القضية: 1/261).\n\nإلى جانب تدريس الطلاب، كتب الإمام الترمذي (رضي الله عنه) أيضًا العديد من الكتب. بعض كتبه الشهيرة هي - جامع الترمذي، شمايل الترمذي، كتاب العلال، كتاب تاريخ، كتاب الأسماء والكنا، آل إيلالول الكبرى، آل إيلالوس سكرة، كتاب الفرد، كتاب الجهد الخ. وصحيح الترمذي من كتبه. وهو أحد أشهر كتابين جامع الحديث. بعض المحدثين يطلقون على الكتاب اسم \"السنن\" لكن معظم المحدثين يقبلونه باسم \"الجامع\". وقد تم جمع 3812 حديثا في الكتاب. الأحاديث مرتبة في 46 باباً و 2414 باباً.\n\nكتاب جامع الترمذي للإمام الترمذي (رضي الله عنه) له خصائص عديدة. على سبيل المثال- 1. وفي نهاية رواية كل حديث يذكر اختلاف المذاهب والأدلة الداعمة لها. 2. وهذا الكتاب منظم بشكل جيد والأحاديث منظمة بشكل جيد. 3. وعدد الأحاديث المروية قليل جداً. 4. تتم الإشارة إلى أنواع الحديث على النحو الصحيح والحسن والضعيف والغريب والمعلق الخ. 5. يتم إدراج الكثير من المعلومات حول أسماء وألقاب وألقاب وشخصية رواة داء الكلب أو الحديث. 6. يتم توفير التوضيحات عند استخدام أي مصطلحات معقدة. 7. لا حدود"
    ],
    "image": "https://i.ibb.co/k3KYXJm/islamic-man.jpg"
  },
  {
    "_id": "667dc1098f6f312a681e9cae",
    "name": [
      "ইমাম আবু দাউদ (রাহ)",
      "Imam Abu Dawud (RA)",
      "الامام ابو داود (رح)"
    ],
    "desc": [
      "মহান আল্লাহ দ্বীন ও শরিয়তের পরিপূর্ণ সংরক্ষণের দায়িত্ব নিজেই নিয়েছেন। কোরআনে কারিমের সুরায়ে হিজরের ৯ নম্বর আয়াতে ইরশাদ হয়েছে, 'নিশ্চয়ই এ উপদেশবাণী আমি অবতীর্ণ করেছি এবং আমিই এর রক্ষাকারী।' এ আয়াতে আল্লাহ তায়ালা শুধু কোরআনে কারিমের শব্দের সংরক্ষণের ওয়াদা করেননি, বরং এর সঙ্গে সঙ্গে তাঁর প্রিয় রাসুল (সা.)-এর বাণী ও আদর্শ, যা আল্লাহ পাকের কোরআনের ব্যাখ্যা ও বাস্তব চিত্র, তারও পুঙ্খানুপুঙ্খ সংরক্ষণের দায়িত্ব নিয়েছেন, যা পরিভাষায় রাসুল (সা.)-এর হাদিস ও সুন্নাহ নামে পরিচিত। আর সেই সংরক্ষণের বাস্তবায়নের অংশবিশেষ আল্লাহ তায়ালা যুগে যুগে পৃথিবীতে এমন নূরানি কাফেলার সমাবেশ ঘটিয়েছেন, যাঁরা স্বীয় জ্ঞানচর্চা ও ত্যাগ-তিতিক্ষার মাধ্যমে ধরার বুকে প্রিয় রাসুলের আদর্শ ও বাণীর একেকটি অক্ষর ও একেকটি মুহূর্তের বিবরণ সংরক্ষণ করেছিলেন।\n\n\nআর মুক্ত রেখেছিলেন সত্যের মধ্যে অসত্যের অনুপ্রবেশের ষড়যন্ত্রকারী ও মিথ্যাবাদীদের ছোবল থেকে প্রিয় হাবিব (সা.)-এর রেখে যাওয়া এই আমানতকে। সেই সব সৌভাগ্যবান নূরানি কাফেলার অন্যতম এক সহযাত্রী ছিলেন যুগশ্রেষ্ঠ হাদিসশাস্ত্রবিদ ইমাম আবু দাউদ (রহ.)। হাদিসের কালজয়ী বিশুদ্ধ ছয়খানা কিতাবের অন্যতম কিতাব 'সুনানে আবি দাউদ'-এর গ্রন্থকার। বর্তমান আফগানিস্তানের দক্ষিণাঞ্চলের সিজিস্তান শহরে বিশ্ববরেণ্য এই মুহাদ্দিস ইমাম আবু দাউদ (রহ.) জন্মগ্রহণ করেন।\n\nতখন আব্বাসীয় খলিফা মামুন ছিলেন রাষ্ট্রক্ষমতায়। ২০২ হিজরি সাল, যাকে ইসলামী জ্ঞান-বিজ্ঞানের সোনালি যুগ বলা হয়।\nইমাম আবু দাউদের প্রকৃত নাম সোলাইমান। আবু দাউদ তাঁর উপনাম।\n\n\nপিতার নাম আশআস। বংশলতিকা হলো সুলাইমান ইবনে আশআস ইবনে ইসহাক ইবনে বুশাইর ইবনে সাদ্দাদ ইবনে আমর ইবনে ইমরান আল আযদি আস সিজিস্তানি। তাঁর ঊর্ধ্বতম পুরুষ ইমরান, যিনি হজরত আলী (রা.)-এর সঙ্গী হয়ে সিফফিনের যুদ্ধে শহীদ হয়েছিলেন।\nশিক্ষাজীবন : ইসলামী সংস্কৃতি ও জ্ঞানচর্চার সোনালি যুগে জন্ম হওয়ায় শৈশবেই তিনি তাঁর সিজিস্তান শহরের প্রখ্যাত আলেম ও মুহাদ্দিসদের পরশ পেয়েছিলেন। তাঁদের মাধ্যমেই অতিক্রম করেন তাঁর উচ্চশিখরে পৌঁছার প্রাথমিক ধাপগুলো।\n\n\nজ্ঞান অন্বেষণে বিদেশ গমন : হাদিসের জ্ঞান অর্জনের তীব্র পিপাসা নিয়ে ঘুরে ফিরেছেন দেশ-বিদেশ ও শহর-নগরে। মক্কা, বাগদাদ, বসরা, কুফা, মিসর, আলজেরিয়া, তারসুস, রায়, হেরাত, খুরাসানসহ অসংখ্য ইসলামী শহর-নগরের যুগশ্রেষ্ঠ মুহাদ্দিসদের হাদিসভাণ্ডার থেকে হাদিস আহরণ করেছেন ব্যাপক হারে।\n\nঅসাধারণ মেধা ও প্রখরতা : অসাধারণ স্মৃতিশক্তি ও মেধার তীক্ষ্নতার দরুন কৈশোর থেকেই সঙ্গীদের মধ্যে হাকিম (অর্থাৎ প্রজ্ঞাবান)-এর খেতাবে ভূষিত হয়েছেন। তিনি রাসুল (সা.) থেকে বর্ণিত সূত্রের দীর্ঘ ধারাবাহিকতাসহ পাঁচ লাখেরও বেশি হাদিসের হাফেজ ছিলেন। আর অজস্র অগণিত বর্ণনাকারীর নাম ও বংশপরম্পরাসহ তাঁর জীবনবৃত্তান্ত, প্রত্যেকের পার্থক্যসহ মুখস্থ করা ছিল তাঁর বিশাল ও অসাধারণ কৃতিত্বের একটি। এ ছাড়া তিনি কেবল হাদিস বিশারদই ছিলেন না, ফিকহসহ ইসলামী ইলম ও জ্ঞানের সব শাখায়ই ছিল তাঁর নেতৃত্বসুলভ অবস্থান।\n\nসম্মানিত শিক্ষকগণ : হাদিস অন্বেষণে ইমাম আবু দাউদ (রহ.) অসংখ্য মুহাদ্দিসের সান্নিধ্য লাভ করেছেন, যাঁদের মধ্যে ইমাম আহমদ ইবনে হাম্বল, আহমদ ইবনে সালেহ, ইসহাক ইবনে রাহওয়াই, ইয়াহয়া ইবনে মাঈন, আলী ইবনুল মাদীনী, কুতাইবা ইবনে সাঈদ, সুলাইমান ইবনে হরব, আবদুল্লাহ ইবনে মাসলামাহ, সাঈদ ইবনে মানুসুর, মুহাম্মদ ইবনে বাশ্শার, যুহাইর ইবনে হারব (রহ.) প্রমুখ উল্লেখযোগ্য।\n\nযাঁরা শিক্ষার্থী ছিলেন : বিশ্বের বিভিন্ন অঞ্চল থেকে হাদিসের পিপাসা নিবারণে ছুটে এসেছিলেন তাঁর কাছেও যুগশ্রেষ্ঠ ইলম অন্বষণকারী একঝাঁক অনন্য কাফেলা, যাঁদের মধ্যে ইমাম আবু ঈসা তিরমিজি, ইমাম আবু আবদুর রহমান নাসায়ি, ইমাম আবু আওয়ানা, আবু বকর আহমদ ইবনে মুহাম্মদ আল খল্লাল, মুহাম্মদ ইবনে নাছার আল মারওয়াযি, আবু বিশির আদ দুলাবি, যাকারিয়া সাজি ও আবু আলী মুহাম্মদ ইবনে আহমদ আল লু'লুয়ি (রহ.) প্রমুূখ মুহাদ্দিস ছিলেন।\n\nসমকালীন মুহাদ্দিসদের মন্তব্য : ইমাম মূসা ইবনে হারুন (রহ.) বলেন, ইমাম আবু দাউদ যেন ইহকালে হাদিসের জন্য এবং পরকালে জান্নাতের জন্যই সৃষ্টি হয়েছেন। তাঁর চেয়ে উৎকৃষ্ট লোক আমি কখনো দেখিনি। ইমাম ইব্রাহীম ইবনে ইসহাক (রহ.) বলেন, (আল্লাহর পক্ষ থেকে) আবু দাউদের জন্য হাদিসশাস্ত্র এমন কোমল ও শিথিল করে দেওয়া হয়েছে, যেমন হজরত দাউদ (আ.)-এর হাতে লোহাকে নরম ও কোমল করে দেওয়া হয়েছিল। ইমাম হাকেম (রহ.) বলেন, আবু দাউদ বিনা প্রতিদ্বন্দ্বিতায় তাঁর যুগে হাদিসশাস্ত্রের ইমাম ও সর্বাধিনায়ক ছিলেন। এ ছাড়া অনেক ইমাম তাঁর ব্যাপারে অনুরূপ মন্তব্য করেছেন।\n\nচারিত্রিক গুণাবলি : তিনি অত্যধিক খোদাভীরু ও দুনিয়াবিমুখতায় তাঁর যুগে প্রসিদ্ধ ছিলেন। কোমল ব্যবহার, সততা, দানশীলতা, বিশ্বস্ততা ও সরলতা সত্ত্বেও সত্য ও ন্যায়ের প্রকাশে ছিলেন বলিষ্ঠ কণ্ঠস্বর। এসব গুণ তাঁর জীবনের বিভিন্ন ঘটনা থেকে স্পষ্ট প্রতীয়মান হয়, তা থেকে একটি ঘটনা হলো, একদিন ইমাম আবু দাউদ (রহ.)-এর শহরের তৎকালীন শাসক আমির আবু আহমদ আল মুওয়াফফাক তাঁর কাছে আবেদন করেছিলেন, তিনি যেন খলিফার ছেলেদের সম্মানার্থে তাঁদের জন্য আলাদা একটি হাদিসের মজলিশ কায়েম করেন, যেখানে সর্বসাধারণের প্রবেশাধিকার থাকবে না। শুধু খলিফাপুত্রদেরই হাদিসের পাঠ দান করা হবে। ইমাম আবু দাউদ (রহ.) তা জোরালোভাবে প্রত্যাখ্যান করে বলেন, কখনো নয়! শিক্ষার্জনে সবারই সমান অধিকার রয়েছে, চাই সে রাজপুত্র হোক বা প্রজাপুত্র। এরপর আগের মতোই ধনী-গরিবের ভেদাভেদ ভুলে সবাই একই মজলিশে হাদিস শিক্ষা করতেন।\n\nমাজহাবের অনুসরণ : ইমাম আবু দাউদ (রহ.)-এর ন্যায় যুগশ্রেষ্ঠ হাদিস ও ফিকহশাস্ত্রের ইমাম চাইলে কোনো মাজহাব অনুসরণ না করে নিজেই সরাসরি হাদিস-কোরআনের ওপর আমল করতে পারতেন। তা সত্ত্বেও শরিয়ত পালনার্থে মাজহাব মানার সীমাহীন গুরুত্ব বিবেচনা করে তাঁর মতো একজন যুগশ্রেষ্ঠ ইমামও তাঁর শিক্ষক প্রখ্যাত মুহাদ্দিস ও ফকিহ ইমাম আহমদ ইবনে হাম্বল (রহ.)-এর মাজহাবের অনুসরণ করেছেন বলে তাঁর জীবনী রচয়িতা উল্লেখ করেছেন।\n\nরচনাবলি : ইমাম আবু দাউদ (রহ.) বিশের অধিক গ্রন্থ রচনা করেছেন, যার মধ্যে তাঁর সর্বশ্রেষ্ঠ কীর্তি হলো 'সুনানে আবি দাউদ'। তাঁর অনন্য গ্রন্থগুলোর মধ্যে আল মারাসীল, আন নাসিখি ওয়াল মানুসূখ, কিতাবুজ যুহুদ, কিতাবুল কদর, কিতাবুল বা'ছি ওয়ান নুশুর, দালায়েলুন নুবুওয়াহ, ফাজায়েলুল আনসার, আখবারুল খাওয়ারেজ ও ইবতেদাউল ওহী ইত্যাদি উল্লেখযোগ্য।\n\nশ্রেষ্ঠ রচনা 'সুনানে আবি দাউদ' : ইমাম আবু দাউদ (রহ.)-এর অমর কীর্তি হলো, তাঁর রচিত 'সুনানে আবি দাউদ', যা তিনি স্বহস্তে লেখা রাসুল (সা.)-এর পাঁচ লাখেরও বেশি হাদিসভাণ্ডার থেকে নির্বাচন করে সংকলন করেছিলেন। এতে তাঁর বর্ণনা মতে চার হাজার ৮০০টি হাদিস রয়েছে, যার সংখ্যা শায়েখ মুহাম্মদ ফুয়াদ আবদুল বাকীর গণনা মতে পাঁচ হাজার ২৭৪ পর্যন্ত পৌঁছে। এর মধ্যে বেশির ভাগ হাদিসই সহিহ। আর বাকিগুলো সহিহর মানোত্তীর্ণ না হলেও তার বেশির ভাগই গ্রহণযোগ্য হাদিস। ওই হাদিসগুলোকে তিনি ৩৬টি অধ্যায় ও এক হাজার ৮৮০টি পরিচ্ছেদে সাজিয়েছেন। তাঁর ভাষায় এই হাদিসসমগ্রটি পূর্ণাঙ্গ ইসলামী মৌলিক বিধিবিধানের জন্য যথেষ্ট। ইমাম আবু দাউদ (রহ.) গ্রন্থখানা সংকলনের পর প্রথমে তা নিজের শিক্ষক ইমাম আহমদ ইবনে হাম্বল (রহ.)-এর সামনে উপস্থাপন করেন। ইমাম আহমদ (রহ.) গ্রন্থখানা খুবই পছন্দ করেন এবং একখানা উত্তম হাদিস গ্রন্থ বলে এর ভূয়সী প্রশংসা করেন। এ ছাড়া সে যুগের শীর্ষ মুহাদ্দিসগণ তাঁর গ্রন্থটিকে কোরআনের মাসহাফের মতো সাদরে গ্রহণ করে নিয়েছিলেন। এর পরিপ্রেক্ষিতেই সে যুগের ইমাম ইবনুল আরাবি (রহ.) তাঁর এই গ্রন্থ সম্বন্ধে মন্তব্য করতে গিয়ে বলেন, যদি কোনো ব্যক্তির কাছে আল্লাহর কালাম কোরআনে কারিমের একটি মাসহাফ ও আবু দাউদের 'সুনান' গ্রন্থটি থাকে তার কাছে আর অন্য কোনো ইলম না থাকলেও এ দুটি কিতাবই তার ইলমের জন্য যথেষ্ট হবে। এ ছাড়া ইমাম খাত্তাবী, ইমাম গাজ্জালী ও হাফেজ ইবনুল কাইয়িম (রহ.) প্রমুখ ইমামও অনুরূপ মন্তব্য করেছেন।\n\nআখেরাতের সফরে ইমাম আবু দাউদ (রহ.) : ইলম ও ইমানের এই ক্ষণকালীন সফর শেষে বিশ্ববরেণ্য এই ক্ষণজন্মা ইমাম ৭৩ বছর বয়সে ১৫ শাওয়াল মতান্তরে ১৬ শাওয়াল ২৭৫ হিজরি সনে বসরা নগরীতে মৃত্যুবরণ করেন। সেখানেই তাঁকে ইমাম সুফিয়ান সাওরী (রহ.)-এর পাশে সমাহিত করা হয়। আল্লাহ তায়ালা তাঁর কবরকে স্বীয় রহমতের চাদরে আবৃত করুন।",
      "Almighty Allah has taken the responsibility of complete preservation of religion and Shariah. In the Qur'an, Surah al-Kareem, verse 9 of Hijr, says, 'Surely We have sent down this advice and I am its protector.' In this verse, Allah Ta'ala has not only promised to preserve the words of the Holy Qur'an, but also the words and ideals of His beloved Prophet (PBUH), which is the interpretation and actual picture of Allah, the Holy Qur'an, has also taken responsibility for the thorough preservation, which in the words of the Prophet (PBUH) ) known as Hadith and Sunnah. And as part of the implementation of that preservation, Allah Ta'ala has gathered such Noorani caravans in the world for ages, who preserved every letter and every moment of the ideals and sayings of the beloved Messenger through their own knowledge and sacrifice.\n\n\nAnd freed this deposit left by beloved Habib (pbuh) from the clutches of conspirators and liars to intrude falsehood into the truth. One of the companions of those fortunate Noorani caravans was Imam Abu Dawud (RA). Author of 'Sunan Abi Dawud', one of the classic six books of hadith. The world-renowned muhaddith Imam Abu Dawood (RA) was born in the city of Sijistan in the southern part of present-day Afghanistan.\n\nAt that time Abbasid Caliph Mamun was in power. 202 Hijri year, which is called the golden age of Islamic science.\nImam Abu Dawud's real name is Sulaiman. His nickname is Abu Dawood.\n\n\nFather's name is Ashas. The genealogy is Sulaiman ibn AshAs ibn Ishaq ibn Bushair ibn Saddad ibn Amr ibn Imran al-Ajd al-Sijistani. His eldest son was Imran, who was martyred in the battle of Siffin along with Hazrat Ali (RA).\nEducation: Being born in the golden age of Islamic culture and knowledge, he received the guidance of renowned scholars and muhaddiths of his city of Sijistan in his childhood. It was through them that he crossed the initial steps to reach the highest peak.\n\n\nTraveling abroad in search of knowledge: He has traveled to different countries and cities with a strong thirst to acquire the knowledge of hadith. Hadiths were extracted from the collections of the greatest Muhaddiths of many Islamic cities including Mecca, Baghdad, Basra, Kufa, Egypt, Algeria, Tarsus, Raya, Herat, Khurasan.\n\nExtraordinary Intelligence and Acuity: Due to his extraordinary memory and intellectual acuity, he was awarded the title of Hakeem (i.e. Wise) among his companions from his youth. He was the Hafez of more than five hundred thousand hadiths with long continuations of sources narrated from the Prophet (PBUH). And the memorization of his biographies, with the names and genealogies of countless narrators, each with distinction, was one of his great and extraordinary achievements. Apart from this, he was not only a hadith expert, but he had a leading position in all branches of Islamic science and knowledge, including fiqh.\n\nRespected Teachers: In pursuit of hadith, Imam Abu Dawud (RA) came into contact with numerous muhaddiths, including Imam Ahmad Ibn Hanbal, Ahmad Ibn Saleh, Ishaq Ibn Rahwai, Yahya Ibn Ma'in, Ali Ibn al-Madini, Qutaiba Ibn Sa'id, Sulaiman Ibn Harb, Abdullah Ibn Maslamah, Saeed Ibn Manusur, Muhammad Ibn Bashar, Zuhair Ibn Harb (RA) and others are notable.\n\nThose who were students: from different parts of the world rushed to quench their thirst for hadith, a unique caravan of seekers of the greatest knowledge of the age, including Imam Abu Isa Tirmidhi, Imam Abu Abdur Rahman Nasa'i, Imam Abu Awana, Abu Bakr Ahmad Ibn Muhammad Al Khallal, Muhammad Ibn Nasr Al Marwazi, Abu Bishir Ad Dulabi, Zakaria Saji and Abu Ali Muhammad Ibn Ahmad Al Lu'lu'i (R.A.) were Muhaddis.\n\nCommentary of contemporary muhaddis: Imam Musa Ibn Harun (RA) said, Imam Abu Dawud was created for Hadith in this life and for Paradise in the Hereafter. I have never seen a better man than him. Imam Ibrahim Ibn Ishaq (R.A.) said, (By Allah) Hadith was softened and softened for Abu Dawud, as iron was softened and softened in the hands of Hazrat Dawud (A.S.). Imam Hakem (R.A.) said, Abu Dawud was the uncontested Imam and leader of Hadith in his era. Besides, many Imams have made similar comments about him.\n\nCharacteristic Qualities: He was famous in his era for being extremely God-fearing and worldly. Gentleness of manners, honesty, benevolence, faithfulness and simplicity notwithstanding, was a strong voice in the expression of truth and justice. These qualities are evident from various events in his life, one of which is that one day, Amir Abu Ahmad Al Muwaffaq, the ruler of the city of Imam Abu Dawud (R.A.) requested him to recite a separate hadith for the sons of the Caliph in honor of them. The Majlish established, where there will be no public access. Only the sons of the Caliphs will be given the lessons of Hadith. Imam Abu Dawood (RA) rejected it strongly and said, \"Never!\" Everyone has an equal right to education, whether he is a prince or a commoner. After that, everyone used to learn hadith in the same majlis, forgetting the distinction between rich and poor.\n\nFollowing Madhhab: Imam Abu Dawud (R.H.) was the greatest Imam of Hadith and Fiqh Shastra who could have followed any Madhhab and directly acted upon the Hadith-Quran if he wanted. Nevertheless, considering the boundless importance of following the Madhhab for the observance of the Shari'ah, even a great Imam like him followed the Madhhab of his teacher, the eminent Muhaddith and Faqih Imam Ahmad Ibn Hanbal (R.A.), as noted by his biographer.\n\nWritten by: Imam Abu Dawood (RA) b",
      "وقد أخذ الله تعالى على عاتقه المحافظة الكاملة على الدين والشريعة. وفي القرآن الكريم تقول الآية 9 من سورة الكريم: \"إنا نزلنا هذا الذكر وأنا له حافظ\". في هذه الآية، لم يعد الله تعالى بالحفاظ على كلمات القرآن الكريم فحسب، بل وعد أيضًا بكلمات ومثل نبيه الحبيب (صلى الله عليه وسلم)، وهي التفسير والصورة الفعلية لله، القرآن الكريم. كما تولى مسؤولية الحفظ الشامل، وهو ما يعرف في كلام النبي (ص) بالحديث والسنة. وكجزء من تنفيذ هذا الحفظ، جمع الله تعالى مثل هذه القوافل النورانية في العالم على مر العصور، الذين حافظوا على كل حرف وكل لحظة من مُثُل الرسول الحبيب وأقواله من خلال علمهم وتضحياتهم.\n\n\nوحرر هذه الوديعة التي تركها الحبيب الحبيب (ع) من براثن المتآمرين والكاذبين لإدخال الباطل على الحق. وكان من أصحاب تلك القوافل النورانية المحظوظة الإمام أبو داود (ره)، أعظم علماء الحديث. مؤلف \"سنن أبي داود\"، أحد كتب الحديث الستة الكلاسيكية. ولد المحدث المشهور عالمياً الإمام أبو داود (رضي الله عنه) في مدينة سجستان في الجزء الجنوبي من أفغانستان الحالية.\n\nفي ذلك الوقت كان الخليفة العباسي المأمون في السلطة. 202 سنة هجرية، وهي تسمى بالعصر الذهبي للعلوم الإسلامية.\nاسم الإمام أبو داود الحقيقي هو سليمان. كنيته أبو داود.\n\n\nاسم الأب أشاس. نسبه: سليمان بن العاص بن إسحاق بن بشير بن سداد بن عمرو بن عمران الأجدي السجستاني. ابنه الأكبر عمران الذي استشهد في معركة صفين مع حضرة علي (رضي الله عنه).\nالتعليم: ولد في العصر الذهبي للثقافة والمعرفة الإسلامية، وقد تلقى الإرشاد من مشاهير علماء ومحدثي مدينته سيزستان في طفولته. ومن خلالهم عبر الخطوات الأولية ليصل إلى أعلى قمة.\n\n\nالسفر إلى الخارج طلباً للعلم: فقد سافر إلى البلدان والمدن والمدن متعطشاً بشدة لتحصيل علم الحديث. تم استخراج الأحاديث من مجموعات أعظم المحدثين في العديد من المدن الإسلامية بما في ذلك مكة وبغداد والبصرة والكوفة ومصر والجزائر وطرسوس وراية وهرات وخراسان.\n\nالذكاء والحدة الفائقان: لعظمة ذاكرته وحدة الفكر، حصل على لقب الحكيم بين أصحابه منذ شبابه. وكان حافظاً لما يروى عن النبي صلى الله عليه وسلم أكثر من خمسمائة ألف حديث بتتابعات طويلة. وكان حفظ سيرته بأسماء وأنساب عدد لا يحصى من الرواة، كل منهم بامتياز، من إنجازاته العظيمة وغير العادية. عدا عن ذلك، فهو لم يكن عالمًا بالحديث فحسب، بل كان له مكانة رائدة في جميع فروع العلوم والمعارف الإسلامية، بما في ذلك الفقه.\n\nالأساتذة المحترمون: في البحث عن الحديث، اقترب الإمام أبو داود (رضي الله عنه) من العديد من المحدثين، بما في ذلك الإمام أحمد بن حنبل، وأحمد بن صالح، وإسحاق بن راهويه، ويحيى بن معين، وعلي بن المديني، وقتيبة بن صاعد. ومنهم: سليمان بن حرب، وعبد الله بن مسلمة، وسعيد بن منصور، ومحمد بن بشار، وزهير بن حرب (رضي الله عنه) وغيرهم.\n\nأولئك الذين كانوا طلابًا: من مختلف أنحاء العالم سارعوا لإرواء عطشهم للحديث، قافلة فريدة من طلاب العلم الأعظم في العصر، ومن بينهم الإمام أبو عيسى الترمذي، والإمام أبو عبد الرحمن النسائي، والإمام أبو عوانة، أبو بكر أحمد بن محمد الخلال، محمد بن نصر المروزي، أبو بشير الدولابي، زكريا ساجي، وأبو علي محمد بن أحمد اللؤلؤي (رضي الله عنه) كانوا محدثين.\n\nتعليق المحدثين المعاصرين: قال الإمام موسى بن هارون (رضي الله عنه): خلق الإمام أبو داود للحديث في الدنيا وللجنة في الآخرة. ولم أرى رجلاً أفضل منه قط. وقال الإمام إبراهيم بن إسحاق (رضي الله عنه) : (والله لقد خفف الحديث لأبي داود كما خفف الحديد على يد داود (ع)). قال الإمام الحاكم (رضي الله عنه): كان أبو داود الإمام بلا منازع ومحدث الحديث في عصره. علاوة على ذلك، فقد أدلى العديد من الأئمة بتعليقات مماثلة عنه.\n\nالصفات المميزة: اشتهر في عصره بكثرة تقوى الله ودنياه. وكان لطف الخلق والصدق والإحسان والإخلاص والبساطة، رغم ذلك، صوتاً قوياً في التعبير عن الحق والعدل. وتتجلى هذه الصفات في أحداث مختلفة في حياته، منها أنه في أحد الأيام طلب منه الأمير أبو أحمد الموفق والي مدينة الإمام أبي داود (رضي الله عنه) أن يقرأ حديثاً منفصلاً لأبناء الخليفة. تكريما لهم، تم إنشاء المجلس، حيث لن يكون هناك وصول عام. ولن يتلقى دروس الحديث إلا أبناء الخلفاء. فرفضه الإمام أبو داود (رضي الله عنه) بشدة وقال: \"أبدا!\" لكل فرد حق متساو في التعليم، سواء كان أميرًا أو من عامة الناس. وبعد ذلك، أصبح الجميع يتعلمون الحديث في نفس المجلس، وينسون التمييز بين الغني والفقير.\n\nاتبع المذهب: كان الإمام أبو داود (رضي الله عنه) هو الإمام الأعظم في الحديث والفقه شاسترا الذي كان من الممكن أن يتبع أي مذهب ويعمل مباشرة على الحديث القرآني بنفسه. ومع ذلك، ونظراً للأهمية اللامحدودة لاتباع المذهب في مراعاة الشريعة، فإن إماماً عظيماً مثله كان يتبع مذهب أستاذه المحدث والفقيه الجليل الإمام أحمد بن حنبل (رضي الله عنه)، كما أشار كاتب سيرته. .\n\nتأليف: الإمام أبو داود (رض) ب"
    ],
    "image": "https://i.ibb.co/zNHMzF9/islamic-man.jpg"
  },
  {
    "_id": "667dc1148f6f312a681e9caf",
    "name": [
      "ইমাম মুসলিম (রহ.)",
      "Imam Muslim (RA)",
      "الإمام مسلم رحمة الله عليه"
    ],
    "desc": [
      "হাদিসের বিশুদ্ধতা নিরূপণে ইতিহাসে যেসব মহামানব চিরস্মরণীয় হয়ে আছেন, তাদের অন্যতম হলেন ইমাম মুসলিম (রহ.)। খোরাসানের নিশাপুরে ২০৪ হিজরি মোতাবেক ৮২০ খ্রিস্টাব্দে জন্মগ্রহণ করেন তিনি।\n\nনিশাপুর বর্তমানে ইরানের অন্তর্ভুক্ত।\n\nইমাম মুসলিম (রহ.) ২১৮ হিজরিতে মাত্র ১৪ বছর বয়সে ইলমে হাদিস শিক্ষায় মনোযোগ দেন। তিনি জন্মস্থান নিশাপুরের বিখ্যাত মুহাদ্দিসদের কাছ থেকে হাদিস সংগ্রহ করেই ক্ষান্ত হননি, তৎকালীন ইলমে হাদিসের সব কেন্দ্রেই ছুটে গেছেন, হাদিসের এক বিশাল ভাণ্ডার আত্মস্থ করেছেন। তিনি একাধিকবার বাগদাদ সফর করেছেন। তার সর্বশেষ বাগদাদ সফর হয়েছিল ২৫৯ হিজরিতে।\n\n২১১ জন বিশিষ্ট মুহাদ্দিসের কাছ থেকে ইলমে হাদিসের শিক্ষা গ্রহণ করেন এবং হাদিস সংগ্রহ করেন। ইমাম বোখারি (রহ.) ছিলেন ইমাম মুসলিম (রহ.)-এর উস্তাদ।\n\nইমাম মুসলিম (রহ.) ইলমে হাদিসের যে বিশাল জ্ঞানভাণ্ডার সংগ্রহ করেছিলেন, তা শিক্ষা দিয়ে যেমন অসংখ্য মুহাদ্দিস তৈরি করে গেছেন, সেই সঙ্গে অসংখ্য গ্রন্থ রচনা করে জগৎবাসীর জন্য মহামূল্যবান উপহার হিসেবে রেখে গেছেন। সহিহ মুসলিম ছাড়াও ইমাম মুসলিম (রহ.) যেসব গ্রন্থ রচনা করে গেছেন, তার\nমধ্যে কয়েকটি প্রসিদ্ধ গ্রন্থ হলো—\n\nমুসনাদে কবির, কিতাবুল জামে, কিতাবুল আসমা ওয়াল কুনা, কিতাবুত্ তাময়িয, কিতাবুল ইলাল ওয়া কিতাবুল ওয়াহদান, কিতাবুল ইফরাদ, কিতাবুল আরকান, কিতাবু হাদিসি আমর ইবনে শুয়াইব, কিতাবু মাশায়েখে মালেক, কিতাবু মাশায়েখে শোবা, কিতাবু আওলাদিস সাহাবা, কিতাবু আওহামিল মুহাদ্দিসিন, কিতাবুত তাবাকাত, কিতাবু সুয়ালাতি আহমাদ বিন হাম্বল, কিতাবু মান লাইসা লাহু রাব্বুন ইল্লা ওয়াহিদ ইত্যাদি।\n\nতবে ইমাম মুসলিম (রহ.)-এর রচনাবলির মধ্যে একমাত্র ‘আস্ সহিহুল মুসলিম’ ছাড়া আর কোনোটাই বর্তমানে খুঁজে পাওয়া যায় না।\n\nমুসলিম শরিফ সংকলন\nইমাম মুসলিম (রহ.) দীর্ঘ পনের বছরের সাধনায় তিন লাখ হাদিস থেকে যাচাই-বাছাই করে ‘সহিহ্ মুসলিম’ শরিফ সংকলন করেছেন। ইমাম মুসলিম (রহ.)-এর বিশিষ্ট সাগরেদ আহমাদ ইবনে সালামা বলেন, ‘আমি মুসলিমের সঙ্গে তার আসসহিহ প্রণয়নকালে পনের বছর লেখালেখির কাজ করেছি (তাজকিরাতুল হুফ্ফাজ)। ইমাম মুসলিম (রহ.) শুধু সহিহ হাদিসের সমন্বয়ে এ মহান গ্রন্থখানা রচনা করেছেন। তাই এর নামকরণ করেছেন ‘আস্ সহিহ। ’\n\nমুসলিম শরিফে পুনরুল্লেখ ছাড়া হাদিসের মোট সংখ্যা চার হাজার, আর পুনরুল্লেখসহ মোট হাদিসের সংখ্যা সাত হাজার ২৭৫টি।\n\nইমাম মুসলিম (রহ.) তার ‘সহিহ’ রচনার পর বলেছিলেন, ‘মুহাদ্দিসরা ১০ বছর পর্যন্তও যদি হাদিস লিখতে থাকেন, তবুও তাদের অবশ্যই এ বিশুদ্ধ মুসনাদ গ্রন্থের ওপর নির্ভর করতে হবে। ’\n\nবস্তুত ইমাম মুসলিম (রহ.) অত্যন্ত সত্য কথাই বলেছেন। তার মৃত্যুর পর সুদীর্ঘ ১২০০ বছরের বেশি সময় পেরিয়ে গেলেও আজ অবধি মুসলিম শরিফের মানের দ্বিতীয় কোনো গ্রন্থ রচনা করা সম্ভব হয়নি কারও পক্ষে। ইমাম মুসলিম (রহ.) মুসলিম শরিফ রচনায় শুধু নিজের স্মৃতিশক্তির ওপরই নির্ভর করেননি। তিনি এটি রচনার পর তৎকালীন শ্রেষ্ঠ মুহাদ্দিসগণের সামনে পেশ করেছেন। তাদের পরামর্শ গ্রহণ করেছেন, তাদের স্বীকৃতি নিয়ে চূড়ান্ত রচনার কাজটি সমাধা করেছেন। এ প্রসঙ্গে তিনি বলেছেন, ‘আমি এ গ্রন্থখানা আবু জুরআ আর-রাজির কাছে পেশ করেছি। তিনি যে যে হাদিসের সনদে দোষ আছে বলে ইঙ্গিত করেছেন, আমি তা পরিত্যাগ করেছি, আর যে যে হাদিস সম্পর্কে মত দিয়েছেন যে এগুলো সহিহ, আমি সেগুলো গ্রন্থে সন্নিবেশিত করেছি। ’\n\nবস্তুত বুখারি শরিফ ও মুসলিম শরিফের হাদিস বিশুদ্ধতার মানদণ্ডে সমপর্যায়ের হওয়ার কারণেই দু’টিকে একত্রে ‘সহিহাইন’ বলা হয়।\n\nইমাম মুসলিম (রহ.) তার আসসহিহর ভূমিকায় ‘সহিহ’ রচনার কারণ সম্পর্কে দু’টি বিষয় উল্লেখ করেছেন-\n\nক. ইমাম মুসলিম (রহ.)-এর বিখ্যাত সাগরেদ আবু ইসহাক ইবরাহিম তার কাছে একটি উন্নতমানের সহিহ হাদিসগ্রন্থ সংকলন করার জন্য অনুরোধ জানান। কিতাবের ভূমিকায় তিনি তার ছাত্রের জন্য দোয়া করেছেন,\n\nখ. ইমাম মুসলিম (রহ.) দ্বিতীয় কারণটি এভাবে উল্লেখ করেছেন- কেবল তোমার ইচ্ছা পূরণ করতে গিয়ে সহিহ হাদিসগুলো বাছাই করার কষ্ট স্বীকার করা আমার পক্ষে সম্ভব হতো না। কিন্তু আমি যখন জানতে পারলাম যে, তথাকথিত মুহাদ্দিসরা সাধারণ মানুষের মধ্যে মিথ্যা ও মুনকার হাদিসগুলো ছড়িয়ে দিয়ে বিভ্রান্তি সৃষ্টি করছে, তখন তোমার অনুরোধে সাড়া দেওয়া আমার জন্য আরো সহজ হয়ে গেল।\n\nইলমে হাদিসের এ মহান সাধক ২৬১ হিজরির ২৫ রজব রবিবার মোতাবেক ২৮০ খ্রিস্টাব্দে মাত্র ৫৭ বছর বয়সে ইন্তেকাল করেন। বর্তমানে ইরানের খোরাসান প্রদেশের অন্তর্গত নিশাপুরে তার দাফন সম্পন্ন হয়।",
      "Imam Muslim (R.A.) is one of the great people who have been remembered in history for determining the purity of Hadith. He was born in 820 AD according to 204 Hijri in Nishapur of Khorasan.\n\nNishapur is currently part of Iran.\n\nImam Muslim (R.A.) turned his attention to the study of Ilm Hadith at the age of 14 in 218 AH. He did not stop at collecting hadiths from the famous Muhaddish of his birthplace Nishapur, he ran to all the centers of hadith knowledge of the time, imbibing a huge collection of hadiths. He visited Baghdad several times. His last visit to Baghdad was in 259 AH.\n\n211 Learned hadith from eminent muhaddis and collected hadith. Imam Bokhari (RA) was the teacher of Imam Muslim (RA).\n\nImam Muslim (R.A.) has created numerous Muhaddiths by teaching the vast knowledge of Hadith which he collected in the knowledge, as well as by writing numerous books, he has left it as a valuable gift for the people of the world. Apart from Sahih Muslim, the books authored by Imam Muslim (RA).\nSome of the famous books are-\n\nMusnad Kabir, Kitabul Jame, Kitabul Asma wal Kuna, Kitabul Ilal wa Kitabul Wahdan, Kitabul Arkan, Kitabu Hadisi Amr Ibn Shuaib, Kitabu Mashaikhe Malek, Kitabu Mashaikhe Shoba, Kitabu Awladis Sahaba, Kitabu Awhamil Muhaddisin, Kitabu tabakat , Kitabu Sualati Ahmad Bin Hambal, Kitabu Man Laisa Lahu Rabbun Illa Wahid etc.\n\nHowever, none of the works of Imam Muslim (RA) except 'As Sahihul Muslim' can be found today.\n\nMuslim Sharif Compilation\nImam Muslim (R.A.) compiled 'Sahih Muslim' Sharif after scrutinizing 300,000 hadiths in fifteen years of hard work. Ahmad Ibn Salama, a distinguished scholar of Imam Muslim (R.A.), said, \"I worked with Muslim for fifteen years in the preparation of his Assahih (Tazkiratul Huffaz). Imam Muslim (RA) composed this great book consisting of Sahih Hadith only. So he named it 'As Sahih'. '\n\nIn Muslim Sharif, the total number of hadiths without repetition is four thousand, and the total number of hadiths with repetition is seven thousand 275.\n\nImam Muslim (RA) said after writing his 'Sahih', 'Even if the Muhaddis continue to write Hadith for 10 years, they must still rely on this pure Musnad book. '\n\nIn fact, Imam Muslim (RA) has said very true things. More than 1200 years have passed since his death, but till date no one has been able to write a book equal to the quality of Muslim Sharif. Imam Muslim (RA) did not rely only on his memory in composing Muslim Sharif. After composing it, he presented it before the best Muhaddiths of the time. Accepted their suggestions, completed the final draft with their approval. In this context, he said, 'I presented this library to Abu Zura ar-Razi. The hadiths he pointed out as having faults in their authenticity, I omitted them, and the hadiths he opined that they are authentic, I included them in the book. '\n\nIn fact, Bukhari Sharif and Muslim Sharif's Hadith are of equal quality, so they are called 'Sahihain' together.\n\nImam Muslim (RA) in his preface to As-Saheeh mentions two things about the reasons for composing the Sahih-\n\nA. Abu Ishaq Ibrahim, the famous friend of Imam Muslim (RA), requested him to compile a high quality Sahih Hadith book. In the introduction to the book he prayed for his student,\n\nb. Imam Muslim (RA) mentions the second reason as follows – It would not have been possible for me to accept the trouble of selecting Sahih Ahadith just to fulfill your wishes. But when I came to know that the so-called muhaddis are spreading false and untrue hadiths and creating confusion among the common people, it became easier for me to respond to your request.\n\nThis great saint of Ilme Hadith passed away on Sunday 25th Rajab of 261 Hijri in 280 AD at the age of only 57 years. He was buried in Nishapur, now in Khorasan province of Iran.",
      "الإمام مسلم (رضي الله عنه) هو أحد العظماء الذين يذكرهم التاريخ في تحديد نقاء الحديث. ولد سنة 820م الموافق 204 هجرية في نيسابور بخراسان.\n\nنيسابور حاليا جزء من إيران.\n\nتحول الإمام مسلم (رضي الله عنه) إلى دراسة علم الحديث في سن الرابعة عشرة سنة 218 هجرية. ولم يتوقف عند جمع الأحاديث من محدثي مسقط رأسه الشهير في نيسابور، بل ركض إلى جميع مراكز علم الحديث في ذلك الوقت، مشربًا مجموعة ضخمة من الأحاديث. زار بغداد عدة مرات. وآخر زيارته لبغداد كانت سنة 259 هـ.\n\n211 الحديث المستفادة من المحدثين البارزين والحديث المجمع. كان الإمام البخاري (رضي الله عنه) معلم الإمام مسلم (رضي الله عنه).\n\nلقد ألف الإمام مسلم (ع) العديد من المحدثات بتعليمه علوم الحديث الواسعة التي جمعها في العلم، وكذلك بتأليف العديد من الكتب، وتركها هدية ثمينة لأهل العالم. عدا صحيح مسلم، والكتب التي ألفها الإمام مسلم (رضي الله عنه).\nومن الكتب المشهورة-\n\nمسند كبير، كتاب الجامع، كتاب الأسماء والكنا، كتاب العلال وكتاب الوهدان، كتاب الأركان، كتاب الحديث عمرو بن شعيب، كتاب مشايخ مالك، كتاب مشايخ شوبا، كتاب عواديس الصحابة، كتاب أوهامل مهندسين طبقات، كتاب سلاتي أحمد بن حنبل، كتابو مان ليسا لاهو ربون إلا وحيد إلخ.\n\nومع ذلك، لا يمكن العثور اليوم على أي من مؤلفات الإمام مسلم (رضي الله عنه) باستثناء \"صحيح مسلم\".\n\nتجميع مسلم شريف\nقام الإمام مسلم (رضي الله عنه) بجمع \"صحيح مسلم\" الشريف بعد التدقيق في 300000 حديث لمدة خمسة عشر عامًا. قال أحمد بن سلمة، أحد علماء الإمام مسلم (رضي الله عنه): اشتغلت مع مسلم خمس عشرة سنة في إعداد صحيحه. قام الإمام مسلم (رضي الله عنه) بتأليف هذا الكتاب العظيم الذي يتكون من الحديث الصحيح فقط. فسماه \"الصحيح\". '\n\nوفي مسلم الشريف مجموع الأحاديث بدون مكرر أربعة آلاف، ومجموع الأحاديث مع المكرر سبعة آلاف و275.\n\nقال الإمام مسلم (رضي الله عنه) بعد كتابه صحيحه: «وإن استمر المحدثون في كتابة الحديث عشر سنوات، فيجب عليهم الاعتماد على هذا المسند الخالص». '\n\nوالحقيقة أن الإمام مسلم (رضي الله عنه) قد قال كلاماً صحيحاً جداً. وبعد وفاته مر أكثر من 1200 عام، ولكن حتى الآن لم يتمكن أحد من تأليف كتاب يعادل جودة مسلم شريف. ولم يعتمد الإمام مسلم (رضي الله عنه) في تأليف مسلم الشريف فقط على ذاكرته. وبعد أن نظمه عرضه على خيرة المحدثين في عصره. قبلت اقتراحاتهم، وأكملت المسودة النهائية بموافقتهم. وقال في هذا السياق: عرضت هذه المكتبة على أبي زرعة الرازي. والأحاديث التي أشار إلى أنها في صحتها تركتها، والأحاديث التي رأى أنها صحيحة أدخلتها في الكتاب. '\n\nوفي الحقيقة أن حديث البخاري الشريف ومسلم الشريف متساويان في الطهارة، ولذلك يطلق عليهما \"الصحيحين\" معًا.\n\nوقد ذكر الإمام مسلم (رضي الله عنه) في مقدمته للصحيح أمرين في أسباب تأليف الصحيح:\n\nأ. طلب منه أبو إسحاق إبراهيم، الصديق المشهور للإمام مسلم (رضي الله عنه)، أن يجمع كتاب حديث صحيح عالي الجودة. وفي مقدمة الكتاب دعا لتلميذه،\n\nب. ويذكر الإمام مسلم (رضي الله عنه) السبب الثاني على النحو التالي – لم يكن من الممكن بالنسبة لي أن أتحمل عناء اختيار الأحاديث الصحيحة فقط لتحقيق رغباتك. ولكن عندما علمت أن المحدثين المزعومين ينشرون أحاديث كاذبة وغير صحيحة ويثيرون البلبلة بين عامة الناس، أصبح من الأسهل بالنسبة لي الاستجابة لطلبك.\n\nتوفي هذا الولي المحدث العظيم يوم الأحد 25 رجب سنة 261 هجرية سنة 280 م عن عمر يناهز 57 سنة فقط. ودفن في نيسابور، وهي الآن في محافظة خراسان في إيران."
    ],
    "image": "https://i.ibb.co/zNHMzF9/islamic-man.jpg"
  },
  {
    "_id": "667dc11d8f6f312a681e9cb0",
    "name": [
      "ইমাম আল কুরতুবি (রহ)",
      "Imam Al Qurtubi (RA)",
      "الإمام القرطبي رحمه الله"
    ],
    "desc": [
      "ইমাম আবু আবদুল্লাহ কুরতুবীর পুরো নাম আবু আবদুল্লাহ মুহাম্মদ বিন আহমাদ বিন আবু বকর বিন ফারহ আল আনসারি আল আন্দালুসি আল কুরতুবী। (১) তবে তিনি ইমাম কুরতুবি নামেই পেয়েছেন অধিক প্রসিদ্ধি।\n\nজন্ম\n\nইমাম কুরতুবির জন্মসাল সম্পর্কে ইতিহাসগ্রন্থগুলোতে সুনির্দিষ্ট কোনো তথ্য নেই। বিভিন্ন সুত্র থেকে অনুমান করা যায় হিজরী ষষ্ঠ শতাব্দীর শেষদিকে তিনি কর্ডোভা শহরে জন্মগ্রহন করেন। তার বাল্যকাল কাটে এই শহরে। সে সসময় আন্দালুসে চলছিল মুওয়াহিদিনদের শাসন। ৬৩৩ হিজরীতে খ্রিস্টানদের হাতে পতনের (২) আগ পর্যন্ত ইমাম কুরতুবি এই শহরেই অবস্থান করেন, পরে তিনি মিসরে চলে যান। মৃত্যু পর্যন্ত সেখানেই অবস্থান করেন।\n\nশিক্ষা\n\nইমাম কুরতুবী যখন জন্মগ্রহন করেন তখন আন্দালুসের ঘরে ঘরে জ্ঞানচর্চা চলছিল। শহরগুলোতে ছিল সমৃদ্ধ সব পাঠাগার। এমনকি আলেমদের ব্যক্তিগত পাঠাগারেও ছিল হাজার হাজার বই। মসজিদের উন্মুক্ত চত্বরে দরস দিতেন তইলাসান পরিহিত আলেমরা। ফলে এমন একটি পরিবেশে অবস্থান করে ইমাম কুরতুবিও উপকৃত হন। আলেমদের দরসে বসে তিনি শেখেন হাদিস, ফিকহ, তাফসির, বালাগাত, মানতেক ও ফালসাফার গভীর জ্ঞান। অল্পদিনেই তিনি পরিণত হন আন্দালুসের শীর্ষ আলেমে।\n\nইলমুল আরুয বা কাব্যশাস্ত্রে তার দক্ষতা ছিল। তাফসির শাস্ত্রে তার দক্ষতা প্রকাশিত হয়েছে তাফসিরে কুরতুবি লেখার মাধ্যমে। ইমাম কুরতুবি আন্দালুসে যাদের কাছে পড়েছেন তাদের মধ্যে কাজি আবুল হাসান আলি, ইবনু আবু হুজ্জাহ, ইবনু উবাই প্রমুখ উল্লেখযোগ্য। মিসরে তিনি যাদের দরসে বসেছেন তাদের মধ্যে আবুল আব্বাস কুরতুবি, আবু মুহাম্মদ আবদুল ওয়াহাব বিন রওয়াজ প্রমুখ উল্লেখযোগ্য।\n\nতার সম্পর্কে আলেমদের প্রশংসা\n\nতার সম্পর্কে ইমাম যাহাবী বলেন, তার ছিল ইলমের গভীরতা। তার লিখিত বইপত্রগুলোও উপকারী, যা তার মর্যাদার সাক্ষ্য দেয়। (৩)\n\nইবনে ফারহুন বলেন, তিনি ছিলেন আল্লাহর নেককার বান্দাদের অন্তর্ভুক্ত। তার সময় ব্যয় হতো ইবাদত ও লেখালেখিতে।(৪)\n\nতার লিখিত বইপত্র\n\n১। আল জামে লি আহকামিল কুরআন – এটি একটি পুর্নাংগ তাফসিরগ্রন্থ।\n\n২। আত তাজকিরাহ বি আহওয়ালিল মুতা ওয়া উমুরিল আখিরাহ – মৃত্যু ও পরবর্তী জীবন সম্পর্কে বইটি রচিত।\n\n৩। আল কিতাবুল আসনা ফি আসমাইল্লাহিল হুসনা – এই কিতাবে তিনি আল্লাহর গুনবাচক নামের ব্যাখ্যা করেছেন।\n\nএছাড়াও তার আরো অনেক গ্রন্থ রয়েছে।\n\nমৃত্যু\n\n৬৭১ হিজরীতে মিসরে তিনি ইন্তেকাল করেন। (৫)\n\nসুত্র\n\n১। শাজারাতুয যাহাব, ৫/৩৩৫। তবাকাতুল মুফাসসিরিন, ৭৯। আল আলাম, ৬/২১৭।\n\n২। তারিখুল আন্দালুস ফি আহদিল মুরাবিতিন ওয়াল মুয়াহহিদিন, ৪০৩।\n\n৩। আল ওয়াফি বিল ওফায়াত, ২/৮৭।\n\n৪। নাফহুত তিব, ২/২১০।\n\n৫। আল ওয়াফি বিল ওফায়াত, ২/৮৭।",
      "The full name of Imam Abu Abdullah Qurtubi is Abu Abdullah Muhammad Bin Ahmad Bin Abu Bakr Bin Farh Al Ansari Al Andalusi Al Qurtubi. (1) However, he got more fame under the name of Imam Qurtubi.\n\nthe birth\n\nThere is no specific information in the history books about the birth year of Imam Qurtubi. According to various sources, he was born in the city of Cordova at the end of the sixth century of Hijri. He spent his childhood in this city. At that time, the rule of the Muwahideen was going on in Andalus. Imam Qurtubi stayed in this city until it fell to the Christians in 633 AH (2), after which he moved to Egypt. He stayed there until his death.\n\neducation\n\nWhen Imam Qurtubi was born, knowledge was going on from house to house in Andalus. The cities had rich libraries. Even the private libraries of scholars had thousands of books. Scholars dressed in taillasan used to give lectures in the open square of the mosque. As a result, Imam Qurtubi also benefited from staying in such an environment. He learned deep knowledge of Hadith, Fiqh, Tafsir, Balaghat, Mantek and philosophy by sitting in the presence of scholars. In a short time he became the top scholar of Andalus.\n\nHe was skilled in Ilmul Aruz or poetry. His expertise in the literature of tafsir is revealed through the writing of Qurtubi in Tafsir. Qazi Abul Hasan Ali, Ibnu Abu Hujjah, Ibnu Ubayy and others are notable among those whom Imam Qurtubi studied in Andalus. Abul Abbas Qurtubi, Abu Muhammad Abdul Wahab bin Rawaz and others are notable among the people whom he taught in Egypt.\n\nScholars praise him\n\nImam Zahabi said about him, he had the depth of knowledge. His writings are also useful, which testify to his status. (3)\n\nIbn Farhun said, he was among the righteous servants of Allah. His time was spent in worship and writing. (4)\n\nHis written books\n\n1. Al Jame Li Ahkamil Qur'an – It is a revised Tafsir book.\n\n2. At Tazkirah bi Ahwalil Muta wa Umuril Akhirah – The book on death and afterlife is written.\n\n3. Al Kitabul Asna fi Asmaillahil Husna – In this book he explains the glorifying names of Allah.\n\nHe also has many other books.\n\ndeath\n\nHe died in Egypt in 671 Hijri. (5)\n\nsource\n\n1. Shahratuz Zahab, 5/335. Tabaqatul Mufassirin, 79. Al Alam, 6/217.\n\n2. Tarikhul Andalus fi Ahdil Murabitin wal Muahhidin, 403.\n\n3. Al Wafi Bill Ofayat, 2/87.\n\n4. Nafhut Tib, 2/210.\n\n5. Al Wafi Bill Ofayat, 2/87.",
      "الاسم الكامل للإمام أبو عبد الله القرطبي هو أبو عبد الله محمد بن أحمد بن أبو بكر بن فرح الأنصاري الأندلسي القرطبي. (1) إلا أنه ازداد شهرة باسم الإمام القرطبي.\n\nالميلاد\n\nلا توجد معلومات محددة في كتب التاريخ عن سنة ميلاد الإمام القرطبي. وتشير المصادر المختلفة إلى أنه ولد بمدينة قرطبة في نهاية القرن السادس الهجري. قضى طفولته في هذه المدينة. وفي ذلك الوقت كان حكم الموحدين مستمراً في الأندلس. وبقي الإمام القرطبي بهذه المدينة حتى سقطت في أيدي النصارى سنة 633هـ(2)، ثم انتقل بعد ذلك إلى مصر. وبقي هناك حتى وفاته.\n\nتعليم\n\nوعندما ولد الإمام القرطبي، كان العلم ينتقل من بيت إلى بيت في الأندلس. كان لدى المدن مكتبات غنية. وحتى المكتبات الخاصة للعلماء كانت تضم آلاف الكتب. وكان العلماء يرتدون التيلاسان يلقون المحاضرات في الساحة المفتوحة للمسجد. ونتيجة لذلك، استفاد الإمام القرطبي أيضًا من البقاء في مثل هذه البيئة. وتعلم معرفة عميقة بالحديث والفقه والتفسير والبلاغات والمنطق والفلسفة من خلال الجلوس في حضرة العلماء. وفي وقت قصير أصبح من كبار علماء الأندلس.\n\nكان ماهرًا في إيلمول أروز أو الشعر. وتتجلى خبرته في أدب التفسير من خلال كتابة القرطبي في التفسير. والقاضي أبو الحسن علي، وابن أبي الحجة، وابن أبي وغيرهم، من المشاهير الذين درسهم الإمام القرطبي بالأندلس. وأبو العباس القرطبي، وأبو محمد عبد الوهاب بن رواز، وغيرهم من المشهورين ممن علمهم بمصر.\n\nيمدحه العلماء\n\nوقال عنه الإمام الذهبي كان صاحب عمق العلم. وكتاباته مفيدة أيضًا، والتي تشهد على مكانته. (3)\n\nوقال ابن فرحون: كان من عباد الله الصالحين. وكان يقضي وقته في العبادة والكتابة. (4)\n\nكتبه المكتوبة\n\n1. الجامع لأحكام القرآن – وهو كتاب تفسير منقح.\n\n2. تذكرة بأحوال منتهى وأمر الآخرة – كتاب الموت والحياة الآخرة مكتوب.\n\n3. الكتاب الأسنى في إسم الله الحسنى – في هذا الكتاب يشرح أسماء الله الحسنى.\n\nوله أيضاً كتب أخرى كثيرة.\n\nموت\n\nتوفي بمصر سنة 671 هجرية. (5)\n\nمصدر\n\n1. شهرتوز ذهب (5/335). طبقات المفسرين (79). العالم (6/217).\n\n2. تاريخ الأندلس في أهليل المرابطين والموحدين 403.\n\n3. الوافي بالعفيات (2/87).\n\n4. نفحت طيب 2/210.\n\n5. الوافي في العفيات (2/87)."
    ],
    "image": "https://i.ibb.co/b5jSH5c/image.jpg"
  },
  {
    "_id": "667dc1277d866f035c07d613",
    "name": [
      "আল্লামা শিহাবুদ্দীন মাহমূদ ইবনে আবদুল্লাহ আল-আলুসী রাহ.",
      "Allama Shihabuddin Mahmud Ibn Abdullah Al-Alusi.",
      "العلامة شهاب الدين محمود بن عبد الله الآلوسي."
    ],
    "desc": [
      "তিনি বাগদাদ-এ জুমুআর দিন, ১৪ শাবান ১২১৭ হিজরিতে (শুক্রবার, ১০ ডিসেম্বর ১৮০২ খ্রিঃ) জন্মগ্রহণ করেন। \n তিনি ছিলেন একজন ইরাকি ইসলামি পণ্ডিত ; তিনি আল কুরআনের তাফসির গ্রন্থ রুহুল মাআানি রচনার মাধ্যমে প্রসিদ্ধি লাভ করেন ।\nতিনি ৫ জুলকাদাহ, ১২৭০ হিজরিতে (২৯ জুলাই ১৮৫৪ খ্রিঃ) মৃত্যু বরণ করেন ।",
      "He was born in Baghdad on Friday, 14 Shaban 1217 AH (Friday, 10 December 1802 AD).\n He was an Iraqi Islamic scholar; He gained fame by writing Ruhul Ma'ani, a book of Tafseer of Al-Quran.\nHe died on 5th Zulqadah, 1270 Hijri (29 July 1854 AD).",
      "He was born in Baghdad on Friday, 14 Shaban 1217 AH (Friday, 10 December 1802 AD).\n He was an Iraqi Islamic scholar; He gained fame by writing Ruhul Ma'ani, a book of Tafseer of Al-Quran.\nHe died on 5th Zulqadah, 1270 Hijri (29 July 1854 AD)."
    ],
    "image": "https://i.ibb.co/fYd4Pyd/islamic-man.jpg"
  },
  {
    "_id": "667dc1367d866f035c07d614",
    "name": [
      "ইমাম আবু বকর ইবনু আবি শাইবা রহ.",
      "Imam Abu Bakr Ibn Abi Shaiba.",
      "الإمام أبو بكر ابن أبي شيبة"
    ],
    "desc": [
      "ইমাম আবু বকর ইবনু আবি শাইবা রহ. 159 হিজরিতে ইরাকের কুফায় জন্মগ্রহণ করেন । তিনি মুসান্নাফ ইবনে আবি শায়বাহ , আল-মুসনাদসহ অনেক বিশাল বিশাল রচনার লেখক ছিলেন । তিনি সুফিয়ান ইবনে উয়ায়না, আবদুল্লাহ ইবনে আল-মুবারক এবং আবদ আল-রহমান ইবনে মাহদীর মতো নির্ভরযোগ্য ও বিশ্বস্ত ইমামদের কাছ থেকে হাদিসের জ্ঞান অর্জন করেছেন। তাঁর থেকে বর্ণিত অসংখ্য হাদিস বুখারী,মুসলিম, আবু দাউদ, নাসায়ী, ইবনে মাজাহসহ অসংখ্য হাদিসের কিতাবে বর্ণিত হয়েছে। তিনি 76 বছর বয়সে (235 হি) মারা যান। [৫]",
      "Imam Abu Bakr Ibn Abi Shaiba. Born in Kufa, Iraq in 159 Hijri. He was the author of many huge works including Musannaf Ibn Abi Shaybah, Al-Musnad. He acquired the knowledge of hadith from reliable and trustworthy Imams such as Sufyan ibn Uwayna, Abdullah ibn al-Mubarak and Abd al-Rahman ibn Mahdi. Numerous hadiths narrated from him have been narrated in numerous books of hadiths including Bukhari, Muslim, Abu Dawud, Nasa'i, Ibn Majah. He died at the age of 76 (235 AH). [5]",
      "الإمام أبو بكر ابن أبي شيبة. ولد بالكوفة بالعراق سنة 159 هجرية. وله مصنفات ضخمة كثيرة منها مصنف ابن أبي شيبة، المسند. أخذ علم الحديث عن الأئمة الثقات الثقات مثل سفيان بن عوينة، وعبد الله بن المبارك، وعبد الرحمن بن مهدي. وقد روي عنه أحاديث كثيرة في كتب كثيرة من الحديث منها البخاري، ومسلم، وأبو داود، والنسائي، وابن ماجه. توفي عن عمر يناهز 76 عامًا (235 هـ). [5]"
    ],
    "image": "https://i.ibb.co/fYd4Pyd/islamic-man.jpg"
  },
  {
    "_id": "667dc13f7d866f035c07d615",
    "name": [
      "ইমাম বাইহাকী (রাহ.)",
      "Imam Baihaqi (RA)",
      "الإمام البيهقي رحمه الله"
    ],
    "desc": [
      "ইমাম বাইহাকী\n\nআবু বাকর আহমাদ ইবনে হুসাইন ইবনে 'আলী ইবনে মুসা আল-খোসরোযেরদী আল-বায়হাকী, (البيهقي) ইমাম আল-বায়হাকী নামে সমাধিক পরিচিত, ৯৯৪ ঈসায়ী সন মোতাবেক ৩৮৪ হিজরি সালে সাবযেভারের নিকটে একটি ছোট্ট শহর খোসরোযেরদে জন্ম গ্রহণ করেন যা তখন খুরসানের বায়হাক নামে পরিচিত ছিল। তিনি তার জীবদ্দশাতেই, একজন প্রসিদ্ধ হাদীছ শাস্ত্রবিদ হিসেবে প্রতিষ্ঠা লাভ করেন, এবং তিনি ছিলেন শাফি আশ'আরী থিওলজির অন্যতম গুরুত্বপূর্ণ ব্যক্তিত্ব।\n\nজীবনী\nআল-বায়হাকী রহঃ এর পূর্ণ নামঃ (আরবী) أحمد بن الحسين بن علي بن موسى الخراساني البيهقي المشهور بالبيهقي.\n\nইমাম বায়হাকী ছিলেন শাফি'ঈ ফিকহের স্কলার এবং একইসাথে হাদীছ শাস্ত্রের পণ্ডিত। তিনি ফিকহ অধ্যয়ন করেন আবুল ফাতাহ নাসির ইবনুল হুসাইন ইবনে মুহাম্মাদ আল-নায়সাবুরী, আবুল হাসান হানকারীর নিকট। হাদীছ অধ্যয়ন করেন ইমাম হাকিম, আবু মানসুর আল-বাগদাদী এবং প্রমুখ হাদীছের স্কলারদের কাছে। তিনি ছিলেন হাদীছশাস্ত্রের ইমাম আল-হাকিমের প্রধানতম ছাত্র বা শাগরেদ। তিনি মৃত্যু বরণ করেন ১০৬৬ ঈসায়ী সনে।\n\nকর্ম\nবায়হাকী রহঃ ছিলেন তার সময়ের অন্যতম খ্যাতনামা লেখক, লিখেছেন এক হাজার খণ্ডের অধিক রচনা, আয-যাহাবীর মতে। তার উল্লেখযোগ্য রচনাসমূহ হচ্ছে:\n\nআল-সুনান আল-কুবরা, পরিচিতসুনান আল-বায়হাকী নামে\nমা 'আরিফা আল-সুনান ওয়া আল-আসার\nবায়ান খাতা মান আখতা'আ 'আলা আল-শাফি'ঈ\nআল-মাবসুত, শাফি'ঈ আইনের গ্রন্থ\nআল-আসমা' ওয়াল সিফাত\nআল-ই'তিকাদ 'আলা মাযহাব আলা-সালাফ আহলুস সুন্নাহ ওয়াল জামা'আহ\nদালা'ইল আল-নবুওয়াহ\nশুয়া'বুল ঈমান\nআল-দাও'য়াতুল কাবীর\nআল-যুহদ আল-কাবীর",
      "Imam Baihaqi\n\nAbu Bakr Ahmad ibn Husayn ibn 'Ali ibn Musa al-Khosrojerdi al-Bayhaqi, (البيهقي) better known as Imam al-Bayhaqi, was born in 994 A.D. 384 A.H. in Khosrowerd, a small town near Sabevar, then known as Bayhaq of Khursan. was He established himself, during his lifetime, as a prominent hadith scholar, and was one of the most important figures in Shafi'i Ash'ari theology.\n\nbiography\nAl-Bayhaqi's full name: (Arabic) احمد بن الحسين بن علي بن موسى الخراساني البيهقي المشهور بالبيهقي.\n\nImam Bayhaqi was a scholar of Shafi'i fiqh as well as a scholar of hadith. He studied fiqh under Abul Fatah Nasir ibn al-Husayn ibn Muhammad al-Naisaburi, Abul Hasan Hankari. Hadith studied under Imam Hakim, Abu Mansur al-Baghdadi and other hadith scholars. He was the main student or shaghred of Imam al-Hakim of Hadith. He died in 1066 AD.\n\nKarma\nBayhaqi was one of the most famous writers of his time, writing more than a thousand works, according to Az-Zahabi. His notable works are:\n\nAl-Sunan al-Kubra, also known as Sunan al-Bayhaqi\nMa 'Arifa al-Sunan wa al-Asr\nBayan Khata Man Akhta'a 'Ala Al-Shafi'i\nAl-Mabsut, the book of Shafi'i law\nAl-Asma' wal Sifat\nAl-i'tiqad 'ala Madhhab al-Salaf Ahlus Sunnah wal Jama'ah\nDala'il al-Nubuwah\nShua'bul Iman\nAl-Daw'atul Kabir\nAl-Juhad al-Kabir",
      "الامام البيهقي\n\nأبو بكر أحمد بن حسين بن علي بن موسى الخسرجردي البيهقي، المعروف بالإمام البيهقي، ولد سنة 994 م 384 هـ في خسرورد، بلدة صغيرة قريبة من سبوار، تعرف آنذاك ببيهق خراسان. . وقد نصب نفسه في حياته من علماء الحديث البارزين، وكان من أهم رجال المذهب الشافعي الأشعري.\n\nسيرة شخصية\nاسم البيهقي الكامل: (عربي) احمد بن الحسين بن علي بن موسى الخراساني البيهقي سالم بالبيهقي.\n\nكان الإمام البيهقي من علماء الفقه الشافعي وكذلك عالما في الحديث. تلقّى الفقه على أبي الفتح ناصر بن الحسين بن محمد النيسابوري، أبو الحسن الحنكري. درس الحديث على الإمام الحاكم وأبي منصور البغدادي وغيرهم من علماء الحديث. وكان الطالب الرئيسي أو شغر الإمام الحاكم في الحديث. توفي سنة 1066م.\n\nكارما\nوكان البيهقي من أشهر أدباء عصره، حيث كتب أكثر من ألف مصنف، بحسب الذهبي. أعماله البارزة هي:\n\nالسنن الكبرى، ويعرف أيضا بسنن البيهقي\nمعرفة السنن والعصر\nبيان خاتا مان أختاء على الشافعي\nالمبسوط، كتاب الفقه الشافعي\nالأسماء والصفات\nالإعتقاد على مذهب السلف أهل السنة والجماعة\nدلائل النبوة\nشعبول الإيمان\nالدعوات الكبيرة\nالجهاد الكبير"
    ],
    "image": "https://i.ibb.co/fYd4Pyd/islamic-man.jpg"
  },
  {
    "_id": "667dc1467d866f035c07d616",
    "name": [
      "শাইখুল ইসলাম ইবনে তাইমিয়া (রহ.)",
      "Shaykhul Islam Ibn Taymiyyah (RA)",
      "شيخ الإسلام ابن تيمية (رض)"
    ],
    "desc": [
      "ইবনে তাইমিয়া (রহ.), একজন হাম্বলি মাজহাবের বড় মাপের পন্ডিত, দার্শনিক, ধর্মতাত্ত্বিক ও যুক্তিবিদ ছিলেন। হিজরী সপ্তম শতাব্দীর একজন সংস্কারক। ইসলাম ধর্মীয় পণ্ডিতদের মাঝে একজন উজ্জল নক্ষত্র।\n\n ১২৬৩ সালের ২২ জানুয়ারি (৬৬১ হিজরি) সিরিয়ার হাররান (বর্তমানে তুরস্কের অর্ন্তগত) প্রদেশে তিনি জন্মগ্রহণ করেন।\n\nইবনে তাইমিয়ার পূর্ণ নাম তাকিউদ্দিন আবুল আব্বাস ইবনে আবদুল হালিম ইবনে আবদুস সালাম ইবনে তাইমিয়া আল হারানি। তবে তিনি ‘ইবনে তাইমিয়া’ নামে বেশি পরিচিত। মূলত: এটা তার দাদীর নাম। তার দাদী ছিলেন একজন আলিমাহ। ইবনে তাইমিয়ার গুরুদের মাঝে তার দাদীমা অন্যতম।\n\nবাল্যকাল হতেই ইবনে তাইমিয়ার অসাধারণ মেধা ও আশ্চর্য স্মৃতিশক্তির ক্ষমতা পরিলক্ষিত হয়েছিল। তার দাদী বুঝতে পেরেছিলেন যে তার নাতিন একদিন ইসলাম ধর্মের একজন বিখ্যাত ব্যাক্তিত্বে পরিণত হবেন।\n\nইবনে তাইমিয়া তার সূক্ষ্ম বিচারশক্তি ও সুদক্ষ তাকির্কতার পারদর্শীতার কারণে আলেম সমাজে অবিস্মরণীয়। তিনি ছিলেন অসাধারণ পান্ডিত্যের অধিকারী একজন ফকীহ।\n\nতিনি ছিলেন একজন হাফেজ। আল-কোরআন ও হাদীসের ব্যখ্যা প্রদানে সে সময় তার সমকক্ষ তেমন কেউ ছিলনা বললেই চলে। ইবনে তাইমিয়া ইসলামি আইনের ক্ষেত্রে হাম্বলি মাজহাবের অনুসারী ছিলেন। ইবনে কুদামার পাশাপাশি তার অনুসারীরা ইবনে তাইমিয়াকে হাম্বলি মাজহাবের অন্যতম গুরুত্বপূর্ণ প্রবক্তা হিসেবে গণ্য করেন।\n\nতাই ইবনে তাইমিয়াকে ‘শাইখুল ইসলাম’ বলে সম্বোধন করা হয়।\n\nইবনে তাইমিয়া কুরআন ও সুন্নাহর প্রাথমিক যুগের ব্যাখ্যাকে গ্রহণ করার পক্ষাপাতি ছিলেন। ওয়াহাবিবাদ, সালাফিবাদ ও জিহাদপন্থার উপর তার ব্যাপক প্রভাব রয়েছে।\n\nইসলামী ইতিহাসের অনন্য প্রতিভার অধিকারী এই আলেমের জীবনী অত্যন্ত ঘটনা বহুল এবং সংগ্রাম মুখর ছিল। মঙ্গোল আক্রমণের সময় তিনি জীবিত ছিলেন। মঙ্গোলদের বিরুদ্ধে জিহাদের ফতোয়ার কারণে তিনি বেশি আলোচিত হয়েছিলেন।\n\nতার সময়ে মোঙ্গলরা ইসলাম গ্রহণ করলেও শরিয়ার অনুসরণ না করায় তিনি তাদের অমুসলিম হিসেবে ঘোষণা দিয়েছিলেন।\n\nমুসলমানদের মধ্য থেকে শিরক, বিদাত দূর করার জন্যে ইবনে তাইমিয়া লিখনী ও বক্তৃতার মাধ্যমে সার জীবন কাজ করে গেছেন। তার লেখনীতে সে সময় সামাজিক কুসংস্কার গুলো অনেকাংশে দূরীভূত হয়।\n\nইবনে তাইমিয়া প্রসংগে যুগেযুগে বহু আলেম তার গুণকীর্তন করেছেন। ভারতের সুপরিচিত ব্যক্তিত্ব আল্লামাহ শিবলী নুমান রহ: তার সম্পর্কে বলেন, ‘ইমাম ইবনে তাইমিয়ার মাঝে মুজাদ্দিদ হওয়ার যে বৈশিষ্ট্য পরিলক্ষিত হয়েছিলো, তা চার ইমাম (ইমাম আবু হানীফা, ইমাম মালেক, ইমাম শাফেয়ী এবং ইমাম আহমাদ) এর মাঝেও ছিলোনা।’\n\nইমাম ইবনে তাইমিয়া ৫০০ এর অধিক গ্রন্থ রচনা করেছেন। তবে ড: সিরাজুল হক তার ২৫৬টি গ্রন্থের নাম উল্লেখ করেছেন। ‘আল-জাওয়াবুস সহীহ লিমান বাদালা দ্বীনিল মাসিহ’ ধর্ম তত্ত্বের উপর তার লিখিত বিখ্যাত গ্রন্থ।\n\nবিরোধীদের চক্রান্তে ইবনে তাইমিয়াকে জীবনের অনেকটা সময় কারাগারে কাটাতে হয়েছিলো। এমনকি ইমাম আবু হানীফার মতো তার মৃত্যুও কারাগারের ভেতরেই হয়েছিলো। মৃত্যুর এর বছর পূর্ব থেকে ইবনে তাইমিয়াকে কলম, কালি, কাগজ সরবরাহ করা হয়নি, যাতে তিনি তার জ্ঞান না লিপিবদ্ধ করতে পারেন।\n\nবিশ্ববিখ্যাত এ ইমাম ১৩২৮ সালের ২০ সেপ্টেম্বর (২২ যুলক্কাদা ৭২৮ হিজরীতে) সিরিয়ার দামেস্কের কারাগারে মৃত্যুবরণ করেন।\nঐতিহাসিকগণদের মতে, তার মৃত্যুর পর প্রায় দুই লক্ষ মুসলমান তার জানাজা পড়ার জন্যে সমবেত হয়েছিলো।\n\nইবনে তাইমিয়ার কিছু উক্তি:\n\n‘আবু বকর (রা:) এর মত কেউ কোনদিন রাসূলুল্লাহ (সা:) কে ভালোবাসেনি। সুতরাং যারা আবু বকরকে ঘৃণা করে তারা শ্রেষ্ঠ মুনাফিকদের দলভুক্ত।’ সূত্র: আল-মিনহাজ, ৪/৩০০ পৃষ্ঠা।\n\n‘পৃথিবীর মানুষের যত পথভ্রষ্টতা তার মূল নিহিত এই দুইটি জিনিসে: হয় আল্লাহ অনুমোদন দেননি এমন কিছুকে ধর্ম হিসেবে নেয়া, অথবা আল্লাহ নিষেধ করেননি এমন কিছুকে নিষিদ্ধ করা।’ সূত্র: মাজমূ’উল-ফাতাওয়া, ৪/১৯৬ পৃষ্ঠা।\n‘আল্লাহ ভালোবাসা পেতে ভালোবাসেন।’ সুত্র: মাজমু আল ফাতাওয়া, ১/৫৪ পৃষ্ঠা।",
      "Ibn Taymiyyah (RA), was a great scholar, philosopher, theologian and logician of the Hanbali school. A reformer of the seventh century Hijri. Islam is a bright star among religious scholars.\n\n He was born on January 22, 1263 (661 Hijri) in the province of Harran, Syria (now part of Turkey).\n\nIbn Taymiyyah's full name is Taqiuddin Abul Abbas Ibn Abdul Halim Ibn Abdus Salam Ibn Taymiyyah Al Harani. But he is better known as 'Ibn Taymiyyah'. Originally: It was her grandmother's name. His grandmother was an Alimah. His grandmother was one of Ibn Taymiyyah's teachers.\n\nIbn Taymiyyah's prodigious intellect and amazing memory were observed from his childhood. His grandmother realized that her grandson would one day become a famous figure in Islam.\n\nIbn Taymiyyah is unforgettable in the scholarly community because of his fine judgment and skillful taqirqat. He was a jurist of extraordinary erudition.\n\nHe was a Hafez. It can be said that there was no one equal to him at that time in providing the interpretation of Al-Quran and Hadith. Ibn Taymiyyah was a follower of the Hanbali school of Islamic law. Along with Ibn Qudama, his followers consider Ibn Taymiyyah as one of the most important exponents of the Hanbali Madhhab.\n\nHence Ibn Taymiyyah is addressed as 'Shaykhul Islam'.\n\nIbn Taymiyyah was inclined to accept the earlier interpretations of the Qur'an and Sunnah. It has a great influence on Wahhabism, Salafism and Jihadism.\n\nThe life of this scholar, who has a unique talent in Islamic history, was very eventful and full of struggles. He was alive during the Mongol invasion. He became more famous for his fatwa of jihad against the Mongols.\n\nDuring his time the Mongols converted to Islam but did not follow Sharia and he declared them non-Muslims.\n\nIbn Taymiyyah has worked throughout his life through writings and speeches to remove shirk and innovation from Muslims. In his writings, the social prejudices of that time were removed to a large extent.\n\nIbn Taymiyyah has been praised by many scholars throughout the ages. Allamah Shibli Numan, a well-known figure in India, said about him, \"The characteristic of being a Mujaddid that was observed in Imam Ibn Taymiyyah was not present in the four Imams (Imam Abu Hanifa, Imam Malek, Imam Shafi'i and Imam Ahmad).\"\n\nImam Ibn Taymiyyah wrote more than 500 books. However, Dr. Sirajul Haque mentioned the names of his 256 books. 'Al-Jawabus Sahih Liman Badala Dinil Masih' is his famous treatise on religious theory.\n\nIbn Taymiyyah had to spend most of his life in prison due to the conspiracies of his opponents. Even like Imam Abu Hanifa he died inside the prison. From the year before his death, Ibn Taymiyyah was not provided with pen, ink, or paper, so that he could not record his knowledge.\n\nThe world-famous Imam died in the prison of Damascus, Syria on 20 September 1328 (22 Dhul-Qada 728 AH).\nAccording to historians, after his death, about two lakh Muslims gathered for his funeral.\n\nSome quotes of Ibn Taymiyyah:\n\nNo one ever loved the Prophet (PBUH) like Abu Bakr (RA). So those who hate Abu Bakr are among the best hypocrites.' Source: Al-Minhaj, page 4/300.\n\n\"All the misguidance of the people of the world is rooted in these two things: either taking as religion something that Allah has not approved, or prohibiting something that Allah has not forbidden.\" Source: Majmu'ul-Fatawa, page 4/196.\n'Allah loves to be loved.' Source: Majmu al-Fatawa, page 1/54.",
      "كان ابن تيمية (رضي الله عنه) عالمًا عظيمًا وفيلسوفًا ومتكلمًا ومنطقيًا من المذهب الحنبلي. مصلح من القرن السابع الهجري. الإسلام نجم ساطع بين علماء الدين.\n\n وُلِد في 22 يناير 1263 (661 هجرية) في محافظة حران بسوريا (جزء من تركيا حاليًا).\n\nاسم ابن تيمية الكامل هو تقي الدين أبو العباس بن عبد الحليم بن عبد السلام بن تيمية الحراني. لكنه اشتهر باسم \"ابن تيمية\". في الأصل: كان اسم جدتها. كانت جدته عليمة. وكانت جدته من معلمي ابن تيمية.\n\nوقد لوحظ ذكاء ابن تيمية المذهل وذاكرته المذهلة منذ طفولته. أدركت جدته أن حفيدها سيصبح ذات يوم شخصية مشهورة في الإسلام.\n\nابن تيمية لا يُنسى في مجتمع العلماء لحكمه الجيد وطاقاته الماهرة. لقد كان فقيهًا واسع الاطلاع غير العادي.\n\nوكان حافظا. ويمكن القول أنه لم يكن هناك من يعادله في ذلك الوقت في تفسير القرآن والحديث. كان ابن تيمية من أتباع المذهب الحنبلي في الشريعة الإسلامية. إلى جانب ابن قدامة، يعتبر أتباعه ابن تيمية أحد أهم دعاة المذهب الحنبلي.\n\nومن هنا سمي ابن تيمية بـ”شيخ الإسلام”.\n\nكان ابن تيمية يميل إلى قبول التفسيرات السابقة للقرآن والسنة. وله تأثير كبير على الوهابية والسلفية والجهادية.\n\nوكانت حياة هذا العالم، صاحب الموهبة الفريدة في التاريخ الإسلامي، حافلة بالأحداث ومليئة بالصراعات. كان على قيد الحياة أثناء الغزو المغولي. واشتهر بفتواه في الجهاد ضد المغول.\n\nوفي عهده اعتنق المغول الإسلام لكنهم لم يتبعوا الشريعة وأعلنهم غير مسلمين.\n\nلقد عمل ابن تيمية طوال حياته من خلال كتاباته وخطبه على إزالة الشرك والبدع عن المسلمين. في كتاباته، تمت إزالة التحيزات الاجتماعية في ذلك الوقت إلى حد كبير.\n\nوقد أثنى على ابن تيمية كثير من العلماء على مر العصور. قال عنه العلامة شبلي نعمان أحد الشخصيات المشهورة في الهند: \"إن صفة التجديد التي كانت موجودة عند الإمام ابن تيمية لم تكن موجودة في الأئمة الأربعة (الإمام أبو حنيفة والإمام مالك والإمام الشافعي والإمام الإمام أحمد).\"\n\nكتب الإمام ابن تيمية أكثر من 500 كتاب. إلا أن الدكتور سراج الحق ذكر أسماء كتبه البالغ عددها 256 كتابا. \"الجوابوس صحيح ليمان بدل دينل المسيح\" هو أطروحته الشهيرة حول النظرية الدينية.\n\nاضطر ابن تيمية إلى قضاء معظم حياته في السجن بسبب مؤامرات خصومه. حتى مثل الإمام أبو حنيفة مات داخل السجن. ومنذ السنة التي سبقت وفاته، لم يُزود ابن تيمية بقلم ولا حبر ولا ورق، حتى لا يتمكن من تدوين علمه.\n\nتوفي الإمام المشهور عالمياً في سجن دمشق بسوريا في 20 سبتمبر 1328 (22 ذي القعدة 728 هـ).\nووفقا للمؤرخين، بعد وفاته، تجمع حوالي ألفين من المسلمين لجنازته.\n\nبعض أقوال ابن تيمية:\n\nولم يكن أحد يحب النبي (ص) مثل أبو بكر (رضي الله عنه). فمن يبغض أبا بكر فهو من أفضل المنافقين. المصدر : المنهاج صفحة 4/300.\n\n«كل ضلال أهل الدنيا أصله في هذين الأمرين: إما أن يتخذوا ما لم يرضاه الله، أو يحرموا ما لم يحرم الله». المصدر: مجموع الفتاوى، صفحة 4/196.\n«إن الله يحب أن يكون محبوبا». المصدر: مجموع الفتاوى، صفحة 1/54."
    ],
    "image": "https://i.ibb.co/prb9Bph/images-4.jpg"
  },
  {
    "_id": "667dc1507d866f035c07d617",
    "name": [
      "আল্লামা হাফেয শামসুদ্দীন মুহাম্মদ আয-যাহাবী রহ.",
      "Allama Hafeez Shamsuddin Muhammad Az-Zahabi.",
      "العلامة حفيظ شمس الدين محمد الذهبي."
    ],
    "desc": [
      "ইমাম আয-যাহাবী রহ. জীবনী:\n\nইমাম যাহাবীর ছাত্র তাজ-উদ-দীন আব্দুল ওয়াহ্‌হাব আস-সুবকী তার উস্তাদের ব্যপারে বলেন:-\n “আমাদের শাইখ ও উস্তায ইমাম হাফেয শামসুদ্দীন আবু আব্দুল্লাহ আত-তুর্কমানী আয-যাহাবী যুগশ্রেষ্ঠ মুহাদ্দিস। তিনি নজির-বিহীন। তিনি এমন এক গুপ্তধন, যার কাছে আমরা সমস্যায় পতিত হলে ছুটে যাই। হিফযের দিক থেকে সৃষ্টিজগতের সেরা। শাব্দিক ও অর্থগতভাবে তিনি খাঁটি সোনা। ‘জারহ ও তাদীল’ শাস্ত্রের পণ্ডিত। ‘রিজালশাস্ত্রে’ তিনিই বিজ্ঞ। যেন সমগ্র উম্মাহর লোকজনকে একটা প্রান্তরে একত্র করা হয়েছে, আর তিনি তাদের দেখে দেখে তাদের ব্যাপারে বলছেন। তার জন্ম ৬৭৩ হিজরী সনে। আঠার বছর বয়সে তিনি হাদীস অন্বেষণ শুরু করেন। দামেস্ক, বা‘লাবাক্কা, মিশর, আলেকজান্দ্রিয়া, মক্কা, আলেপ্পো, নাবুলসসহ নানা শহরে তিনি গমন করেন। তার শাইখের সংখ্যা অগণিত। তার থেকে প্রচুর সংখ্যক মানুষ হাদীস শুনেছে। তিনি হাদীস-শাস্ত্রের খেদমতে রত ছিলেন, এমনকি এ ব্যাপারে গভীর জ্ঞানে পৌঁছেছেন। দামেস্কে অবস্থান নিলেন। সকল দেশ থেকে তার উদ্দেশ্যে লোকজন আসতে থাকল। ‘আত-তারীখুল কাবীর’ তিনি রচনা করলেন। আরও লিখলেন ‘আত-তারীখুল আওসাত্ব’ যেটা ‘ইবার’ নামেও পরিচিত। সেটা বেশ সুন্দর। আরেকটা ছোট বই লিখেলেন, ‘দুওয়ালুল ইসলাম’। এছাড়া ‘কিতাবুন নুবালা’ ও ‘আল-মীযান ফিদ-দুয়াফা’ রচনা করেন। শেষোক্ত বইটি সর্বশ্রেষ্ঠ বই। আরও রচনা করেন ‘সুনান বাইহাকী’র মুখতাসার। এটিও ভালো। লিখেছেন ‘ত্বাবাকাতুল হুফ্‌ফায’, ‘ত্বাবাকাতুল ক্বুর্‌রা’-সহ আরও নানা সংক্ষিপ্ত গ্রন্থ। বিভিন্ন রেওয়ায়াতে তিনি কুরআন শিখেন এবং শিক্ষা প্রদান করেন। ৭৪৮ হিজরী সনে তিনি মারা যান। মৃত্যুর কিছু দিন আগ থেকে তিনি চোখের জ্যোতি হারিয়েছিলেন।” [ত্বাবাকাতুশ শাফেইয়্যা আল-কুবরা: (৯/১০০-১২৩)।]",
      "Imam Az-Zahabi. Biography:\n\nImam Zahabi's student Taj-ud-Din Abdul Wahhab As-Subaki said about his teacher:-\n \"Our Shaykh and Ustaz Imam Hafeez Shamsuddin Abu Abdullah At-Turkmani Az-Zahabi is the greatest Muhaddith of the age. He is unprecedented. He is a treasure to whom we run when we are in trouble. The best of creation in terms of Hifay. Literally and semantically he is pure gold. Scholar of 'Zarh and Tadeel' Shastras. He is the wise man in 'Rizal Shastra'. It is as if the people of the entire Ummah have been gathered in a desert, and he is looking at them and talking about them. He was born in 673 Hijri. At the age of eighteen he started researching Hadith. He traveled to many cities including Damascus, Ba'labakka, Egypt, Alexandria, Mecca, Aleppo, Nabuls. The number of his shaykhs is countless. A large number of people heard hadith from him. He was in the service of hadith-shastra, and even reached deep knowledge in this regard. He stayed in Damascus. People flocked to him from all over the world. He composed 'At-Tarikhul Kabir'. He also wrote 'At-Tarikhul Awasatwa' which is also known as 'Ibar'. That's pretty cool. He wrote another small book, \"Duwalul Islam\". Besides, he wrote 'Kitabun Nubala' and 'Al-Mizan Fid-Duafa'. The last book is the best book. Also composed by Mukhtasar of 'Sunan Baihaqi'. That's good too. Wrote 'Tabaqatul Huffaz', 'Tabaqatul Qurra' and other short books. He learned and taught the Qur'an in various traditions. He died in 748 AH. He had lost his eyesight a few days before his death.” [Tabaqatush Shafiyya al-Kubra: (9/100-123).]",
      "الامام الذهبي . سيرة شخصية:\n\nقال تلميذ الإمام الذهبي تاج الدين عبد الوهاب السبكي عن أستاذه:-\n \"\"شيخنا والأستاذ الإمام حفيظ شمس الدين أبو عبد الله التركماني الذهبي أعظم محدثي العصر. لا مثيل له. وهو كنز نلجأ إليه عندما نكون في مشكلة. أفضل الخلق من حيث الحفياء.\" وهو ذهب خالص بالمعنى الحرفي والدلالي، وهو عالم بالزهرة والتديل، وهو الرجل الحكيم في \"ريزال شاسترا\". عليهم والحديث عنهم ولد سنة 673 هجرية وعمره ثمانية عشر عاما بدأ في بحث الحديث، وسافر إلى مدن كثيرة منها دمشق، وبعلبك، ومصر، والإسكندرية، ومكة، وحلب، ونابل وسمع منه عدد كبير من المشايخ، وكان في خدمة الحديث، بل وصل إلى المعرفة العميقة في هذا الصدد، وتوافد إليه الناس من جميع أنحاء العالم \"التاريخ الكبير\" وكتب أيضًا \"التاريخ الأوسط\" وهو المعروف أيضًا باسم \"إيبار\". هذا رائع. وكتب كتابًا صغيرًا آخر بعنوان \"دوال الإسلام\". وله \"كتاب النبلاء\" و\"الميزان في الضعفاء\". الكتاب الأخير هو أفضل كتاب. وألحانه أيضاً مختار سنن البيهقي. هذا جيد جدا. ألف \"طبقة الحفاظ\" و\"طبقة القرى\" وغيرها من الكتب القصيرة. تعلم وعلم القرآن في مختلف التقاليد. توفي سنة 748 هـ. لقد فقد بصره قبل أيام قليلة من وفاته. [طبقاتوش الشافعية الكبرى: (9/100-123).]"
    ],
    "image": "https://i.ibb.co/sgvMbnN/islamic-man.jpg"
  },
  {
    "_id": "667dc1587d866f035c07d618",
    "name": [
      "ইমাম ফকরুদ্দীন আররাযী (র:)",
      "Imam Fakhruddin Arraazi (RA)",
      "الامام فخر الدين الرازي (رض)"
    ],
    "desc": [
      "আত-তাফসীরুল কাবীর' ও ইমাম ফখরুদ্দীন রাযী-এর পরিচয় ইসলামী মনীষার জগতে এক প্রজ্জোল নক্ষত্র বহুমুখী প্রতিভার বিস্ময়কর প্রতিভূ ইমাম রাযী প্রকৃতই ফখরুদ্দীন বা ইসলামের গর্ব। পবিত্র কুরআনের সর্ববৃহৎ ও বিস্তারিত তাফসীর প্রণয়ন করে তিনি চির অমর হয়ে আছেন। ইলমুল কালাম (বিশ্বাস বিজ্ঞান), ভাষাতত্ত্ব, প্রকৌশল, চিকিৎসা বিজ্ঞান, দর্শনশাস্ত্র ও অন্যান্য বহু বিষয়ে তার ব্যুৎপত্তি কিংবদন্তিতুল্য। তাঁর প্রণীত গ্রন্থাদি বিশ্বের জ্ঞান ভাণ্ডারে অতি মূল্যবান সঞ্চয়। তবে ৩২ খণ্ডে সমাপ্ত “মাফাতীহুল গায়ব\" বা \"আত-তাফসীরুল কাবীর” তাফসীর গ্রন্থটি পবিত্র কুরআনের ব্যাখ্যা-বিশ্লেষণে বিশ্বকোষতুল্য এক বিশাল জ্ঞান ভাণ্ডার। তাফসীরুল কাবীর ইমাম ফখরুদ্দীন রায়ী ১ প্রণীত 'মাফাতীহুল গায়ব' ( all sites) তাফসীর গ্রন্থটি বহুবার বহু স্থানে মুদ্রিত হয়। মিসরের আল-বাহিয়্যাহ প্রেস ৩০ খণ্ডে তাফসীরটি প্রকাশ করে। এর ওপর ভিত্তি করেই পাকিস্তানের মূলতানে \"দারুল হাদীস\" প্রকাশনী সংস্থা এর একটি সংস্করণ বের করে কয়েক বছর আগে। এটিই বর্তমান অনুবাদের ভিত্তি। ঊনবিংশ শতাব্দীতে এই তাফসীর গ্রন্থটি বিভিন্ন আরব দেশ থেকে পুনর্মুদ্রিত হয়। তখন এর বিভিন্ন কপির সাথে মিলিয়ে দেখা হয়। মিসরের বিখ্যাত আমিরিয়া প্রেস, হুসায়নিয়া প্রেস এবং আশ-শারাফিয়্যাহ্ প্রেস এ সময় বিভিন্ন ভলিউমে এটি প্রকাশ করে। এর একটি সংস্করণ পর্যালোচনা (তাহকীক) করেছেন প্রফেসার মুহাম্মদ মহিউদ্দীন আবদুল হামীদ ১৯৩২ সালে। পরবর্তীতে বিভিন্ন বিশ্ববিদ্যালয়ে এই তাফসীরের উপর এম. ফিল, পিএইচ ডি গবেষণা হয়। এতে তাফসীরখানা বৈজ্ঞানিক পদ্ধতিতে বিশ্লেষিত হয়। ভারত ও বাংলাদেশেও তাফসীরটি বহুল পঠিত এবং বিভিন্ন লাইব্রেরীতে অতি যত্ন ও সম্মানের সাথে সংরক্ষিত হয়ে আসছে। আত্‌-তাফসীরুল কাবীর-এর রেফারেন্স গ্রন্থাদি ইমাম রাযী (মৃ. ৬০৬ হি.) তাঁর এই বিখ্যাত তাফসীর প্রণয়নে নিজের প্রখর মেধা ও লব্ধ জ্ঞানের ভাণ্ডারকে কাজে লাগিয়েছেন। তারপরও পূর্ববর্তী কিছু তাফসীরের উদ্ধৃতি দিয়ে একে আরও সমৃদ্ধ করার প্রয়াস পেয়েছেন। এর মধ্যে উল্লেখযোগ্য হচ্ছে মুহাম্মদ বিন আলী বিন ইসমাঈল (মৃ. ৩৬৫ হি.)-এর ‘তাফসীরুল কাফফাল আল্‌-কাবীর', কাযী আবদুল জাব্বার বিন আহমাদ বিন আবদুল জাব্বার আল-হামাদানী আল-মু'তাযিলী (মৃ. ৪১৫)-এর তানযীহুল কুরআন আনিল মাতায়েন, আলী বিন আহমাদ বিন মুহাম্মাদ (মৃ. ৪৬২ হি.)-এর তাফাসীর আল-ওয়াহেদী ও মুহাম্মদ বিন উমার বিন মুহাম্মদ আয্-যামাখশারী (মৃ. ৫৩২)-এর 'কাশশাঙ্ক'।",
      "Introduction of At-Tafseerul Kabir and Imam Fakhruddin Razi A bright star in the world of Islamic mystics, Imam Razi, a wonderful genius of versatile talent, is indeed Fakhruddin or the pride of Islam. He is eternally immortal by making the largest and most detailed commentary on the Holy Quran. His etymology in Ilmul Kalam (science of faith), linguistics, engineering, medicine, philosophy and many other subjects is legendary. The books written by him are very valuable collections in the world's store of knowledge. However, the 32-volume \"Mafatihul Ghayab\" or \"At-Tafseerul Kabir\" book of commentary is a huge encyclopedia-like knowledge in the interpretation and analysis of the Holy Quran. Tafseerul Kabir Imam Fakhruddin Rayi 1 'Mafatihul Ghayab' (all sites) Tafseer book was printed many times in many places. Al-Bahiyah Press in Egypt published the Tafsir in 30 volumes. Based on this, a version was published by \"Darul Hadith\" publishing house in Pakistan a few years ago. This is the basis of the present translation. In the 19th century, this book of tafsir was reprinted from various Arab countries. It is then compared with its various copies. Egypt's famous Amiriya Press, Husaynia Press and Ash-Sharafiyah Press published it in different volumes at that time. A version of it was revised (Tahqiq) by Prof. Muhammad Mohiuddin Abdul Hamid in 1932. Later, M. on this commentary in various universities. Phil, is researching Ph.D. In it Tafsirkhana is analyzed in a scientific manner. The Tafseer is also widely read in India and Bangladesh and has been preserved with great care and respect in various libraries. Reference Books of At-Tafseerul Kabir Imam Razi (d. 606 A.H.) utilized his keen intellect and wealth of acquired knowledge in the preparation of his famous Tafseer. Yet he has tried to enrich it by quoting some earlier tafseers. Notable among these are 'Tafseerul Kaffal al-Kabir' by Muhammad bin Ali bin Ismail (d. 365 AH), Tanjihul by Qazi Abdul Jabbar bin Ahmad bin Abdul Jabbar al-Hamadani al-Mu'tazili (d. 415). Qur'an Anil Matayen, Tafasi al-Wahidi by Ali bin Ahmad bin Muhammad (d. 462 AH) and 'Kashshank' by Muhammad bin Umar bin Muhammad az-Zamakhshari (d. 532).",
      "مقدمة التفسير الكبير والإمام فخر الدين الرازي نجم ساطع في عالم الصوفية الإسلامية، الإمام الرازي، عبقري رائع متعدد المواهب، هو في الواقع فخر الدين أو فخر الإسلام. إنه خالد إلى الأبد من خلال تقديم أكبر وأدق تفسير للقرآن الكريم. أصله الأسطوري في علم الكلام (علم الإيمان)، واللغويات، والهندسة، والطب، والفلسفة والعديد من المواضيع الأخرى هو أسطوري. الكتب التي كتبها هي مجموعات قيمة للغاية في مخزن المعرفة في العالم. ومع ذلك، فإن كتاب \"مفاتيح الغياب\" أو \"التفسير الكبير\" المؤلف من 32 مجلدًا، يعد بمثابة موسوعة ضخمة من المعرفة في تفسير القرآن الكريم وتحليله. تفسير الكبير الإمام فخر الدين راي 1 'مفاتيح الغياب' (جميع المواقع) تمت طباعة كتاب التفسير عدة مرات في العديد من الأماكن. وقد نشرت مطبعة الباهية بمصر التفسير في 30 مجلدا. وبناء على ذلك فقد صدرت نسخة عن دار النشر \"دار الحديث\" في باكستان منذ سنوات قليلة. وهذا هو أساس الترجمة الحالية. وفي القرن التاسع عشر، أعيد طبع كتاب التفسير هذا من بلدان عربية مختلفة. ومن ثم تتم مقارنتها بنسخها المختلفة. وقد نشرته مطبعة العامرية المصرية الشهيرة ومطبعة الحسينية ومطبعة الشرفية في مجلدات مختلفة في ذلك الوقت. وقد تم تنقيح نسخة منه (التحقيق) على يد الأستاذ محمد محيي الدين عبد الحميد عام 1932. ثم قام بعد ذلك بمراجعة هذا الشرح في جامعات مختلفة. فيل، يبحث عن دكتوراه. وفيه تحليل تفسيرخانة تحليلا علميا. كما يُقرأ كتاب التفسير على نطاق واسع في الهند وبنغلاديش، وقد تم حفظه بعناية واحترام كبيرين في مكتبات مختلفة. مراجع كتب التفسير الكبير استخدم الإمام الرازي (ت 606 هـ) عقله الشديد وثروة المعرفة المكتسبة في إعداد تفسيره الشهير. ومع ذلك فقد حاول إثرائه بالاستعانة ببعض التفاسير السابقة. ومن أبرزها ‘تفسير الكفال الكبير‘ لمحمد بن علي بن إسماعيل (ت 365هـ)، وتنجيهول للقاضي عبد الجبار بن أحمد بن عبد الجبار الهمداني المعتزلي (ت 415). \"مصحف أنيل مطايين، طفاسي الوحيدي لعلي بن أحمد بن محمد (ت 462هـ) و‘‘كاشنك‘‘ لمحمد بن عمر بن محمد الزمخشري (ت 532)."
    ],
    "image": "https://i.ibb.co/brJLLX8/image.webp"
  },
  {
    "_id": "667dc1607d866f035c07d619",
    "name": [
      "মুহাম্মাদ আমিন ইবনে উমার ইবনে আব্দুল আযীয আবেদিন আদ দামেশকি (রাহ.)",
      "Muhammad Amin Ibn Umar Ibn Abdul Aziz Abedin Ad Damascus",
      "محمد أمين بن عمر بن عبد العزيز عابدين الدمشقي"
    ],
    "desc": [
      "ইবনে আবেদিন। পুরো নাম মুহাম্মাদ আমিন বিন ওমর বিন আবদিল আজিজ আবিদিন আল-দামিশকি (মৃ: ১৮৩৬ -বয়স ৫১–৫২) । তিনি ইবনে আবেদিন শামি নামে সুপরিচিত। তিনি ছিলেন একজন বিশিষ্ট ইসলামী পণ্ডিত। যারা ওসমানি যুগে সিরিয়ার দামেস্ক শহরে বাস করতেন তাদের মধ্যে তিনি একজন অন্যতম ইসলামি আইনবিদ। তিনি ছিলেন হানাফি মাজহাবের বিখ্যাত ফকিহ। তিনি আমিন আল-ফতোয়া উপাধিধারী একজন রাষ্ট্রীয় কর্মকর্তা ছিলেন। এর অর্থ হল তিনি হলেন সেই মুফতি যার কাছে দামেস্কে আইনি প্রশ্ন করা হয়ে থাকতো।\n\nশৈশব:\nইবনে আবিদীন ১৭৮৪ সালে দামেস্কে জন্মগ্রহণ করেন। তার পরিবার পণ্ডিতদের একটি দীর্ঘ বংশ পরম্পরায় ছিল এবং তাই তারা সম্মানিত ছিলেন। তিনি খুব অল্প বয়সে কুরআন অধ্যয়ন করেছিলেন এবং তিনি প্রায় ১২ বছর বয়সে তার প্রথম শিক্ষক শায়খ মুহাম্মাদ আল-কুজবারী আল-কবীরের কাছ থেকে তার প্রথম সাধারণ ডিগ্রি অর্জন করেছিলেন। কথিত আছে যে তিনি পরিপক্ক হওয়ার আগেই কুরআন মুখস্থ করেছিলেন। তিনি অত্যন্ত দৃঢ়প্রতিজ্ঞ ছাত্র ছিলেন। তার পিতার দোকানে কোরআন তেলাওয়াত করার পর এবং এর জন্য সমালোচনা পাওয়ার পর, তিনি তার কাজকে নিখুঁত করার চেষ্টা করেছিলেন এবং বেশ কয়েকজন বিখ্যাত পণ্ডিতের অধীনে জোরালোভাবে অধ্যয়ন করেছিলেন। অনেক পরিশ্রমের পর, তিনি অনুমোদনের চারটি ডিগ্রি অর্জন করেন",
      "Ibn Abedin. Full name Muhammad Amin bin Omar bin Abdil Aziz Abidin Al-Damishki (d: 1836 - age 51-52). He is popularly known as Ibn Abedin Shami. He was a prominent Islamic scholar. He is one of the Islamic jurisprudents who lived in the Syrian city of Damascus during the Ottoman period. He was a famous jurist of the Hanafi school. He was a state official with the title Amin al-Fatwa. This means that he was the mufti to whom legal questions were referred in Damascus.\n\nChildhood:\nIbn Abidin was born in Damascus in 1784. His family had a long lineage of scholars and were therefore respected. He studied the Qur'an at a very young age and he received his first general degree at the age of 12 from his first teacher, Shaykh Muhammad al-Kuzbari al-Kabir. He is said to have memorized the Quran before he reached maturity. He was a very determined student. After reciting the Qur'an in his father's shop and receiving criticism for it, he tried to perfect his work and studied vigorously under several famous scholars. After much effort, he obtained four degrees of approval",
      "ابن عابدين. الاسم الكامل محمد أمين بن عمر بن عبد العزيز عابدين الدمشكي (ت: 1836 - السن 51-52). والمعروف شعبيا بابن عابدين الشامي. وكان من علماء الإسلام البارزين. هو أحد الفقهاء الإسلاميين الذين عاشوا في مدينة دمشق السورية في العهد العثماني. كان من فقهاء المذهب الحنفي المشهورين. كان من موظفي الدولة بلقب أمين الفتوى. وهذا يعني أنه هو المفتي الذي تحال إليه المسائل الشرعية في دمشق.\n\nطفولة:\nولد ابن عابدين في دمشق عام 1784. وكانت عائلته ذات نسب طويل من العلماء، وبالتالي كانوا محترمين. درس القرآن في سن مبكرة جداً وحصل على الدرجة العامة الأولى في سن الثانية عشرة على يد أستاذه الأول الشيخ محمد الكزبري الكبير. ويقال أنه حفظ القرآن قبل أن يبلغ سن الرشد. لقد كان طالبًا حازمًا للغاية. بعد تلاوة القرآن في متجر والده وتلقي النقد عليه، حاول إتقان عمله ودرس بقوة على يد العديد من العلماء المشهورين. وبعد جهد كبير حصل على أربع درجات من الموافقة"
    ],
    "image": "https://i.ibb.co/sgvMbnN/islamic-man.jpg"
  },
  {
    "_id": "667dc16a7d866f035c07d61a",
    "name": [
      "ইমাম আহমদ ইবনে হাম্বল (রহঃ)",
      "Imam Ahmad Ibn Hanbal (RA)",
      "الامام أحمد بن حنبل "
    ],
    "desc": [
      "ইমাম আহমদ ইবনে হাম্বল (রহঃ)-র জীবনী\n\nইমাম আহমদ ইবনে হাম্বল আশ্ শায়বানী আল-মারুযী (রহ:)-এর জন্ম ১৬৪ হিজরী মোতাবেক ৭৮০ সালে বাগদাদ নগরীতে এবং মৃত্যুও সেখানেই ২৪১ হিজরী/৮৫৫ সালে। তিনি হাদীস ও ফেকাহ উভয় শাস্ত্রেই ইমাম ছিলেন। সুন্নাহ’র সূক্ষ্ম ও অন্তর্নিহিত বিষয়গুলোতেও তিনি ছিলেন পারদর্শী।\n\nযুহদ ও ওয়ারায় তাঁর প্রসিদ্ধি ছিল। হাদীস সংগ্রহের উপলক্ষে তিনি কুফা, বসরা, মক্কা মোয়াযযমা, মদীনা মোনাওয়ারা, ইয়েমেন, দামেশক ও মেসোপটেমিয়ায় ভ্রমণ করেন। ইমাম সাহেব ফেকাহ-শাস্ত্র ইমাম শাফেঈ (রহ:)-এর কাছে শিক্ষা করেন, যিনি পাল্টা তাঁর কাছ থেকে হাদীস-শাস্ত্র শিক্ষা করেন। ইবরাহীম আল-হারবী বলেন, আমি ইমাম আহমদ ইবনে হাম্বল (রহ:)-কে দেখেছি। আল্লাহতা’লা তাঁকে ইসলামী জ্ঞানের সকল শাখায় সমৃদ্ধ করেছিলেন।\n\nকুতায়বা ইবনে সাঈদ বলেন, যদি ইমাম আহমদ (রহ:) সর্ব-হযরত (সুফিয়ান) সাওরী (রহ:), আল-আওযাঈ (রহ:), ইমাম মালেক (রহ:) ও লায়েস্ ইবনে সাআদ (রহ:) প্রমুখের যুগে জীবিত হতেন, তবে তিনি সবাইকে ছাড়িয়ে যেতেন।\n\nতিনি দশ লক্ষ হাদীস মুখস্থ করেছিলেন। ইমাম শাফেঈ (রহ:) একবার তাঁকে মিসর থেকে একখানি পত্র পেরণ করেন। এই চিঠি পড়ার সময় তিনি কাঁদতে থাকেন। তাঁকে কাঁদবার কারণ জিজ্ঞেস করার পরে তিনি জবাব দেন,\n\nইমাম শাফেঈ (রহ:) স্বপ্নে দেখেন রাসূলুল্লাহ (দ:)-কে, যিনি তাঁকে আদেশ করেছেন এই বলে, ‘আবূ আব্দিল্লাহ আহমদ ইবনে হাম্বলকে আমার সালাম-সহ একটি পত্র লেখো। কুরআন মজীদ সৃষ্টি কি-না সে সম্পর্কে তাকে জিজ্ঞেস করা হবে। তাকে বলবে ওই প্রশ্নের উত্তর না দিতে’।\n\nআট লক্ষ পুরুষ ও ৬০,০০০ মহিলা ইমাম সাহেব (রহ:)-এর জানাযায় শরীক হন। যেদিন তিনি বেসালপ্রাপ্ত হন, সেই দিন ২০,০০০ ইহুদী, খৃষ্টান ও প্রাচীন পারসিক পুরোহিত ইসলাম ধর্ম গ্রহণ করেন।",
      "Biography of Imam Ahmad Ibn Hanbal (RA).\n\nImam Ahmad Ibn Hanbal Ash Shaybani Al-Maruzi (RA) was born in the year 164 Hijri in 780 in the city of Baghdad and died there in 241 Hijri/855. He was an Imam in both Hadith and Fiqh. He was also well versed in the subtleties and subtleties of the Sunnah.\n\nHe was famous in Juhad and Wara. He traveled to Kufa, Basra, Makkah Moyazma, Madinah Monawara, Yemen, Damascus and Mesopotamia to collect hadiths. Imam Sahib taught Fiqh to Imam Shafi'i (RA), who in turn learned Hadith from him. Ibrahim al-Harbi said, I saw Imam Ahmad Ibn Hanbal (RA). Allah Ta'ala enriched him in all branches of Islamic knowledge.\n\nQutayba Ibn Sa'id said, If Imam Ahmad (RA) had lived in the era of Sufyan Sawri (RA), Al-Awza'i (RA), Imam Malek (RA) and Lays Ibn Sa'd (RA) etc. , but he would surpass them all.\n\nHe memorized ten lakh hadiths. Imam Shafi'i (RA) once sent him a letter from Egypt. He wept while reading this letter. After asking him why he was crying, he replied,\n\nImam Shafi'i (RA) saw the Messenger of Allah (PBUH) in a dream, who commanded him saying, 'Write a letter with my salutations to Abu Abd Allah Ahmad Ibn Hanbal. He will be asked about whether the Qur'an was created or not. Tell him not to answer that question.\n\nEight lakh men and 60,000 women attended the funeral of Imam Sahib (RA). On the day he was inaugurated, 20,000 Jewish, Christian and ancient Persian priests converted to Islam.",
      "سيرة الإمام أحمد بن حنبل (رضي الله عنه).\n\nولد الإمام أحمد بن حنبل الشيباني المروزي (رضي الله عنه) سنة 164 هجرية سنة 780 ميلادية بمدينة بغداد وتوفي بها سنة 241 هجرية / 855 م. وكان إماما في الحديث والفقه. وكان ضليعاً في دقائق السنة ودقائقها.\n\nوكان مشهورا في جهاد وارة. وسافر إلى الكوفة والبصرة ومكة الميزمة والمدينة المنورة واليمن ودمشق وبلاد الرافدين لجمع الأحاديث. قام الإمام صاحب بتدريس الفقه للإمام الشافعي (رضي الله عنه)، والذي بدوره تعلم منه الحديث. قال إبراهيم الحربي: رأيت الإمام أحمد بن حنبل (رضي الله عنه). وقد أغناه الله تعالى في جميع فروع المعرفة الإسلامية.\n\nوقال قتيبة بن سعيد: لو كان الإمام أحمد (رضي الله عنه) قد عاش في عهد سفيان الثوري (رضي الله عنه) والأوزاعي (رضي الله عنه) والإمام مالك (رضي الله عنه) وليس بن سعد (رضي الله عنه) وغيرهم. لكنه سيتفوق عليهم جميعا.\n\nوكان يحفظ عشرة آلاف حديث. وقد بعث له الإمام الشافعي (رضي الله عنه) ذات مرة رسالة من مصر. بكى وهو يقرأ هذه الرسالة. وبعد أن سأله عن سبب بكائه أجاب:\n\nرأى الإمام الشافعي (رضي الله عنه) رسول الله (صلى الله عليه وسلم) في المنام، فأمره قائلاً: اكتب رسالة بالسلام إلى أبي عبد الله أحمد بن حنبل. فيُسأل هل القرآن مخلوق أم لا؟ أخبريه ألا يجيب على هذا السؤال\n\nحضر ثمانية آلاف رجل و60 ألف امرأة جنازة الإمام صاحب (رضي الله عنه). وفي يوم تنصيبه اعتنق الإسلام 20 ألف كاهن يهودي ومسيحي وفارسي قديم."
    ],
    "image": "https://i.ibb.co/CVz07sk/islamic-man.jpg"
  },
  {
    "_id": "667dc1737d866f035c07d61b",
    "name": [
      "আল্লাম মহিউদ্দিন দরবেশ (রাহ)",
      "Mohi al-Din bin Ahmed bin Mustafa al-Darwiish",
      "محيي الدين بن أحمد بن مصطفى الدرويش"
    ],
    "desc": [
      "মুহিউদ্দিন বিন আহমেদ বিন মুস্তাফা আল-দারবিশ (1908 - 1982) একজন সিরিয়ান কবি এবং সাংবাদিক। তিনি হোমসে জন্মগ্রহণ করেন এবং কুত্তাবে পড়াশোনা করেন। তিনি সাংবাদিকতায় কাজ করেছেন, বেশ কয়েকটি সংবাদপত্রের সাথে যুক্ত ছিলেন তিনি এবং তারপরে বেশ কিছু প্রধান সম্পাদক হিসাবে দায়িত্ব পালন করেন। পরবর্তিতে তিনি শিক্ষাকতার পেশায় চলে আসেন এবং মাধ্যমিক স্তরে আরবি সাহিত্যের শিক্ষক হিসেবে নিযুক্ত হন। তার অসংখ্য কবিতা রয়েছে কিন্তু সেগুলো সংগৃহীত হয়নি।\n\nতার জীবনী: \n\nমুহিউদ্দিন বিন আহমেদ বিন মুস্তাফা আল-দারউইশ 1908 সালে হোমসে জন্মগ্রহণ করেন। তিনি হোমস স্কুলে প্রাথমিক শিক্ষা লাভ করেন এবং দশ বছর বয়সে কুরআন অধ্যয়ন শেষ করেন। তারপর তিনি দামেস্কের দার আল-তামির উচ্চ বিদ্যালয়ে ভর্তি হন।\n1932 সালে শিক্ষা মন্ত্রণালয় তাকে শিক্ষকতার পেশার জন্য বেছে নেওয়ার পর তিনি হোমস প্রিপারেটরি স্কুলে আরবি সাহিত্যের শিক্ষক হিসেবে যোগ দেন । তিনি সাংবাদিকতায় কাজ করেন এবং আল-আইয়াম, আল-কাবাস এবং আলিফ বা সহ বেশ কয়েকটি সংবাদপত্রের সাথে যোগাযোগ করেন। তারপর তিনি আল-তৌফিক পত্রিকা, আল-দুহা পত্রিকার প্রধান সম্পাদক, তখন আল-ফজর সাহিত্য পত্রিকার প্রধান সম্পাদক হিসাবেও দায়িত্ব পালন করেন । 1963 সালে, তিনি আল-খামায়েল সাহিত্য পত্রিকা প্রকাশ করেন। তিনি কলা, সাহিত্য ও সামাজিক বিজ্ঞানের সুপ্রিম কাউন্সিলের সদস্যও ছিলেন।\nমুহিউদ্দিন দারবিশ 1982 সালে মারা যান।\n\n",
      "Muhyiddin bin Ahmed bin Mustafa Al-Darwish (1908 - 1982) is a Syrian poet and journalist. He was born in Homs and studied at Kuttab. He worked in journalism, corresponded with several newspapers, and then became editor-in-chief of several of them. He moved to the educational field and was appointed as a teacher of Arabic literature at the secondary level. He has good, scattered poetry that was not collected in a collection of poems.\n\nHis biography\nMuhyiddin bin Ahmed bin Mustafa Al-Darwish was born in 1908 in Homs. He received his education in the Book of Homs, and finished his studies of the Qur’an when he was ten years old. Then he joined Dar Al-Tameer Higher School in Damascus.\nHe worked as a teacher of Arabic literature in Homs preparatory schools after the Ministry of Education chose him for this job in 1932. He worked in journalism and corresponded with several newspapers, including Al-Ayyam, Al-Qabas, and Alif Baa. Then he was editor-in-chief of Al-Tawfiq newspaper, Al-Duhaa newspaper, then editor-in-chief of Al-Fajr literary newspaper. In 1963, he published Al-Khamayel Literary Magazine. He was a member of the Supreme Council for Arts, Literature and Social Sciences.\nMuhyiddin Darwish died in 1982.\n\nhair\nHe has good, scattered poetry that was not collected in a collection of poems. He also has a number of studies and research, including:\n\nCo-edited Diwan Dik Al-Jinn, 1960\nThe first pioneers of poetry in the city of Homs, in 1969\nfrom his books :\n\nParsing and explaining the Qur’an\nHe has articles.",
      "محيي الدين بن أحمد بن مصطفى الدرويش (1908 - 1982) شاعر وصحفي سوري. ولد في حمص ودرس في كُتّابها. عمل في الصحافة، وراسل عدة جرائد ثم رأس تحرير عدة منهم. انتقل إلى الحقل التربويّ فعُيّن مدرّسًا للأدب العربيّ في المرحلة الثانويّة. له شعر جيّد متفرّق لم يجمعه في ديوان. \n\nسيرته\nولد محيي الدين بن أحمد بن مصطفى الدرويش سنة 1908 في حمص. تلقى علومه في كتابيب حمص، فأنهى دراسته للقرآن وهو في سن العاشرة. ثم التحق بمدرسة دار المعلمين العليا في دمشق.\nعمل مدرساً للأدب العربي في مدارس حمص التجهيزية بعد أن اختارته وزارة المعارف لهذا العمل في عام 1932. عمل في الصحافة فراسل عدة جرائد منها الأيّام والقبس وألف باء. ثم رأس تحرير جريدة التوفيق فجريدة الضّحى ثم رأس تحرير جريدة الفجر الأدبية. وفي عام 1963 أصدر مجلة الخمائل الأدبية. كان عضواً في المجلس الأعلى لرعاية الفنون والآداب والعلوم الاجتماعية.\nتوفي محيي الدين الدرويش في سنة 1982.\n\nشعره\nله شعر جيّد متفرّق لم يجمعه في ديوان. وله أيضاً عدد من الدراسات والأبحاث، منها:\n\nتحقيق ديوان ديك الجن بالاشتراك، 1960\nالرواد الأوائل للشعر في مدينة حمص، سنة 1969\nمن كتبه :\n\nإعراب القرآن وبيانه\nوله مقالات."
    ],
    "image": "https://i.ibb.co/q9Q3qFh/image.webp"
  },
  {
    "_id": "667dc17e7d866f035c07d61c",
    "name": [
      "শায়খ ড. মুহাম্মাদ আলী আস-সাবুনি (রাহ)",
      "Sheikh Dr. Muhammad Ali As-Sabuni (RA)",
      "الشيخ د. محمد علي الصابوني"
    ],
    "desc": [
      "শায়খ ড. মুহাম্মাদ আলী আস-সাবুনি (রাহ) ১৯৩০ সালে সিরিয়ার ঐতিহাসিক আলেপ্পো শহরে জন্মগ্রহণ করেন, তাঁর পিতা ছিলেন সে যুগে সিরিয়ার শীর্ষস্থানীয় আলিম শায়খ জামিল সাবুনী। ইসলামি ঐতিহ্যবাহী পরিবারে জন্মগ্রহণের সুবাদে আলিম পিতার নিকটই তাঁর লেখাপড়া শুরু হয়। শৈশবে স্থানীয় মক্তবে পবিত্র কুরআন মাজীদ হিফয করেন। স্থানীয় শিক্ষাপ্রতিষ্ঠান থেকে মাধ্যমিক ও উচ্চমাধ্যমিক পর্যায়ের শিক্ষা অর্জনের পাশাপাশি সিরিয়ার বিখ্যাত আলিমগণের নিকট থেকে তিনি ধর্মীয় শিক্ষা ও সনদ অর্জন করেন। এরপর সিরিয়ার ধর্মমন্ত্রণালয় উচ্চশিক্ষা অর্জনের জন্য তাঁকে মিসরের আল আযহার বিশ্ববিদ্যালয়ে প্রেরণ করে। আল আযহারের শরীআহ অনুষদ থেকে ১৯৫২ সালে স্নাতক সম্পন্ন করেন, এবং ১৯৫৪ সালে আল কাদ্বা আশ শারঈ বিষয়ে উচ্চতর ডিগ্রি লাভ করেন।\n\nউচ্চশিক্ষা অর্জন শেষে সাবুনী সিরিয়ায় ফিরে এসে ১৯৫৫ সালে শিক্ষকতায় আত্মনিয়োগ করেন। সত্তরের দশকে সৌদি আরবের বিশ্ববিদ্যালয়সমূহে বিশেষজ্ঞ শিক্ষক নিয়োগের প্রয়োজন দেখা দিলে সৌদি সরকার সিরিয়ার নিকট সহযোগিতা কামনা করে। ১৯৬২ সালে সৌদি সরকারের অনুরোধে সিরিয়ার শিক্ষা মন্ত্রণালয় মুহাম্মদ আলী আস সাবুনীকে সৌদিতে প্রেরণ করে। তিনি সেখানে মক্কা শরীফে অবস্থিত উম্মুল কুরা বিশ্ববিদ্যালয়ের শরীআহ অনুষদে প্রভাষক পদে যোগদান করেন, পাশাপাশি তিনি কিং আব্দুল আজিজ বিশ্ববিদ্যালয়ের শিক্ষা অনুষদেও শিক্ষকতা করেন। দীর্ঘ তিন দশক তিনি উম্মুল কুরায় শিক্ষকতা করেন,  এরপর রাবেতা আল-আলাম আল-ইসলামীর উপদেষ্টার দায়িত্ব পালন করেন। পবিত্র মক্কা মুকাররামায় অবস্থানকালে বিশ্ববিদ্যালয়ে শিক্ষকতা ও গবেষণা ছাড়াও তিনি সাধারণ মানুষের জন্য হারাম শরীফে প্রতিদিন তাফসীরের দারস প্রদান করতেন এবং জেদ্দার একটি মসজিদে সপ্তাহে একদিন দারস প্রদান করতেন। এছাড়া টেলিভিশনে প্রচারের জন্য তাঁর তাফসীরের দারস রেকর্ড করা হয়, এরকম প্রায় ছয় শতাধিক রেকর্ডিং রয়েছে। ২০০৭ সালে তিনি দুবাই ইন্টারন্যাশনাল কুরআন অ্যাওয়ার্ড কর্তৃক বর্ষসেরা ইসলামি ব্যক্তিত্ব মনোনীত হন।\n\nআল্লামা সাবুনী বিভিন্ন বিষয়ে অর্ধশতাধিক গ্রন্থ রচনা করেন। তবে তিনি সবচেয়ে বেশি খ্যাতি অর্জন করেন সাফওয়াতুত তাফাসীর নামক তাফসীর গ্রন্থের জন্য। আধুনিক যুগে রচিত সবচেয়ে জনপ্রিয় ও গ্রহণযোগ্য তাফসীরগ্রন্থসমূহের মধ্যে এটি অন্যতম। সহজবোধ্য ভাষা এ গ্রন্থটির জনপ্রিয়তার অন্যতম কারণ। তিনি এ গ্রন্থে পূর্ববর্তী সকল গুরুত্বপূর্ণ তাফসীরগ্রন্থের সারনির্যাস সাবলীল ভাষায় সাধারণ পাঠকদের উপযোগী করে উপস্থাপন করেন। এ গ্রন্থে তিনি কুরআন মাজীদের শাব্দিক বিশ্লেষণ, পূর্ববর্তী আয়াতের সাথে পরবর্তী আয়াতের প্রাসঙ্গিকতা, আয়াত অবতীর্ণ হওয়ার প্রেক্ষাপট, আয়াতের ব্যাখ্যা, আয়াতসমূহের অলঙ্কার বিশ্লেষণ, আয়াতের শিক্ষণীয় বিষয় ইত্যাদি সবকিছুই অন্তর্ভুক্ত করেন, কিন্তু এরপরও কিতাবটি সাধারণ পাঠকের জন্য একটুও কঠিন হয়নি। এছাড়া রাওয়াইউল বায়ান নামক তাঁর আরেকটি তাফসীরগ্রন্থ অত্যন্ত গ্রহণযোগ্যতা লাভ করেছে। বাংলাদেশের মাদরাসাসমূহেও এ গ্রন্থটি পাঠ্যপুস্তক হিসেবে রয়েছে।\n\nতার আরো দুটি অনবদ্য কীর্তি হলো উম্মুত তাফাসীর খ্যাত তাফসীর শাস্ত্রের আদিগ্রন্ত তাফসীরে তাবারী ও তাফসীরে ইবন কাসীরের সংক্ষিপ্ত সংস্করণ। তাফসীর শাস্ত্রের মৌলিক গ্রন্থ হিসেবে বিদগ্ধজনের নিকট এ দুটি কিতাব অত্যন্ত গুরুত্ব বহন করলেও রচনাশৈলীর কারণে সাধারণ পাঠকদের জন্য কিতাব দু’টি সহজপাঠ্য নয়। ফলে বিভিন্ন সময়ে বিভিন্ন ব্যক্তি এসকল কিতাবের সংক্ষিপ্ত সংস্করণ রচনা করেছেন। তবে আহলুস সুন্নাত ওয়াল জামাআতের আকীদা অনুসারে আল্লামা সাবুনীর লেখা সংক্ষিপ্ত সংস্করণই সবচেয়ে বেশি গ্রহণযোগ্যতা অর্জন করেছে। তিনি তাবারী ও ইবনে কাসীরের রচিত তাফসীরের সনদসমূহ সংক্ষিপ্ত করেন, যাতে সাধারণ মানুষ পাঠের আগ্রহ ধরে রাখতে সক্ষম হয়। এছাড়া ভাষাগত জটিলতা দূর করে মূল কিতাবের কঠিন ইবারতকে সহজ ও সংক্ষিপ্ত আকারে তুলে ধরেন।\n\nআল্লামা সাবুনী তাঁর প্রতিটি তাফসীর গ্রন্থে আহলুস সুন্নাহ তথা আশআরী-মাতুরীদী ধারার আকীদা অনুসরণ করেছেন। এসকল তাফসীরকে কেন্দ্র করে নজদী মতবাদের অনুসারী (কথিত সালাফী) শীর্ষস্থানীয় শায়খদের সাথে তাঁর চরম মতবিরোধ দেখা দেয়। নজদী ধারার শীর্ষস্থানীয় শায়খ সৌদী গ্র্যান্ড মুফতী ইবন বায, শায়খ আলবানীসহ আরো অনেকেই আল্লামা সাবুনীর বিরুদ্ধে ফতওয়া প্রদান ও বই রচনা করেন। এমনকি গ্র্যান্ড মুফতী ইবন বাযের প্রচেষ্টায় সৌদিতে তাঁর লেখা জগদ্বিখ্যাত মকবুল তাফসীরের কিতাব সাফওয়াতুত তাফাসীর নিষিদ্ধও হয়েছিল। আশআরী-মাতুরীদী আকীদার পক্ষাবলম্বনের কারণে সৌদি আরবে আল্লামা সাবুনী বিভিন্ন রকমের সমস্যায় পড়েন। এসব কারণে তিনি সৌদি থেকে তুরস্কে চলে যান, এবং সেখানেই শেষ জীবন অতিবাহিত করেন। তুরস্কে অবস্থানরত আরেক সিরীয় অধ্যাপক ড. আব্দুল কাদের আল হুসাইনের বর্ণনামতে, আল্লামা সাবুনী তুরস্কের প্রখ্যাত নবশবন্দী তরীকার বুযুর্গ শায়খ মাহমুদ এফেন্দী (রহ.) এর নিকট থেকে তরীকতের জ্ঞান অর্জন করেন।\n\nআহলুস সুন্নাত ওয়াল জামাআতের এই মহান মুফাসসির গত মার্চ মাসের ১৯ তারিখ তুরস্কের ইয়ালোভা শহরে ৯১ বছর বয়সে ইন্তিকাল করেন। তাঁর ইন্তিকালে সমগ্র মুসলিম জাহানে শোকের ছায়া নেমে আসে।",
      "Sheikh Dr. Muhammad Ali As-Sabuni (RA) was born in 1930 in the historic city of Aleppo, Syria, to his father Shaykh Jamil Sabuni, the leading Syrian alim of that era. Being born in a traditional Islamic family, he started his studies with his scholar father. As a child, Majid memorized the Holy Quran in the local school. In addition to obtaining secondary and higher secondary education from local educational institutions, he received religious education and certification from famous Syrian scholars. Then the Syrian Ministry of Religion sent him to Al Azhar University in Egypt to pursue higher education. Graduated from Al Azhar's Faculty of Shari'ah in 1952, and received a higher degree in Al Qadwa Ash Shari'i in 1954.\n\nAfter completing his higher education, Sabuni returned to Syria and engaged in teaching in 1955. In the 1970s, when Saudi Arabia's universities needed to recruit specialist teachers, the Saudi government sought cooperation from Syria. In 1962, at the request of the Saudi government, the Syrian Ministry of Education sent Muhammad Ali As Sabuni to Saudi Arabia. He joined the Faculty of Shari'ah at Umm al-Qura University in Makkah Sharif, and also taught at the Faculty of Education at King Abdulaziz University. He taught at Umm al-Qura for three long decades, then served as advisor to Rabita al-Alam al-Islami. In addition to teaching and researching at the university during his stay in the holy Makkah Mukarramah, he gave a daily Dars of Tafsir for the common people in the Haram Sharif and one Dars a week in a mosque in Jeddah. Besides, his tafseer dars were recorded for telecast, there are about six hundred such recordings. In 2007, he was named Islamic Personality of the Year by the Dubai International Quran Awards.\n\nAllama Sabuni wrote more than half a hundred books on various subjects. But he is most famous for his book of tafsir called Safwatut Tafsir. It is one of the most popular and accepted commentaries written in modern times. The simple language is one of the reasons for the popularity of this book. In this book, he presents the summary of all the important previous tafseers in a simple language suitable for common readers. In this book, he includes the textual analysis of the Qur'an, the relevance of the previous verse to the next verse, the context of the revelation of the verse, the explanation of the verse, the analysis of the ornament of the verse, the teaching of the verse, etc., but still the book is not at all difficult for the common reader. Besides, another book of his commentary called Rawaiul Bayan has gained great acceptance. This book is also available as a textbook in Madrasahs of Bangladesh.\n\nTwo other outstanding works of his are the abbreviated version of Tafsir Tabari and Tafsir Ibn Qasir, the famous Tafsir texts of Ummut Tafasi. Although these two books are very important to scholars as the basic books of Tafseer Shastra, but due to the writing style, the two books are not easy to read for ordinary readers. As a result, different people have written abridged versions of these books at different times. However, according to the creed of Ahlus Sunnat wal Jama'at, the abbreviated version written by Allama Sabuni has gained the most acceptance. He abridged the sanads of Tafsir written by Tabari and Ibn Kathir, so that the common man could retain interest in the reading. In addition, he removed the linguistic complexity and presented the difficult sentences of the original book in a simple and concise form.\n\nAllama Sabuni followed the Aqeedah of Ahlus Sunnah i.e. Ash'ari-Maturidi school in each of his Tafseer books. Over these tafsirs he was at odds with the leading Shaykhs of the Najdi school of thought (so-called Salafis). Shaykh Saudi Grand Mufti Ibn Baz, Shaykh Albani and many others issued fatwas and wrote books against Allama Sabuni. Even through the efforts of Grand Mufti Ibn Baz, his world-famous Maqbul Tafseer book Safwatut Tafasi was banned in Saudi Arabia. Allama Sabuni faced various problems in Saudi Arabia due to his bias towards Ash'ari-Maturidi creed. For these reasons he left Saudi Arabia for Turkey, and spent his last life there. Another Syrian professor in Turkey. According to Abdul Qader al-Husayn, Allama Sabuni acquired the knowledge of the Tariqa from Sheikh Mahmud Effendi (R.A.), the founder of the famous Navashbandi Tariqa in Turkey.\n\nThis great Mufassir of Ahlus Sunnat Wal Jamaat passed away at the age of 91 on March 19 in Yalova, Turkey. After his death, the entire Muslim world fell into mourning.",
      "ولد الشيخ الدكتور محمد علي الصابوني (رضي الله عنه) عام 1930 في مدينة حلب التاريخية في سوريا لوالده الشيخ جميل الصابوني، أحد كبار علماء سوريا في تلك الحقبة. ولد في عائلة إسلامية تقليدية، وبدأ دراسته مع والده العالم. عندما كان طفلاً، حفظ ماجد القرآن الكريم في المدرسة المحلية. بالإضافة إلى حصوله على التعليم الثانوي والعالي من المؤسسات التعليمية المحلية، حصل على التعليم الديني والشهادة من علماء سوريين مشهورين. ثم أرسلته وزارة الديانة السورية إلى جامعة الأزهر في مصر لمتابعة تعليمه العالي. تخرج في كلية الشريعة بالأزهر عام 1952، وحصل على الشهادة العليا في القدوة الشرعية عام 1954.\n\nبعد أن أكمل تعليمه العالي، عاد الصابوني إلى سوريا وانخرط في التدريس في عام 1955. وفي السبعينيات، عندما احتاجت جامعات المملكة العربية السعودية إلى توظيف معلمين متخصصين، طلبت الحكومة السعودية التعاون من سوريا. وفي عام 1962، وبناءً على طلب الحكومة السعودية، أرسلت وزارة التربية السورية محمد علي الصابوني إلى المملكة العربية السعودية. التحق بكلية الشريعة بجامعة أم القرى بمكة المكرمة، كما قام بالتدريس في كلية التربية بجامعة الملك عبد العزيز. درّس في أم القرى لمدة ثلاثة عقود طويلة، ثم عمل مستشاراً لرابطة العالم الإسلامي. بالإضافة إلى التدريس والبحث في الجامعة أثناء إقامته في مكة المكرمة، كان يعطي درسًا يوميًا في التفسير لعامة الناس في الحرم الشريف ودرسًا واحدًا في الأسبوع في أحد مساجد جدة. بالإضافة إلى أن دروس تفسيره مسجلة للبث التلفزيوني، وهناك حوالي ستمائة تسجيل من هذا النوع. وفي عام 2007، حصل على لقب الشخصية الإسلامية لهذا العام من قبل جوائز دبي الدولية للقرآن.\n\nكتب العلامة الصابوني أكثر من نصف مائة كتاب في مواضيع مختلفة. لكنه اشتهر بكتابه في التفسير المسمى صفوت التفسير. إنه أحد التعليقات الأكثر شعبية وقبولاً المكتوبة في العصر الحديث. اللغة البسيطة هي أحد أسباب شعبية هذا الكتاب. ويعرض في هذا الكتاب خلاصة جميع التفاسير السابقة المهمة بلغة بسيطة تناسب عامة القراء. ويشتمل هذا الكتاب على تحليل نص القرآن، وتناسب الآية السابقة مع الآية التي تليها، وسياق نزول الآية، وشرح الآية، وتحليل زخرفة الآية، تدريس الآية، وما إلى ذلك، ولكن لا يزال الكتاب ليس صعبا على الإطلاق بالنسبة للقارئ العادي. علاوة على ذلك، فقد حظي كتاب آخر من تعليقاته يسمى راوايول بيان بقبول كبير. هذا الكتاب متاح أيضًا ككتاب مدرسي في المدارس الدينية في بنغلاديش.\n\nوهناك عملان بارزان آخران له هما النسخة المختصرة من تفسير الطبري وتفسير ابن قصير، نصوص التفسير الشهيرة لأموت تفاسي. على الرغم من أن هذين الكتابين مهمان جدًا للعلماء مثل الكتب الأساسية لتفسير شاسترا، إلا أنه نظرًا لأسلوب الكتابة، فإن الكتابين ليس من السهل قراءتهما للقراء العاديين. ونتيجة لذلك، كتب أشخاص مختلفون نسخًا مختصرة من هذه الكتب في أوقات مختلفة. ومع ذلك، ووفقاً لعقيدة أهل السنة والجماعة، فقد نالت النسخة المختصرة التي كتبها العلامة الصابوني أكبر قدر من القبول. وقد اختصر طرق التفسير التي كتبها الطبري وابن كثير، حتى يظل العامي مهتما بالقراءة. بالإضافة إلى ذلك، قام بإزالة التعقيد اللغوي وعرض الجمل الصعبة للكتاب الأصلي بشكل بسيط ومختصر.\n\nاتبع العلامة الصابوني عقيدة أهل السنة أي المدرسة الأشعرية الماتريدية في كل كتاب من كتبه التفسيرية. وكان على خلاف حول هذه التفسيرات مع كبار مشايخ المذهب النجدي (المسمين بالسلفيين). أصدر الشيخ المفتي العام السعودي ابن باز والشيخ الألباني وغيرهم فتاوى وكتبوا كتبًا ضد العلامة الصابوني. وحتى من خلال جهود المفتي الأكبر ابن باز، تم حظر كتابه الشهير مقبول التفسير صفوت الطفاسي في المملكة العربية السعودية. واجه العلامة الصابوني مشاكل مختلفة في المملكة العربية السعودية بسبب انحيازه للعقيدة الأشعرية الماتريدية. ولهذه الأسباب غادر السعودية إلى تركيا، وقضى آخر حياته هناك. أستاذ سوري آخر في تركيا. وبحسب عبد القادر الحسين، فإن العلامة الصابوني حصل على معرفة الطريقة من الشيخ محمود أفندي (رضي الله عنه)، مؤسس الطريقة النفاشبندية الشهيرة في تركيا.\n\nتوفي هذا المفسر العظيم لأهل السنة والجماعة عن عمر يناهز 91 عامًا في 19 مارس في يالوفا بتركيا. وبعد وفاته، دخل العالم الإسلامي بأكمله في حالة حداد."
    ],
    "image": "https://i.ibb.co/TwrmWDc/image.jpg"
  },
  {
    "_id": "667dc18c7d866f035c07d61d",
    "name": [
      " আবু আত-তৈয়েব মুতানাব্বি",
      "Abu At-Tayyib Mutanabbi",
      " أبو الطيب المتنبي"
    ],
    "desc": [
      "আবু আল-তৈয়্যিব আহমদ বিন আল-হুসাইন আল-জাফি আল-কিন্দি আল-কুফি, যিনি আল-মুতানাব্বি নামে পরিচিত  (৩০৩ হি - ৩৫৪ হি) (৯১৫ খ্রিস্টাব্দ - ৯৬৫ খ্রিস্টাব্দ) । তার যুগে তার  সম মর্যাদায় অন্য কোন কবি পৌঁছাতে পারে নি। তিনি ছিলেন আরবী সাহিত্যের বিষ্ময় এক প্রতিভা । তার কবিতা আজও কবি এবং লেখকদের জন্য অনুপ্রেরণা এবং অনুপ্রেরণার উত্স হিসাবে রয়ে গেছে। তিনি ছিলেন আরবী সাহিত্যের একজন বিদগ্ধ  কবি । তার বেশিরভাগ কবিতাই নিজেকে ও রাজাদের প্রশংসাকে কেন্দ্র করে রচিত। তিনি  বালক বয়সেই কাবিতা লেখা শুরু করেছিলেন ।মাত্র ৯ বছর বয়সে তার প্রথম কবিতা রচিত হয়। তিনি তার তীক্ষ্ণ বুদ্ধিমত্তা এবং অধ্যবসায়ের জন্য বিখ্যাত ছিলেন এবং তার কাব্য প্রতিভা  যৌবনে শুরুতেই প্রকাশ পেয়েছিল।",
      "Abu Al-Tayyib Ahmad bin Al-Hussein Al-Jaafi Al-Kindi Al-Kufi, known as Al-Mutanabbi and nicknamed the Poet of the Arabs (303 AH - 354 AH) (915 AD - 965 AD); He has a lofty status that was not available to other Arab poets after Islam. He is described as a rarity of his time and a marvel of his time, and his poetry remains to this day a source of inspiration and inspiration for poets and writers. He is a wise poet, and one of the glories of Arabic literature. Most of his poems revolve around himself and praising kings. He wrote poetry as a boy, and composed his first poems when he was 9 years old. He was famous for his sharp intelligence and diligence, and his poetic talent appeared early.\n\n",
      "أَبُو اَلطَّيِّبْ أَحْمَدْ بْنْ اَلْحُسَيْنْ اَلْجَعْفِي اَلْكَنَدِيَّ اَلْكُوفِيِّ المعروف بِالْمُتَنَبِّي والمُلقب بِشَاعِرِ اَلْعَرَبِ (303هـ - 354هـ) (915م - 965م)؛ له مكانة سامية لم تُتح مثلها لغيره من شعراء العرب بعد الإسلام، فيوصف بأنه نادرة زمانه، وأعجوبة عصره، وظل شعره إلى اليوم مصدر إلهام ووحي للشعراء والأدباء. وهو شاعر حكيم، وأحد مفاخر الأدب العربي. وتدور معظم قصائده حول نفسه ومدح الملوك. ولقد قال الشعر صبيًا، فنظم أول أشعاره وعمره 9 سنوات، واشتُهِرَ بحدة الذكاء واجتهاده وظهرت موهبته الشعرية مبكرًا.\n\n"
    ],
    "image": "https://i.ibb.co/gSdhVvZ/Al-Mutanabbi-by-Khalil-Gibran.png"
  },
  {
    "_id": "667dc1967d866f035c07d61e",
    "name": [
      "ইবনে হাজার আল-আসকালানী (রহ:)",
      "Ibn Hajar al-Asqalani (RA)",
      "ابن حضر العسقلاني "
    ],
    "desc": [
      "অসাধারণ এক জগৎ বরেণ্য আলেম। মারজা আল-উলামা উপাধিতে ভুষিত আহমদ বিন আলী বিন মুহাম্মাদ যিনি ইবনে হাজার আসকালানী নামে সুপরিচিতি। তিনি ইলমে হাদিসের একজন প্রখ্যাত মুহাদ্দিস এবং বিখ্যাত হাদিস গ্রন্থ বুখারির ব্যাখ্যা গ্রন্থ ‘ফাতহুল বারীর প্রণেতা। যা প্রণয়নে তাঁর সময় ব্যয় হয়েছিল ৩০। একাধারে তিনি ছিলেন হাফেজ, মুহাদ্দিস, মুফতি এবং কায়রোর প্রধান বিচারপতি। আজ তার সংক্ষিপ্ত পরিচয় তুলে ধরা হলো-\n\nনাম ও পরিচয়-\nতাঁর আসল নাম আহমদ। বিভিন্ন তর্থে প্রাপ্ত নাম হলো আহমদ বিন আলী বিন মুহাম্মদ। উপনাম আবুল ফজল। মারজা আল-উলামা, শিহাবুদ্দীন, হাফিজ হলো তাঁর উপাধি। মূলত তিউনিসিয়ার অন্তর্গত কাবেস এলাকার অধিবাসী ছিল তাঁর পরিবার। পরবর্তী সময়ে ফিলিস্তিনের অন্তর্গত আসকালান নামক স্থানে তারা বসতি গড়ে। আসকালানের অধিবাসী ছিল বলে তাকে আসকালানী বলা হয়।\n\nজন্ম ও শৈশব-\nইবনে হাজার আসকালানী ১৮ ফেব্রুয়ারি, ১৩৭২ খ্রিষ্টাব্দে মিশরের কায়রোতে জন্মগ্রহণ করেন। তাঁর বাবা নুরুদ্দিন আলী ছিলেন বিখ্যাত ফকিহ এবং কবি  ছিলেন। শৈশবেই তিনি পিতা-মাতা উভয়কেই হারান। তাঁর মামার তত্ত্বাবধানে তিনি কুরআন শিক্ষা লাভ করেন। প্রখর মেধার অধিকারী ইবনে হাজার আসকালানী শৈশবে অল্প দিনের মধ্যে কুরআনসহ বেশ কিছু গ্রন্থ মুখস্ত করেন।\n\nকর্মজীবন-\nতিনি কায়রোর আমর ইবনে আস এবং আল আযহার মসজিদের খতিব ছিলেন। খতিব থাকাকালীন সময়ে তিনি এক হাজারেরও বেশি খুতবা প্রদান করেন। এ জগৎ বরেণ্য আলেম ১৫০ এর অধিক গ্রন্থ রচনা করেন। ৩০ বছরের পরিশ্রমে বুখারির ব্যখ্যাগন্থ ‘ফতহুল বারী’ ১২ খণ্ডে সমাপ্ত করেন। ৮২৭ হিজরি সন থেকে তিনি ২১ বছর কায়রোর প্রধান বিচারপতি হিসেবে দায়িত্ব পালন করেন।\n\nমৃত্যু-\nএ মহামনীষী ৮ জিলহজ্জ ৮৫২ হিজরি মোতাবেক ১৩ ফেব্রুয়ারি ১৪৪৮ মতান্তরে ১৪৪৯ খ্রিস্টাব্দে ইন্তেকাল করেন। আল্লাহ তাআলা আল্লামা ইবনে হাজার আসকালানীকে জান্নাতের উচ্চ মাকাম দান করুন এবং তাঁর রূহানি ফয়েজ এবং বরকত মুসলিম উম্মাহকে দান করুন। আমিন।",
      "An extraordinary world elite scholars. Ahmad bin Ali bin Muhammad, also known as Ibn Hajar Asqalani, with the title of Marja al-Ulama. He is a renowned Muhaddith of Ilme Hadith and the author of the famous Hadith book Fathul Bari, a commentary on Bukhari. which took his time to prepare 30. He was a Hafez, Muhaddis, Mufti and Chief Justice of Cairo. Today, his brief introduction is presented-\n\nName and Identity-\nHis real name is Ahmad. The name obtained in different ways is Ahmad bin Ali bin Muhammad. Surname Abul Fazal. Marja al-Ulama, Shihabuddin, Hafiz are his titles. His family originally belonged to Kabes area of Tunisia. Later, they settled in a place called Askalan in Palestine. He was called Askalani because he was a native of Askalan.\n\nBirth and Childhood-\nIbn Hajar Asqalani was born on February 18, 1372 in Cairo, Egypt. His father Nuruddin Ali was a famous jurist and poet. He lost both his parents in childhood. He studied the Quran under the supervision of his uncle. Ibn Hajar Asqalani, who possessed a keen intellect, memorized several books including the Qur'an in a short period of time as a child.\n\ncareer-\nHe was the Khatib of Amr Ibn As and Al Azhar Mosque in Cairo. He delivered more than a thousand sermons during his tenure as Khatib. This world renowned scholar wrote more than 150 books. After 30 years of hard work, Bukhari's commentary 'Fathul Bari' was completed in 12 volumes. He served as the Chief Justice of Cairo for 21 years from 827 AH.\n\ndeath-\nThis great sage passed away on 13 February 1448 or 1449 AD according to 8 Zilhajj 852 Hijri. May Allah Ta'ala grant Allama Ibn Hajar Askalani the highest position in Jannah and bestow his spiritual blessings and blessings on the Muslim Ummah. Amen.",
      "نخبة من العلماء العالميين الاستثنائيين. أحمد بن علي بن محمد، المعروف بابن حجر العسقلاني، بلقب مرجع العلماء. وهو محدث مشهور في علم الحديث ومؤلف كتاب الحديث الشهير فتح الباري، وهو تعليق على البخاري. الذي استغرق وقته في إعداده 30. كان حافظًا ومحدثيًا ومفتيًا ورئيسًا لقضاة القاهرة. اليوم، يتم تقديم مقدمة مختصرة له-\n\nالاسم والهوية-\nاسمه الحقيقي أحمد. الاسم الذي تم الحصول عليه بطرق مختلفة هو أحمد بن علي بن محمد. اللقب أبو الفضل. مرجع العلماء، شهاب الدين، حافظ هي ألقابه. تنتمي عائلته في الأصل إلى منطقة قابس بتونس. وبعد ذلك استقروا في مكان يسمى عسقلان في فلسطين. وسمي بالعسقلاني لأنه من أهل عسقلان.\n\nالولادة والطفولة-\nولد ابن حجر العسقلاني في 18 فبراير 1372 في القاهرة بمصر. كان والده نور الدين علي فقيهًا وشاعرًا مشهورًا. لقد فقد والديه في مرحلة الطفولة. درس القرآن على يد عمه. كان ابن حجر العسقلاني ذا ذكاء حاد، وقد حفظ عدة كتب من بينها القرآن الكريم في فترة قصيرة عندما كان طفلا.\n\nحياة مهنية-\nكان خطيب عمرو بن العاص والجامع الأزهر بالقاهرة. ألقى أكثر من ألف خطبة خلال فترة عمله بالخطيب. كتب هذا العالم الشهير أكثر من 150 كتابًا. وبعد ثلاثين عاما من العمل الشاق، تم الانتهاء من شرح البخاري \"فتح الباري\" في 12 مجلدا. شغل منصب رئيس قضاء القاهرة لمدة 21 سنة من سنة 827 هجرية.\n\nموت-\nتوفي هذا الحكيم الجليل في 13 فبراير 1448 أو 1449 م الموافق 8 ذي الحجة 852 هجرية. نسأل الله تعالى أن يرفع العلامة ابن حجر العسقلاني أعلى مقامه في الجنة وأن يمن على الأمة الإسلامية ببركاته وبركاته. آمين."
    ],
    "image": "https://i.ibb.co/CVz07sk/islamic-man.jpg"
  },
  {
    "_id": "667dc19d7d866f035c07d61f",
    "name": [
      "আল্লামা কাজি নাসিরুদ্দিন বায়যাবি (রাহ)",
      "Allama Kazi Nasiruddin Bayazabi (RA)",
      "العلامة كازي ناصر الدين بيضاوي (رضي الله عنه)"
    ],
    "desc": [
      "আল্লামা কাজি নাসিরুদ্দিন বায়যাবি রাহ. (মৃ. ৬৯১ হি.) ছিলেন একজন প্রখ্যাত পণ্ডিত আলেম। বিশেষত কোরআনের তাফসির বিষয়ে তাঁর ছিল অগাধ পাণ্ডিত্য। তাফসির বিষয়ে তিনি অত্যন্ত মূল্যবান একটি গ্রন্থ রচনা করেছেন। গ্রন্থটির মূল নাম  ‘আনওয়ারুত তানযিল ওয়া আসরারুত তা’ওয়িল’ হলেও ‘তাফসিরে বায়যাবি’ হিসেবে সমধিক পরিচিত। কী আরব! কী অনারব! সর্বত্র তাঁর এই গ্রন্থটি সমানভাবে আদৃত। বিশ্বের বহু নামকরা শিক্ষাবোর্ড ও শিক্ষাপ্রতিষ্ঠানে এটি সিলেবাসভুক্ত।\n\nতাফসিরে বায়যাবির এই ঈর্ষণীয় গ্রহণযোগ্যতার পিছনে একটি চমৎকার গল্প আছে। আল্লামা বায়যাবি রাহ. যখন তদীয় জগদ্বিখ্যাত এ তাফসিরগ্রন্থটি লিখে শেষ করলেন, ওটা নিয়ে তিনি বাগদাদে তখনকার বাদশাহের নিকট তা পেশ করার জন্যে যেতে মনস্থ করলেন। ইচ্ছে ছিল, বাদশাহ থেকে কোনো উপঢৌকন মিলতে পারে; যার দ্বারা তিনি পার্থিব কিছু (আর্থিক) সমস্যা সমাধানে সচেষ্ট হবেন।\n\nযাওয়ার পথে একটা গ্রাম দিয়ে অতিক্রম করছিলেন, সেখানে একজন শায়খ ছিলেন। তিনি শায়খের নিকট থামলেন। শায়খ তাঁর মেহমানদারি করলেন। জিজ্ঞেস করলেন, কোথায় রওয়ানা? বায়যাবি উত্তর দিলেন, বাগদাদে। তিনি আবার প্রশ্ন করলেন, সেখানে কেন? উত্তরে বায়যাবি বললেন, আমি একটা তাফসিরগ্রন্থ রচনা করেছি। সেটা সংশোধন ও পরিমার্জনে আমি প্রচুর শ্রম দিয়েছি। আমার ক’জন মেয়ে আছে। ওরা বিয়ের উপযুক্ত। ওদের বিয়ের সার্বিক ব্যবস্থা গ্রহণ করতে আমার কিছু অর্থ-কড়ির প্রয়োজন আছে, অথচ আমার কোনো সম্পদ নেই। তো আমার মনে হলো, বাদশাহর নিকট যাই। তিনি হয়তো আমার সমস্যার সমাধান করতে এগিয়ে আসবেন এবং আমি মেয়েদের বিবাহের ব্যবস্থা করতে সক্ষম হবো।\n\nওই শায়খ তখন জিজ্ঞেস করলেন, আচ্ছা! আপনি কুরআনের এ আয়াতের কী ব্যাখ্যা করেছেন? আমরা একমাত্র তোমারই ইবাদত করি এবং শুধুমাত্র তোমারই সাহায্য প্রার্থনা করি। ( সূরা আল ফাতিহা: ৫) বায়যাবি বললেন, আমি আয়াতটির তাফসির করেছি এভাবে যে, আমরা আল্লাহ ছাড়া আর কারো ইবাদত করি না এবং তিনি ছাড়া আর কারো নিকট সাহায্য প্রার্থনা করি না।\n\nশায়খ বললেন, তবে আপনি কেন আল্লাহ ব্যতীত অন্য কারো সাহায্য চাইতে যাচ্ছেন?! শায়খের কথাগুলো আল্লামা বায়যাবি রাহ. এর হৃদয়ে রেখাপাত করল। তিনি বিষয়টা বুঝতে পারলেন। সেখান থেকেই তিনি ফিরে এলেন।\n\nবাগদাদে গেলেন না।\n\nউলামায়ে কেরাম বলেন, ইমাম বায়যাবি রাহ. এর এমন ত্যাগের কারণেই আল্লাহ তায়ালা তাঁর রচিত তাফসিরগ্রন্থের এত ব্যাপক গ্রহণযোগ্যতা দান করেছেন। তাঁর জীবদ্দশা এবং মৃত্যুর পর সর্বযুগে আলিমগণ এ গ্রন্থ আঁকড়ে ধরেছেন। বিভিন্নভাবে ওই গ্রন্থের ওপর কাজ করেছেন, টীকা-টিপ্পনী লিখেছেন, ব্যাখাগ্রন্থ রচনা করেছেন। আজ অবধি গ্রন্থটি দ্বারা কত মানুষ উপকৃত হচ্ছে! আল্লাহ আমাদের এই ঘটনা থেকে শিক্ষা নেওয়ার তৌফিক দান করুন। আমীন।",
      " Kazi Nasiruddin Bayazabi Rah. (d. 691 AH) was a renowned scholar. He had great erudition especially in the Tafseer of the Qur'an. He wrote a very valuable book on tafsee. Although the original name of the book is 'Anwarut Tanzil wa Asrarut Ta'weel', it is more commonly known as 'Tafsir Bayzabi'. What Arab! What an Arab! His book is equally loved everywhere. It is included in the syllabus in many reputed educational boards and educational institutions of the world.\n\nThere is a wonderful story behind this enviable acceptance of Bayazabi in Tafsir. Allama Bayzabi Rah. When he finished writing this world-famous commentary, he decided to go to Baghdad to present it to the then king. It was desired that a gift could be received from the king; By which he will try to solve some worldly (financial) problems.\n\nOn the way he was passing through a village, there was a shaykh. He stopped near the Shaykh. The Shaykh entertained him. He asked, where to go? Bayazabi replied, in Baghdad. He asked again, why there? Bayazabi replied, I have written a book of tafsir. I have put a lot of effort into correcting and refining it. I have several daughters. They are suitable for marriage. I need some money to take care of their wedding arrangements, but I don't have any wealth. So I thought, go to the king. He may come forward to solve my problem and I will be able to arrange marriage of girls.\n\nThe sheikh then asked, well! What do you interpret this verse of the Quran? You alone we worship and You alone we seek help. (Surah Al Fatiha: 5) Bayzabi said, I have interpreted the verse in such a way that we do not worship anyone except Allah and we do not seek help from anyone except Him.\n\nShaykh said, But why are you going to seek help from someone other than Allah?! The words of Shaykh Allama Bayzabi rah. It struck a chord in its heart. He understood that. He returned from there.\n\nHe did not go to Baghdad.\n\nUlamae Keram said, Imam Bayzabi Rah. It is because of this sacrifice that Allah Ta'ala has given such wide acceptance to his written commentary. During his lifetime and after his death, scholars throughout the ages have grasped this book. Worked on that book in various ways, wrote annotations, wrote textbooks. How many people are benefiting from the book till today! May Allah help us to learn from this incident. amen",
      "العلامة كازي نصير الدين بيضاوي راه. (ت 691هـ) كان عالما مشهورا. وكان واسع الاطلاع، خاصة في تفسير القرآن. وقد ألف كتابا قيما جدا في التفسير. على الرغم من أن الاسم الأصلي للكتاب هو \"أنوار تنزيل وأسرار تأويل\"، إلا أنه معروف أكثر باسم \"تفسير بيزابي\". اي عربي! يا له من عربي! كتابه محبوب بنفس القدر في كل مكان. يتم تضمينه في المنهج الدراسي للعديد من المجالس التعليمية والمؤسسات التعليمية المرموقة في العالم.\n\nهناك قصة رائعة وراء هذا القبول الذي يحسد عليه البيازابي في التفسير. العلامة بايزبي راه. وعندما انتهى من كتابة هذا التعليق المشهور عالميًا، قرر الذهاب إلى بغداد لتقديمه إلى الملك آنذاك. كان من المرغوب فيه الحصول على هدية من الملك؛ والذي سيحاول من خلاله حل بعض المشاكل الدنيوية (المالية).\n\nوفي طريقه كان يمر بقرية، وكان هناك شيخ. ووقف عند الشيخ. وكان الشيخ يسليه. وسأل إلى أين أذهب؟ أجاب البيازابي في بغداد. فسأل مرة أخرى لماذا هناك؟ فأجاب البيازبي: لقد كتبت كتابا في التفسير. لقد بذلت الكثير من الجهد في تصحيحه وتحسينه. لدي عدة بنات. إنهم مناسبون للزواج. أحتاج إلى بعض المال للقيام بترتيبات زفافهما، لكن ليس لدي أي ثروة. لذلك فكرت، اذهب إلى الملك. قد يتقدم لحل مشكلتي وسأكون قادرًا على ترتيب زواج الفتيات.\n\nثم سأل الشيخ: حسنًا! ما تفسيرك لهذه الآية من القرآن؟ إياك وحدك نعبد وإياك وحدك نستعين. (سورة الفاتحة: 5) قال البيظابي: ففسرت الآية على أننا لا نعبد إلا الله ولا نستعين إلا به.\n\nقال الشيخ: ولكن لماذا تستعين بغير الله؟! أقوال الشيخ العلامة البيزبي. لمست قلبها. لقد فهم ذلك. عاد من هناك.\n\nولم يذهب إلى بغداد.\n\nقال علماء كرم، الإمام البيزبي راه. وبسبب هذه التضحية أعطى الله تعالى مثل هذا القبول الواسع لتعليقه المكتوب. وقد تناول هذا الكتاب العلماء في حياته وبعد وفاته. عملت على هذا الكتاب بطرق مختلفة، وكتبت التعليقات التوضيحية، وكتبت الكتب المدرسية. فكم من الناس يستفيدون من الكتاب حتى اليوم! نسأل الله أن نتعلم من هذه الحادثة. آمين\n"
    ],
    "image": "https://i.ibb.co/5LBdHRG/islamic-man.jpg"
  },
  {
    "_id": "667dc1a47d866f035c07d620",
    "name": [
      "শাহ্ ওয়ালিউল্লাহ মুহাদ্দিসে দেহলভী (রহ:)",
      "Shah Waliullah Muhaddith Dehlawi (RA)",
      "شاه ولي الله محدث الدهلوي (رض)"
    ],
    "desc": [
      "শাহ ওয়ালিউল্লাহ মুঘল সম্রাট আওরঙ্গজেবের মৃত্যুর চার বছর পূর্বে ১৭০৩ সালে জন্মগ্রহণ করেন। তার বংশলতিকা উমর ইবনুল খাত্তাবের পরিবার পর্যন্ত পৌছায়।দিল্লিতে তার পিতা শাহ আবদুর রহিম কর্তৃক প্রতিষ্ঠিত মাদ্রাসায় তিনি প্রাতিষ্ঠানিক শিক্ষা ও আধ্যাত্মিক দিকনির্দেশনা লাভ করেন। কুরআনের পাশাপাশি তিনি আরবি ও ফারসি ব্যাকরণ, সাহিত্য এবং উচ্চস্তরের দর্শন, ধর্মতত্ত্ব, অধিবিদ্যা, অতীন্দ্রিয়তা ও আইনশাস্ত্রের উপর পাঠ নেন। ১৫ বছর বয়সে তিনি এখান থেকে উত্তীর্ণ হন। একই বছর তার পিতা তাকে নকশবন্দিয়া তরিকায় পদার্পণ ঘটান। মাদ্রাসায়ে রহিমিয়াতে তিনি তার পিতার অধীনে শিক্ষক হিসেবে কর্মজীবন শুরু করেন। ১৭১৮ সালের শেষের দিকে পিতার মৃত্যুর পর তিনি মাদ্রাসার প্রধান হন এবং ১২ বছর যাবত শিক্ষার্থীদের শিক্ষাদান করেন। এ সময় তিনি তার নিজস্ব পড়াশোনা চালিয়ে যান। শিক্ষক হিসেবে তার সম্মান বৃদ্ধি পায় এবং শিক্ষার্থীরা তার প্রতি আকৃষ্ট হয়।\n\n১৭২৪ সালে তিনি হজ্জ পালনের জন্য হেজাজ গমন করেন। তিনি সেখানে আট বছর অবস্থান করেন এবং আবু তাহের বিন ইবরাহিম আল কুর্দি আল মাদানির মতো পণ্ডিতদের কাছ থেকে হাদিস ও ফিকহ শিক্ষালাভ করেন। এ সময় তিনি মুসলিম বিশ্বের সকল প্রান্তের লোকের সংস্পর্শে আসেন এবং বিভিন্ন মুসলিম দেশের অবস্থা সম্পর্কে জানতে পারেন। এ সময় তিনি সাতচল্লিশটি আধ্যাত্মিক বিষয় দেখতে পান যা তার বিখ্যাত রচনা ফুয়ুদ আল হারামাইনের বিষয়বস্তু হয়ে দাঁড়ায়।\n\n১৭৩২ সালে তিনি দিল্লি ফিরে আসেন এবং ১৭৬২ সালে মৃত্যুর আগ পর্যন্ত জীবনের বাকি সময় সেখানে অতিবাহিত করেন ও লেখালেখি চালিয়ে যান। তার সবচেয়ে গুরুত্বপূর্ণ কাজ হলো হুজ্জাতুল বালিগা। অর্থনৈতিক, রাজনৈতিক, সামাজিক, অধিবিদ্যাসহ সম্পূর্ণ ধর্মতাত্ত্বিক বিষয়েও তিনি লিখেছেন। ইসলামের প্রকৃত ও আদিরূপ বিষয়ে তিনি তার মতামত এসব লেখায় তুলে ধরেন।\n\nমারাঠা শাসন থেকে ভারতকে জয় করার জন্য তিনি আহমেদ শাহ দুররানির কাছে চিঠি লেখেন। তিনি আরবি থেকে ফারসিতে কুরআন অনুবাদ করেন যাতে মুসলিমরা কুরআনের শিক্ষা বুঝতে পারে।",
      "Shah Waliullah was born in 1703, four years before the death of Mughal Emperor Aurangzeb. His lineage goes back to the family of Umar Ibnul Khattab. He received formal education and spiritual guidance at the madrasa founded by his father Shah Abdur Rahim in Delhi. In addition to the Qur'an, he studied Arabic and Persian grammar, literature and advanced philosophy, theology, metaphysics, mysticism and jurisprudence. He passed out at the age of 15. The same year his father initiated him into the Naqshbandiyya Tariqa. He started his career as a teacher under his father at Madrasaya Rahimiya. After his father's death in late 1718, he became the head of the madrasa and taught the students for 12 years. During this time he continued his own studies. His respect as a teacher grew and students were drawn to him.\n\nIn 1724 he went to Hejaz to perform Hajj. He stayed there for eight years and learned hadith and fiqh from scholars such as Abu Taher bin Ibrahim al-Kurdi al-Madani. During this time he came in contact with people from all parts of the Muslim world and learned about the conditions of different Muslim countries. During this time he found forty-seven spiritual subjects which became the subject of his famous work Fuyud al Haramain.\n\nHe returned to Delhi in 1732 and spent the rest of his life there until his death in 1762, continuing to write. His most important work is Huzzatul Baliga. He also wrote on economic, political, social, metaphysical and complete theological subjects. In these writings, he expressed his views on the real and original nature of Islam.\n\nHe wrote to Ahmed Shah Durrani to win India from Maratha rule. He translated the Qur'an from Arabic to Persian so that Muslims could understand the teachings of the Qur'an.",
      "ولد شاه ولي الله عام 1703، أي قبل أربع سنوات من وفاة الإمبراطور المغولي أورنجزيب. ويعود نسبه إلى آل عمر بن الخطاب. تلقى تعليمًا رسميًا وإرشادًا روحيًا في المدرسة التي أسسها والده شاه عبد الرحيم في دلهي. بالإضافة إلى القرآن، درس قواعد اللغة العربية والفارسية والأدب والفلسفة المتقدمة واللاهوت والميتافيزيقا والتصوف والفقه. توفي وهو في الخامسة عشرة من عمره. وفي نفس العام أدخله والده إلى الطريقة النقشبندية. بدأ حياته المهنية كمدرس تحت والده في مدرسة الرحيمية. بعد وفاة والده في أواخر عام 1718، أصبح رئيسًا للمدرسة وقام بتدريس الطلاب لمدة 12 عامًا. خلال هذا الوقت واصل دراسته الخاصة. نما احترامه كمدرس وانجذب إليه الطلاب.\n\nفي عام 1724 ذهب إلى الحجاز لأداء فريضة الحج. وأقام بها ثماني سنين، أخذ الحديث والفقه على العلماء كأبي طاهر بن إبراهيم الكردي المدني. خلال هذا الوقت كان على اتصال مع أشخاص من جميع أنحاء العالم الإسلامي وتعرف على أحوال مختلف البلدان الإسلامية. خلال هذه الفترة وجد سبعة وأربعين موضوعًا روحيًا أصبح موضوعًا لكتابه الشهير فيود الحرمين.\n\nعاد إلى دلهي عام 1732 وقضى بقية حياته هناك حتى وفاته عام 1762، مواصلًا الكتابة. أهم أعماله هو Huzzatul Baliga. كما كتب في مواضيع اقتصادية وسياسية واجتماعية وميتافيزيقية وموضوعات لاهوتية كاملة. وأعرب في هذه الكتابات عن آرائه حول الطبيعة الحقيقية والأصيلة للإسلام.\n\nكتب إلى أحمد شاه دوراني لانتزاع الهند من حكم المراثا. قام بترجمة القرآن من العربية إلى الفارسية حتى يتمكن المسلمون من فهم تعاليم القرآن."
    ],
    "image": "https://i.ibb.co/w6yFfM4/image.jpg"
  },
  {
    "_id": "667dc1ab7d866f035c07d621",
    "name": [
      "আল্লামা আলী বিন সুলতান মুহাম্মাদ ক্বারী",
      "Allama Ali bin Sultan Muhammad Qari",
      "ملا علي قاري بن سلطان بن محمد الهروي"
    ],
    "desc": [
      "নাম:- আলী বিন সুলতান মুহাম্মদ। উপনাম- আবুল হাসান। উপাধি- নুরুদ্দীন। তিনি একাধারে ফিকাহবিদ, মুহাদ্দিস ও ক্বারী। বাসস্থানের বিবেচনা থেকে তাঁকে হারাবি ও মক্কী বলা হয়। তিনি ‘মোল্লা আলী ক্বারী’ নামে সুপরিচিত।\n\nতাঁকে ক্বারী উপাধি দেয়া হয়েছে; যেহেতু কুরআনের ভিন্ন ভিন্ন পঠনপদ্ধতি সম্পর্কে অভিজ্ঞ ছিলেন। খোরাসানের প্রধান শহর ‘হারাত’ এর বাসিন্দা হিসেবে তাঁকে ‘হারাবী’ বলা হয়। খোরাসান বর্তমানে আফগানিস্তানের অন্তর্ভুক্ত।\n\nতাঁকে মক্কী বলা হয় যেহেতু তিনি মক্কায় সফর করেছেন, মক্কার আলেমদের থেকে ইলম অর্জন করেছেন এবং মৃত্যু পর্যন্ত সেখানেই বসবাস করেছেন।\n\nতিনি ৯৩০ হিজরি সালের দিকে ‘হারাত’ শহরে জন্মগ্রহণ করেছেন। সেখানেই বড় হয়েছেন, ইলম অর্জন করেছেন, কুরআন শরিফ মুখস্থ করেছেন। তিনি শাইখ মঈন উদ্দীন বিন হাফেয যাইন উদ্দীন আল-হারাবী এর নিকট তাজবিদ শিক্ষা লাভ করেছেন। তিনি সমকালীন আলেমগণের নিকট ইলমে দ্বীন অর্জন করেছেন। এরপর তিনি মক্কায় চলে আসেন। মক্কাতে থেকে সেখানকার আলেমগণের নিকট দীর্ঘ মেয়াদে ইলমে দ্বীন অর্জন করেছেন। এভাবে ইলম অর্জনের মাধ্যমে মশহুর আলেমে পরিণত হন। তিনি হানাফি মাযহাবের আলেম ছিলেন। তার গ্রন্থাবলি ও জীবনী থেকে সেটাই জানা যায়। হানাফি মাযহাবের অনেক মাসয়ালা নিয়ে তিনি বিশ্লেষণ করেছেন এবং এ মাযহাবের পক্ষে দলিল প্রমাণ উপস্থাপন করেছেন।\n\nতিনি দ্বীনদার, তাকওয়াবান ও সুচরিত্রের অধিকারী হিসেবে পরিচিত ছিলেন। নিজ হাতে কাজ করে খেতেন। তিনি ছিলেন দুনিয়ার বিরাগী, আত্মমর্যাদা সম্পন্ন ও অল্পে তুষ্ট একজন ব্যক্তি।\n\nমানুষের সাথে কম মিশতেন। ইবাদত-বন্দেগীতে মশগুল থাকতেন। সুন্দর হস্তাক্ষরে প্রতি বছর একটি করে কুরআন শরিফ লিখতেন। লিখিত কুরআন শরিফের পার্শ্বটীকাতে ক্বিরাআত ও তাফসির লিখতেন। সেটি বিক্রি করে যা পেতেন তা দিয়ে তাঁর বছর চলে যেত।\n\nতিনি মনে করতেন শাসকদের নিকটবর্তী হওয়া এবং তাদের উপঢৌকন গ্রহণ করা ইখলাস ও তাকওয়ার পরিপন্থী। তিনি বলতেন: “আল্লাহ আমার পিতার প্রতি রহম করুন। তিনি বলতেন: আমি চাই না যে, তুমি আলেম হও; এই আশংকায় যে, তুমি আমীর-ওমরাদের দরজায় ধরনা দিবে।” [মিরকাতুল মাফাতীহ (১/৩৩১)]\n\nইলম, আমল ও নেকীর কাজে ভরপুর জীবন কাটিয়ে তিনি ১০১৬ হিজরীতে মতান্তরে ১০১০ হিজরীতে মক্কাতে মৃত্যুবরণ করেন। তবে অগ্রগণ্য মতানুযায়ী তিনি ১০১৪ হিজরীতে মৃত্যুবরণ করেন এবং মুয়াল্লা নামক কবরস্থানে তাঁকে দাফন করা হয়।",
      "Name:- Ali bin Sultan Muhammad. Nickname- Abul Hasan. Surname - Nuruddin. He is jurist, Muhaddith and Qari in one place. He is called Harabi and Makki from consideration of residence. He is popularly known as 'Molla Ali Qari'.\n\nHe is given the title of Qari; Because he was experienced in different reading methods of Quran. As a resident of 'Harat', the main city of Khorasan, he was called 'Harabi'. Khorasan is now part of Afghanistan.\n\nHe is called Makki because he visited Makkah, acquired knowledge from the scholars of Makkah and lived there until his death.\n\nHe was born in the city of 'Harat' around 930 Hijri. He grew up there, acquired knowledge, memorized the Quran. He studied Tajwid under Shaykh Moin Uddin Bin Hafeez Zain Uddin Al-Harabi. He has gained the deen of knowledge from contemporary scholars. Then he moved to Makkah. From Makkah, he acquired knowledge and religion from the scholars there for a long period of time. Thus, by acquiring knowledge, he became a famous scholar. He was a scholar of the Hanafi school. That is known from his bibliography and biography. He analyzed many issues of the Hanafi Madhhab and presented documentary evidence in favor of this Madhhab.\n\nHe was known as religious, pious and well-written. He used to work with his own hands. He was a worldly person, self-respecting and contented with little.\n\nLess mixed with people. He was busy in worship. He used to write one Quran Sharif every year in beautiful handwriting. He used to write Qira'at and Tafseer in the side notes of the written Qur'an Sharif. He used to spend his years with what he got from selling it.\n\nHe considered it against sincerity and piety to approach the rulers and accept their gifts. He used to say: “May Allah have mercy on my father. He used to say: I don't want you to be a scholar; Fearing that you will lay siege to the door of Amir-Umar.” [Mirkatul Mafatih (1/331)]\n\nHe passed away in Makkah in 1010 Hijri in 1016 Hijri after spending a life full of knowledge, deeds and good deeds. However, according to the leading opinion, he died in 1014 Hijri and was buried in the cemetery called Mualla.",
      "الاسم :- علي بن سلطان محمد . اللقب - أبو الحسن. اللقب - نور الدين. وهو فقيه ومحدث وقاري في مكان واحد. ويسمى حرابي ومكي من باب الإقامة. وهو معروف شعبيا باسم \"الملا علي قاري\".\n\nحصل على لقب قاري. لأنه كان من ذوي الخبرة في طرق قراءة القرآن المختلفة. ولكونه من سكان \"هرات\"، المدينة الرئيسية في خراسان، كان يُطلق عليه اسم \"الحرابي\". خراسان هي الآن جزء من أفغانستان.\n\nوسمي مكي لأنه زار مكة وأخذ العلم عن علماء مكة وأقام بها حتى وفاته.\n\nولد بمدينة حارة حوالي سنة 930 هجرية. نشأ هناك، واكتسب العلم، وحفظ القرآن. درس التجويد على الشيخ معين الدين بن حفيظ زين الدين الحربي. وقد اكتسب دين العلم من العلماء المعاصرين. ثم انتقل إلى مكة. ومن مكة أخذ العلم والدين عن علماءها مدة طويلة. وبذلك أصبح بحصوله على العلم عالماً مشهوراً. وكان من علماء المذهب الحنفي. وهذا معروف من سيرته وسيرته. وقد قام بتحليل العديد من مسائل المذهب الحنفي، وقدم الأدلة الوثائقية لصالح هذا المذهب.\n\nكان معروفًا بالدين والتقوى وحسن الكتابة. كان يعمل بيديه. وكان إنساناً دنيوياً، يحترم نفسه، ويكتفي بالقليل.\n\nأقل اختلاطاً بالناس. وكان مشغولاً بالعبادة. كان يكتب قرآناً شريفاً كل عام بخط جميل. وكان يكتب القراءات والتفسير في حواشي المصحف الشريف المكتوب. وكان يقضي سنين عمره بما حصل عليه من بيعه.\n\nواعتبر أنه من غير الإخلاص والتقوى التقرب إلى الحكام وقبول هداياهم. وكان يقول: رحم الله أبي. كان يقول: لا أريدك أن تكون عالما؛ خوفاً أن تحاصروا باب أمير عمر». [ميركات المفاتيح (1/331)]\n\nتوفي بمكة سنة 1010 هجرية سنة 1016 هجرية بعد أن أمضى حياة حافلة بالعلم والعمل والحسنات. أما على القول السائد فإنه توفي سنة 1014 هجرية ودفن في المقبرة التي تسمى بالمعلى."
    ],
    "image": "https://i.ibb.co/5LBdHRG/islamic-man.jpg"
  },
  {
    "_id": "667dc1b27d866f035c07d622",
    "name": [
      "আল্লামা সাদ উদ্দীন তাফতাযানী (রহ.)",
      "Allama Saad Uddin Taftazani (Rah.)",
      "العلامة سعد الدين تفتازاني (ر)"
    ],
    "desc": [
      "\n\nনাম: মাসউদ, উপাধি: সা’দ উদ্দীন। পিতার নাম:ওমর, উপাধি: কাযী ফখরুদ্দীন।\nবংশধারা: সা’দ উদ্দীন মাসউদ ইবনে ওমর ইবনে আব্দুল্লাহ তাফতাযানী।\nজন্ম\nতিনি ইরান খোরাসানের তাফতাযান নামক জনপদে ৭১২হিজরির সফর মাসে/১ মার্চ ১৩২২খ্রিষ্টাব্দে জন্মগ্রহন করেন।\nশিক্ষা অর্জন\nতিনি বিভিন্ন আলিম ও পণ্ডিতদের নিকট শিক্ষা লাভ করেন। তন্মধ্যে আযদুদ্দীন ও কুতুবুদ্দীন রাযীর নাম বিশেষভাবে উল্লেখযোগ্য।\nঅধ্যাপনা\nশিক্ষা সমাপনের পর যুবক বয়সেই তাকে তৎকালীন বড় বড় বিদ্বানদের কাতারে গণ্য করা হতো। লেখা-পড়া শেষ হওয়া মাত্রই তিনি অধ্যাপনার দায়িত্ব নিজ কােঁধে তুলে নেন। তার উল্লেখযোগ্য ছাত্র হলেন- আব্দুল ওয়াসি’ ইবনে খাযির, শায়খ শামসুদ্দীন ইবেন আহমদ হুফরী, আবুল হাসান বুরহান উদ্দীন প্রমুখ।[৫]\nমাযহাব\nতার মাযহাব সম্পর্কে দুটি মত পাওয়া যায়্ ১. হানাফী মাযহাবের অনুসারী। ২. শাফেয়ী মাযহাবের অনুসারী। উভয় মতের সমর্থনে দলিল রয়েছে, তবে তার হানাফী মাযহাবের অনুসারী হওয়ার পক্ষে মতামত বেশি জোরালো।\nরচনাবলী\nতার অনেক রচনাবলীর মধ্যে উল্লেখযোগ্য হলো\n•\tتہذيب المنطق\n•\tالمطول\n•\tمختصر المعاني\n•\tمقاصد الطالبين\n•\tشرح مقاصد الطالبين\n•\tالنعم السوابغ\n•\tشرح الكلم النوابغ للزمخشري\n•\tارشاد الہادى\n•\tشرح العقائد النسفیہ\n•\tحاشیہ على شرح العضد على مختصر ابن الحاجب\n•\tالتلويح الى كشف غوامض التنقيح\n•\tشرح تصريف زنجاني\n•\tشرح الشمسیہ\n•\tحاشیہ الكشاف\n•\tشرح اربعين النوویہ \nমৃত্যু\nতিনি ২২ মুহাররম ৭৯২হিজরির রোজ সোমবার উযবেকিস্তানের সমরকান্দে মৃত্যুবরণ করেন। সেখানেই তাকে সমাধিস্থ করা হয়। কারো মতে তার মৃত্যুবরণ সন ৭৯১হিজরি, আবার কারো মতে ৭৯৭হিজরী। তবে প্রথমোক্ত মতই বিশুদ্ধ।\n\n",
      "Name: Masood, Surname: Saad Uddin. Father Name: Omar Surname: Qazi Fakhruddin.\nLineage: Sa'd Uddin Mas'ud Ibn Omar Ibn Abdullah Taftazani.\nthe birth\nHe was born in the town of Taftazan in Khorasan, Iran in the month of Safar 712 Hijri/March 1, 1322 AD.\nGet an education\nHe received education from various scholars and scholars. Among them, the names of Azaduddin and Qutbuddin Razi are particularly noteworthy.\nteaching\nAfter completing his education, he was regarded as one of the great scholars of the time at a young age. As soon as he finished his studies, he took the responsibility of teaching on his shoulders. His notable students are - Abdul Wasi' Ibn Khazeer, Shaikh Shamsuddin Ibn Ahmad Hufri, Abul Hasan Burhan Uddin etc. [5]\nMadhhab\nThere are two opinions about his Madhhab 1. A follower of the Hanafi Madhhab. 2. A follower of the Shafi'i school of thought. There is evidence in support of both views, but the opinion is stronger in favor of his being a follower of the Hanafi Madhhab.\ncomposition\nHis many works are notable\n• تحظيب المنتق\n• المتول\n• Short meaning\n• Al-Maqasid al-Talibeen\n• Sharh al-Maqasid al-Talibeen\n• النعم السوابغ\n• شرح الكلم النوابغ للزمخشري\n• Irshad الهادي\n• Sharh Al-Aqeed Al-Nisafiah\n• حاشيه على شرح العضد على على القرب بن الحجب\n• التلويح الى كسف غوامض التنقيح\n• Sharh Tasrif Zanjani\n• Sharh Al-Shamsiya\n• حاشيه الكشف\n• شرح عرباين النوويها \ndeath\nHe died on Monday, 22 Muharram 792 Hijri in Samarkand, Uzbekistan. He was buried there. According to some, his death year is 791 Hijri, and according to others, 797 Hijri. But as pure as the former.",
      "الاسم: مسعود، اللقب: سعد الدين. اسم الأب: عمر اللقب: قاضي فخر الدين.\nالنسب: سعد الدين مسعود بن عمر بن عبد الله التفتازاني.\nالميلاد\nولد في بلدة تفتازان بخراسان بإيران في شهر صفر سنة 712 هجرية / 1 مارس 1322 م.\nيحصل على تعليم\nتلقى تعليمه على يد العديد من العلماء والعلماء. ومن بين هؤلاء أسماء عز الدين وقطب الدين الرازي الجديرة بالملاحظة بشكل خاص.\nتعليم\nوبعد أن أكمل تعليمه، اعتُبر من كبار علماء عصره في سن مبكرة. وحالما أنهى دراسته، أخذ على عاتقه مسؤولية التدريس. وأبرز تلامذته: عبد الواسع بن خضير، والشيخ شمس الدين بن أحمد حفري، وأبو الحسن برهان الدين، وغيرهم. [5]\nمذهب\nوفي مذهبه قولان: الأول: أنه من أتباع المذهب الحنفي. 2. من أتباع المذهب الشافعي. وللقولين ما يدل على ذلك، ولكن الرأي الأقوى في كونه على المذهب الحنفي.\nتعبير\nأعماله العديدة ملحوظة\n• تحظيب المنتق\n• المتول\n• معنى قصير\n• مقاصد الطالبين\n• شرح مقاصد الطالبين\n• النعم السوابغ\n• شرح الكلمات النوابغ للزمخشري\n• إرشاد الهادي\n• شرح العقيدة النصافية\n• حاشيه على شرح العضد على القرب بن الحجب\n• التلويح الى كسف غوامض التنقيح\n• شرح تصريف الزنجاني\n• شرح الشمسية\n• حاشيه الكشف\n• شرح عربين معلوماتها \nموت\nتوفي يوم الاثنين 22 محرم سنة 792 هجرية في سمرقند بأوزبكستان. ودفن هناك. وعند البعض سنة وفاته 791 هجرية، وعند البعض الآخر 797 هجرية. ولكن نقية مثل السابق."
    ],
    "image": "https://i.ibb.co/CVz07sk/islamic-man.jpg"
  },
  {
    "_id": "667dc1c47d866f035c07d623",
    "name": [
      "আল্লামা ইবনে কাসির (রাহ.)",
      "Allama Ibn Kasir (RA)",
      "العلامة ابن كثير (رض)"
    ],
    "desc": [
      "আল্লামা ইবনে কাসির (রাহ.) জীবনী\n\nনাম ও বংশ পরিচয়ঃ\nতার প্রকৃত নাম ইসমাঈল , আবুল ফিদা তার কুনিয়াত বা উপনাম এবং ইমাদুদ্দীন ( ধর্মের স্তম্ভ ) তার উপাধি । সুতরাং পুরা নাম ও বংশ পরিচয় হচ্ছে ঃ আবুল ফিদা ইমাদুদ্দীন ইসমাঈল ইবন উমার ইবন কাসীর ইবন যার আল – কারশী , আল – বাসরী , আদ দিমাশকী । কিন্তু সাধারণ্যে তিনি ইবন কাসীর নামেই সমধিক প্রসিদ্ধ । বস্তুতঃ ‘ আলবাসরী ‘ নামক তাঁর এই ‘ নিসবাতটি হচ্ছে জন্মস্থান বাচক উপাধি এবং ‘ আদু দিমাশকী ’ নামক তাঁর এই ‘ নিসবাতটি হচ্ছে তাঁর শিক্ষা – দীক্ষা বা তা ‘ লীম ও তারবিয়াত বাচক উপাধি ।\nজন্ম ও শিক্ষা – দীক্ষাঃ\nইমাম ইবন কাসীর ( রহঃ ) সিরীয়া প্রদেশের প্রসিদ্ধ শহর বাসরার অধীন মাজদাল নামক মহল্লায় ৭০১ হিজরীতে জন্মগ্রহণ করেন । ইবন কাসীরের জন্মের সময়ে তাঁর পিতা সেই অঞ্চলের খতীব পদে অধিষ্ঠিত ছিলেন । চার বছর বয়সে শিশু ইবন কাসীরের হেময় পিতা শিহাবুদ্দীন উমার ৭০৫ হিজরী মুতাবিক ১৩০৩ খৃষ্টাব্দে ইন্তিকাল করেন । তখন তার জ্যেষ্ঠ সহােদর শাইখ আবদুল ওয়াহাব তার প্রতিপালনের দায়িত্বভার গ্রহণ করেন ।\nশিক্ষকবৃন্দঃ\nতিনি জ্যেষ্ঠ ভাইয়ের কাছে প্রাথমিক শিক্ষা সমাপন করে ফিকাহ শাস্ত্রের অধ্যয়ন শুরু করেন । অতঃপর শাইখ বুরহানুদ্দীন ইবরাহীম ইবন আবদুর রাহমান ফাযারী ( মৃত্যু ৭২৯ হিজরী / ১৩২৮ খৃষ্টাব্দ ) এবং শাইখ কামালুদ্দীন ইব্‌ন কাযী শুহবার কাছে ফিকাহ শাস্ত্রের পাঠ সমাপ্ত করেন । মুহাদ্দিস হাজ্জার ছাড়া তার সমসাময়িক যেসব মুহাদ্দিসের কাছ থেকে ইমাম ইবন কাসীর একাগ্রচিত্তে হাদীস শাস্ত্র অধ্যয়ন করেছিলেন তাঁদের মধ্যে নিমেড়বাক্ত মনীষীদের নাম বিশেষভাবে উল্লেখ্য ।\n★ বাহাউদ্দীন ইবন কাসিম ইবন মুযাফফর ইবন আসাকির ।\n★ শাইখুয যাহিরিয়া আফীফুদ্দীন ইসহাক ইবন ইয়াহিয়া আল আমিদী ।\n★ ঈসা ইবনুল মুতইম ।\n★ মুহাম্মাদ ইবন যারাদ ।\n★ বদরুদ্দীন মুহাম্মাদ ইবন ইবরাহীম ইবন সুয়াইদী ।\n★ শাইখুল ইসলাম তাকিউদ্দিন আহমাদ ইবন তাইমীয়া আল হাররানী ।\n★ ইবনুর রাযী ।\n★ আহমাদ ইবন আবী তালিব ( ইবনুশ শাহনাহ ) ( মৃত্যু ৭৩০ হিজরী )\n★ ইবনুল হাযযার ( মৃত্যু ৭৩০ হিজরী )\n★ আলী ইবন উমার আস সুওয়াইনী।\n★ আবু মূসা আল কারাফাই।\n★ আবুল ফাতহ আল দাসী।\n★ ইবনুর রাহী ।\n★ হাফিয জামালুদ্দিন ইউসুফ আল মযী শাফিঈ ।\nহাফিয ইবন কাসীর ( রহঃ ) উপরােক্ত মুহাদ্দিসদের মধ্যে যার কাছ থেকে সব চেয়ে বেশি শিক্ষা – দীক্ষার সুযােগ লাভ করে উপকৃত হয়েছিলেন তন্মধ্যে তাহযীবুল কামাল প্রণেতা সিরীয়া দেশীয় মুহাদ্দিস আল্লামা হাফিয জামালুদ্দিন ইউসুফ ইবন আবদুর রাহমান মিযী শাফিঈ ( মৃত্যু ৭৪২ হিজরী / ১৩৪১ খৃষ্টাব্দ ) বিশেষভাবে উল্লেখের দাবীদার ।\nইমাম ইবনে কাসীরের প্রতি সমসাময়িক মনীষীদের শ্রদ্ধা নিবেদনঃ\n♦ হাফিয শামসুদ্দীন আবী ( মৃত্যু ৭৪৮ হিজরী / ১৩৪৭ খৃষ্টাব্দ ) তাঁর ‘ আলমুজামুল মুখতাস ‘ এবং ‘ তাযকিরাতুল হুফফা ‘ নামক অনবদ্য গ্রন্থদ্বয়ে বলেনঃ ‘ ইবন কাসীর একজন খ্যাতনামা মুফতী ( ফাতওয়া প্রদানে বিশেষজ্ঞ ) , বিজ্ঞ মুহাদ্দিস , আইন অভিজ্ঞ ফিকহ শাস্ত্রবিদ , বিচক্ষণ তাফসীরকার এবং রিজাল শাস্ত্রে বিশেষ পারদর্শী । হাদীসের মতন ( মূল অংশ ) সম্পর্কে তাঁর অভিনিবেশ ছিল উল্লেখযােগ্য ।\n♦ হাফিয হুসাইনী এবং আল্লামা জালালুদ্দীন সুয়ূতী তাঁদের নিজ নিজ গ্রন্থে ইমাম ইবন কাসীর সম্পর্কে মন্তব্য করতে গিয়ে বলেন : “ তিনি হাদীসের বিশিষ্ট অধ্যাপক , হাদীস শাস্ত্রের হাফিয , প্রখ্যাত আলিম এবং ইমাম , বক্তৃতায় সুনিপুণ এবং বহু গুণ ও উল্কর্ষের অধিকারী ।\n♦ আল্লামা শাইখ ইন ইমাদ হাম্বালী ( মৃত্যু ১০৮৯ হিজরী / ১৬৭৮ খৃষ্টাব্দ ) ইমাম ইবন কাসীরকে ( রহঃ ) আল হাফিযুল কাবীর ’ বা মহান হাফিয অর্থাৎ কুরআনের শ্রেষ্ঠ শ্রুতিধর বলে আখ্যায়িত করেন ।\n♦ হাফিয ইবন নাসিরুদ্দীন আদ – দিমাশকী ( মৃত্যু ৮৪২ হিজরী / ১৪৩৮ খৃষ্টাব্দ ) তার ( ইবন কাসীরের ) প্রসঙ্গে বলেনঃ আল্লামা হাফিয ইমাদুদ্দীন ইবন কাসীর ছিলেন মুহাদ্দিসগণের নির্ভর , ঐতিহাসিকদের অবলম্বন এবং তাফসীর বিদ্যা বিশারদদের উনড়বত ধ্বজা ‘ ।\n♦ হাফিয ইবন হাজার আসকালানী ( ৮৫২ হিজরী ) তাঁর ‘ আদদুরারুল কামনা ‘ গ্রন্থে বলেন ও হাদীসের মতন বা মৌল অংশ এবং রিজাল বা চরিত – অভিধান শাস্ত্রের পঠন – পাঠন ও অধ্যয়নে তিনি সব সময় নিমগ্ন থাকতেন । তাঁর উপস্থিত বুদ্ধি ও স্মৃতিশক্তি ছিল অত্যন্ত প্রখর , আর তিনি রসিকতা – প্রিয় ছিলেন । জীবদ্দশায় তাঁর গ্রন্থরাজি চারদিকে ব্যাপকভাবে ছড়িয়ে পড়ে । তিনি যেমন ছিলেন লিখা – পড়ায় অত্যন্ত পরিশ্রমী এবং জ্ঞান অন্বেষণে ছিলেন অত্যন্ত তৎপর , তেমনি তার ছিল ক্ষুরধার লেখনী । ফিকহ , তাফসীর এবং হাদীস শাস্ত্রে তার ছিল পূর্ণ দখল । পড়ালেখার সাথে সাথে তিনি বই পুস্তক লিখা ও দীনের প্রচার কাজে নিজকে ব্যস্ত রেখেছিলেন ।\n♦ ঐতিহাসিকগণও ইমাম ইবন কাসীরের ( রহঃ ) সর্বতােমুখী প্রতিভা , স্মৃতিশক্তি এবং অগাধ জ্ঞানের গভীরতা সম্পর্কে ভূয়সী প্রশংসা করেন । এ প্রসঙ্গে আল্লামা ইবন ইমাদ ( মৃত্যু ১০৯৮ হিজরী / ১৬৭৮ খৃষ্টাব্দ ) বলেন তার উপস্থিত বুদ্ধি ও ধীশক্তি ছিল অত্যন্ত প্রখর । কোন বিষয়কে একবার মুখস্থ করে নিলে তার বিস্মরণ খুব কমই হত । আর তিনি মেধাবীও কম ছিলেননা । আরাবী সাহিত্যও তিনি সৃষ্টি করেছেন এবং মধ্যম পর্যায়ের কবিতাও তিনি রচনা করতেন ‘ ।\nইমাম ইবন কাসীর ( রহঃ ) রচিত গ্রন্থমালাঃ\n★ আল্লামা হাফিয ইবন কাসীর তার অমর স্মৃতির নিদর্শন  হিসাবে এই মরজগতের বুকে যেসব মহামূল্য ধন – সম্পদ ও বিষয় বৈভব ছেড়ে গেছেন , তন্মধ্যে তার লিখিত تفسیرالقران العظیم যা তাফসীরে ইবনে কাছীর ‘ নামেই বেশি পরিচিত ।\n★ التکميل في معرفة الثقات والضعفاء والمجاهيل\n★ البدایت و النهایة ইবন কাসীর রচিত ইতিহাস বিষয়ক ১৪ খন্ডের এই বিরাট গ্রন্থখানি তার এক অনবদ্য সৃষ্টি ।\n★ الهدي والسنن في احاديث المسانید و السنن এই গ্রন্থখানি ‘ জামিউল মাসানীদ নামেও প্রসিদ্ধ ।\n★ طبقات الشافعیة এই গ্রন্থে শাফিঈ ফকীহদের বিস্তারিত বিবরণ প্রদত্ত হয়েছে ।\n★ شرح صحیح البخاری\n★ الاحکام الکبیر\n★ اختصار علوم الحدیث\n★ مسند الشیخین\n★ السیرة النبویة\nএ একখানি বৃহদাকার উৎকৃষ্ট সীরাত গ্রন্থ ।\n★ تمختصر كتاب المدخل اللامام بيهقی\n★ رسالة الاجتهاد فی طلب الجهاد\nইবনে কাসীর রহ এর মৃত্যুঃ\nঅবধা কাসীর দৃষ্টিহীন হয়ে পড়েন । অতঃপর বের মত্যু অবধারিত মৃত্যুর আগে এই নশ্বর জীবনের শেষভাগে হাফিয ইবন রিহীন হয়ে পড়েন । অতঃপর ১৩৭২ খৃষ্টাব্দ মুতাবিক ৭৭৪ হিজরীর ২৬ শাবান স্পতিবার এই মহামনীষী অস্থায়ী দুনিয়ার বুক থেকে বিদায় নিয়ে আখিরাতের সেই অনন্তলােকে যাত্রা করেন ।",
      "Biography of Allama Ibn Kasir (RA).\n\nName and surname:\nHis real name is Ismail, Abul Fida is his pen name and Imaduddin (Pillar of Religion) is his title. So the full name and surname are: Abul Fida Imaduddin Ismail Ibn Umar Ibn Kasir Ibn Jar Al-Karshi, Al-Basari, Ad Dimashki. But in general he is more famous as Ibn Kasir. In fact, this 'Nisbat' of his called 'Albasari' is the title of Birthplace Bachak and this 'Nisbat' of his called 'Adu Dimashki' is his Education - Initiation or Ta' Lim and Tarbiat Bachak Upadah.\nBirth and Education – Initiation:\nImam Ibn Kasir (RA) was born in the year 701 Hijri in Majdal under the famous city of Basra in the province of Syria. At the time of Ibn Kasir's birth, his father was holding the post of Khatib of that region. At the age of four, Ibn Kasir's devoted father, Shihabuddin Umar, died in 705 Hijri Mutabik 1303 AD. Then his elder brother Sheikh Abdul Wahab took responsibility for his upbringing.\nTeachers:\nHe completed his primary education under his elder brother and started studying Fiqh Shastra. Then Shaikh Burhanuddin Ibrahim Ibn Abdur Rahman Fazari (died 729 Hijri / 1328 AD) and Shaikh Kamaluddin Ibn Qazi completed the lessons of Fiqh Shastra. Apart from Muhaddith Hajjar, the names of the eminent thinkers from whom Imam Ibn Qasir studied the Hadith scriptures intensively from his contemporary Muhaddiths are particularly noteworthy.\n★ Bahauddin Ibn Qasim Ibn Muzaffar Ibn Asakir.\n★ Shaikhuz Zahiriya Afifuddin Ishaq Ibn Yahya Al Amidi.\n★ Isa Ibnul Mutaim.\n★ Muhammad Ibn Zayed.\n★ Badruddin Muhammad Ibn Ibrahim Ibn Suwaidi.\n★ Shaykhul Islam Taqiuddin Ahmad Ibn Taymiyyah Al Harrani.\n★ Ibnu Razi.\n★ Ahmad Ibn Abi Talib (Ibnush Shahnah) (died 730 AH)\n★ Ibnul Hajar (died 730 Hijri)\n★ Ali ibn Umar As Suwayni.\n★ Abu Musa Al Karafai.\n★ Abul Fatah Al Dasi.\n★ Ibnur Rahi.\n★ Hafiz Jamaluddin Yusuf Al Maji Shafi'i.\nHafiz Ibn Kasir (R.A.) among the above Muhaddiths from whom he benefited from receiving the most education-initiation opportunity, the author of Tahibul Kamal, the Syrian native Muhaddith Allama Hafiz Jamaluddin Yusuf Ibn Abdur Rahman Mizi Shafi’i (died 742 Hijri / 1341 AD) deserves special mention. .\nContemporary thinkers tribute to Imam Ibn Kasir:\n♦ Hafiz Shamsuddin Abi (died 748 Hijri / 1347 AD) in his excellent books called 'Almuzamul Mukhtas' and 'Tazkiratul Huffa' said: 'Ibn Qasir was a renowned mufti (expert in issuing fatwa), learned muhaddith, jurisprudent jurisprudent, judicious tafsir and rizal. Specially skilled in scriptures. His innovation about the Hadith Matan (main part) was remarkable.\n♦ Hafiz Husaini and Allama Jalaluddin Suyuti commenting on Imam Ibn Kasir in their respective books, said: “He is an eminent professor of hadith, a hafiz of hadith, a renowned scholar and imam, skilled in speech and possessed of many virtues and excellence.\n♦ Allama Shaykh In Imad Hambali (died 1089 Hijri / 1678 AD) called Imam Ibn Kasir (RA) Al Hafizul Kabir or the Great Hafiz, i.e. the best reciter of the Quran.\n♦ Hafiz Ibn Nasiruddin Ad-Dimashqi (died 842 Hijri / 1438 AD) said about him (Ibn Qasir): Allama Hafiz Imaduddin Ibn Qasir was the dependant of Muhaddiths, the support of historians and the unwavering support of Tafseer scholars.\n♦ Hafiz Ibn Hajar Askalani (852 Hijri) says in his book 'Addurarul Qamna' that he was always engrossed in reading and studying the Matan or main part of Hadith and Rizal or Charit - dictionary scriptures. His present intelligence and memory were very sharp, and he was fond of humour. During his lifetime, his literature spread widely. As he was very diligent in reading and writing and was very active in seeking knowledge, he also had a sharp pen. He had complete mastery in Fiqh, Tafseer and Hadith. Along with his studies, he kept himself busy in writing books and promoting religion.\n♦ Historians also praise Imam Ibn Qasir (R.A.) for his all-round genius, memory and immense depth of knowledge. In this context, Allama Ibn Imad (died 1098 Hijri / 1678 AD) said that his intellect and wisdom were very keen. Once a subject is memorized, it is rarely forgotten. And he was not less talented. He also created Arabic literature and used to compose middle level poetry.\nBooks written by Imam Ibn Kasir (RA).\n★ Allama Hafiz Ibn Qasir as a sign of his immortal memory, among the great treasures and wealth and material splendor that he left behind in this world, his written Tafsir al-Qaraan al-Aziim, which is better known as Tafseer Ibn Kachir.\n★ التكميل في معرفة الثقات والثافعاء والمجاهيل\n★ البدايت و النهاية Ibn Kasir's 14-volume book on history is one of his great creations.\n★ الهدي والسنن في احاديث المسانيد و السنن This book is also famous as Jamiul Masanid.\n★ Tabaqat الشافعية In this book the details of the Shafi'i jurists are given.\n★ شرح صحيح البخاري\n★ الاحكام الكبير\n★ اختصار العلوم الحديث\n★ Musnad al-Sheikheen\n★ السيرة النبويةة\nThis is a large and excellent Sirat book.\n★",
      "سيرة العلامة ابن كثير (رضي الله عنه).\n\nاسم ولقب:\nاسمه الحقيقي إسماعيل، وأبو الفدا هو اسمه المستعار، وعماد الدين هو لقبه. فالاسم الكامل واللقب هما: أبو الفداء عماد الدين إسماعيل بن عمر بن كثير بن جار الكرشي، البصري، الدمشقي. لكنه على العموم أشهر من ابن كثير. في الواقع، \"نسبات\" اسمه \"البصري\" هو لقب مسقط رأسه \"باشاك\" و \"نسبات\" اسمه \"أدو دمشقي\" هو تعليمه - التنشئة أو تعليم وتربيت بشاك أوباداه.\nالميلاد والتعليم – البداية:\nولد الإمام ابن كثير (رضي الله عنه) سنة 701 هجرية في المجدل التابعة لمدينة البصرة الشهيرة في محافظة سوريا. وفي وقت ولادة ابن كثير، كان والده يشغل منصب الخطيب في تلك المنطقة. توفي والد ابن كثير المخلص شهاب الدين عمر وهو في الرابعة من عمره عام 705 هجرية (1303 م). ثم تولى أخوه الأكبر الشيخ عبد الوهاب مسؤولية تربيته.\nمعلمون:\nأكمل تعليمه الابتدائي على يد أخيه الأكبر وبدأ بدراسة الفقه الشطري. ثم أكمل الشيخ برهان الدين إبراهيم بن عبد الرحمن الفزاري (المتوفى 729 هجرية / 1328 م) والشيخ كمال الدين بن قاضي دروس الفقه الشطري. وبصرف النظر عن المحدث حجار، فإن أسماء المفكرين البارزين الذين درس عنهم الإمام ابن قصير كتب الحديث بشكل مكثف من المحدثين المعاصرين له جديرة بالملاحظة بشكل خاص.\n★ بهاء الدين بن قاسم بن مظفر بن عساكر.\n★ الشيخ الظاهري عفيف الدين إسحاق بن يحيى العميدي.\n★ عيسى بن المتيم.\n★ محمد بن زايد .\n★ بدر الدين محمد بن إبراهيم ابن السويدي.\n★ شيخ الإسلام تقي الدين أحمد ابن تيمية الحراني.\n★ ابن الرازي.\n★ أحمد بن أبي طالب (ابنوش شحنه) (توفي 730هـ)\n★ ابن الحجر (توفي 730 هجرية)\n★ علي بن عمر السويني.\n★ أبو موسى الكرافي.\n★ أبو الفتح الداسي.\n★ ابنور الراعي.\n★ الحافظ جمال الدين يوسف الماجي الشافعي.\nالحافظ ابن كثير (رضي الله عنه) من المحدثين المذكورين الذين استفاد منهم أكثر فرص التعليم، صاحب كتاب تحية الكمال، المحدث السوري الأصل العلامة الحافظ جمال الدين يوسف بن عبد الرحمن مزي الشافعي (المتوفى 742 هجرية / 1341 م). م) يستحق إشارة خاصة. .\nتكريم المفكرين المعاصرين للإمام ابن كثير:\n♦ قال الحافظ شمس الدين أبي (المتوفى 748 هجرية/ 1347م) في كتابيه الممتازين المسمى 'المختصر المختصر' و'تذكرة الحفة': 'كان ابن قصير مفتياً مشهوراً، عالماً محدثاً، فقيهاً، حكيماً في التفسير. وريزال. ماهر بشكل خاص في الكتب المقدسة. وكان ابتكاره في الحديث المتن (الجزء الرئيسي) رائعًا.\n♦ قال الحافظ الحسيني والعلامة جلال الدين السيوطي في تعليقهما على الإمام ابن كثير في كتابيهما: «هو أستاذ الحديث، حافظ الحديث، عالم وإمام مشهور، حاذق في الكلام، كثير الفضائل والفضائل.\n♦ العلامة الشيخ عماد الحنبلي (توفي 1089 هجرية / 1678 م) يلقب بالإمام ابن كثير (رضي الله عنه) الحافظ الكبير أو الحافظ الكبير أي أفضل قارئ للقرآن.\n♦ قال عنه الحافظ ابن ناصر الدين الدمشقي (ت 842 هجرية/ 1438 م) (ابن قصير): العلامة الحافظ عماد الدين ابن قصير كان معتمدا على المحدثين، ومؤيدا للمؤرخين، ومؤيدا لا يتزعزع لعلماء التفسير.\n♦ يقول الحافظ ابن حجر العسقلاني (ت 852 هـ) في كتابه \"الدرر القماشية\" أنه كان دائمًا منهمكًا في قراءة ودراسة المتن أو الجزء الرئيسي من الحديث والرزال أو الصدقة - كتب القاموس. كان ذكاؤه وذاكرته الحاليين حادين للغاية، وكان مولعًا بروح الدعابة. وفي حياته انتشر أدبه على نطاق واسع. كما كان مجتهدًا جدًا في القراءة والكتابة، ونشطًا جدًا في طلب العلم، وكان أيضًا صاحب قلم حاد. وكان متمكناً تماماً من الفقه والتفسير والحديث. وكان مشغولاً إلى جانب دراسته بتأليف الكتب ونشر الدين.\n♦ كما يمدح المؤرخون الإمام ابن قصير (ع) على عبقريته الشاملة وذاكرته وعمق علمه الهائل. وفي هذا السياق يقول العلامة ابن عماد (توفي 1098 هـ / 1678 م) إن عقله وحكمته كانا شديدي الحرص. بمجرد حفظ موضوع ما، نادرًا ما يتم نسيانه. ولم يكن أقل موهبة. كما أنشأ الأدب العربي، وكان يكتب الشعر المتوسط.\nكتب الإمام ابن كثير (رضي الله عنه).\n★ العلامة الحافظ ابن قصير علامة على ذكراه الخالدة، ومن الكنوز العظيمة والثروات والروعة المادية التي تركها في الدنيا، كتابه تفسير القران العظيم المعروف بتفسير ابن كثير.\n★تكميل في معرفة الثقات والثافعاء والمجاهيل\n★ البدايت والنهائي كتاب ابن كثير عن التاريخ المكون من 14 مجلدًا هو أحد إبداعاته العظيمة.\n★ الهدى والسنن في احاديث المسانيد و السنن هذا الكتاب مشهور أيضا باسم جامع المسانيد.\n★ طبقات الشافعية وفي هذا الكتاب تفاصيل عن فقهاء الشافعية.\n★ شرح الحديث الشريف\n★ الاحكام الكبار\n★ اختصار العلوم الحديث\n★ مسند الشيخين\n★ السيرة النبوية\nوهذا كتاب الصراط كبير وممتاز.\n★"
    ],
    "image": "https://i.ibb.co/61SD2vv/islamic-man.jpg"
  },
  {
    "_id": "667dc1cd7d866f035c07d624",
    "name": [
      "ইমাম মুহাম্মদ ইবনে ইসমাইল বোখারী (র)",
      "Imam Muhammad Ibn Ismail Bokhari (RA)",
      "الامام محمد بن اسماعيل البخاري (رح)"
    ],
    "desc": [
      "ইমাম মুহাম্মদ ইবনে ইসমাইল বোখারী (র)\n\nমুহাদ্দিস শব্দের আভিধানিক অর্থ হাদিসবেত্তা। বলা হয়ে থাকে সকল মুহাদ্দিসের শ্রেষ্ঠ মুহাদ্দিস ছিলেন মুহাম্মদ বিন ইসমাইল বিন ইবরাহীম বিন মুগীরাহ বিন বারদিযবাহ। ১৯৪ হিজরী, ১৩ই শাওয়াল শুক্রবার খোরসানের বোখারাতে জন্মগ্রহণ করেন তিনি। ইমাম মুহাম্মদ ইবনে ইসমাইল বোখারী (র) এর বই সমূহ এর জন্যই তিনি স্মরণীয় হয়ে রয়েছেন। মুসলিম জগতে ইমাম বোখারী নামে অধিক পরিচিত তিনি। তাঁর পিতা ইসমাইল ইবনে ইব্রাহিম মুসলিম জগতের আরেক পরিচিত ব্যক্তিত্ব, যার ওঠা-বসা ছিলো হাদিসবীদ আল্লামা হাম্মাদ (রহঃ) এবং হযরত আব্দুল্লাহ ইবনে মুবারক (রহঃ) এর। অঢেল ধন-সম্পত্তির মালিকও ছিলেন তিনি। তাই খুবই অল্প বয়সে ইমাম বোখারী পিতাহারা হলেও কোনো সঙ্কটময় পরিস্থিতিতে পড়তে হয়নি। এর আরেক কারণ তাঁর মা। তাঁর মা ছিলেন এক বিদূষী ও পরহেজগার নারী। পুত্রকে তিনি সঠিক শিক্ষাটাই দিয়েছিলেন। তাই মাত্র ৬ বছর বয়সে বোখারী (রঃ) কোরআনের হাফিজ হন এবং এরপর হাদিস শিক্ষায় মনোনিবেশ করেন। ষোল বছর বয়সে হজ্জে গমন করে মক্কায় থেকে যান দক্ষ হাদিসবীদদের থেকে হাদিসের জ্ঞান নিতে। হাদিস সংগ্রহের আশায় ইরাক, সিরিয়া, মিশর, মদিনাসহ বহু অঞ্চলে ভ্রমণের পর ষোল বছর পর আবার বোখারায় ফেরত যান। ব্যক্তি হিসেবে তিনি ছিলেন দানশীল। তাঁর স্মৃতিশক্তি ছিলো প্রখর। ফলে হাদিস শুনেই মনে রাখতে পারতেন। বলা হয়ে থাকে, তিনি ছয় লক্ষ হাদিস মুখস্থ বলতে পারতেন, ক্ষুদ্র ত্রুটিও তার নজর এড়াতো না। ইমাম মুহাম্মদ ইবনে ইসমাইল বোখারী (র) এর বই সমগ্র বলতে আমরা বুঝি বুখারী শরীফ, যাতে স্থান পেয়েছে ইমাম বোখারী (রঃ) দ্বারা সংগ্রহকৃত সহীহ হাদিস। তার সংকলিত গ্রন্থের সংখ্যা ২০টিরও বেশি। শেষ বয়সে তিনি নিজ বাসভূম থেকে বিতাড়িত হন এবং সমরকন্দের খরতঙ্গ নামক স্থানে চলে আসেন। এ অঞ্চলেই তিনি ২৫৬ হিজরীর, ১লা শাওয়াল ইন্তেকাল করেন।",
      "Imam Muhammad Ibn Ismail Bokhari (RA)\nThe word muhaddis literally means hadith. It is said that the best muhaddith of all the muhaddis was Muhammad bin Ismail bin Ibrahim bin Mughirah bin Bardibah. He was born in Bokhara, Khorasan on Friday, 13th Shawwal, 194 Hijri. He is remembered for the books of Imam Muhammad Ibn Ismail Bukhari (RA). He is better known as Imam Bokhari in the Muslim world. His father Ismail Ibn Ibrahim is another well-known figure in the Muslim world, whose rise and fall was that of the hadith narrators Allama Hammad (RA) and Hazrat Abdullah Ibn Mubarak (RA). He was also the owner of abundant wealth. So Imam Bokhari lost his father at a very young age but did not have to fall into any critical situation. Another reason for this is his mother. His mother was a funny and pious woman. He gave the right education to his son. So at the age of 6, Bukhari (RA) became a Hafiz of the Qur'an and then concentrated on the study of Hadith. He went on Hajj at the age of sixteen and stayed in Makkah to learn the hadith from the learned hadith scholars. He returned to Bokhara after sixteen years after traveling to many places including Iraq, Syria, Egypt, Medina in the hope of collecting hadith. As a person he was charitable. His memory was sharp. As a result, he could remember the hadith by hearing it. It is said that he could recite 600,000 hadiths by heart, even minor errors did not escape his notice. By the complete book of Imam Muhammad Ibn Ismail Bokhari (RA), we mean Bukhari Sharif, which contains the Sahih Hadith collected by Imam Bokhari (RA). The number of his collected books is more than 20. At his last age he was driven out of his home and moved to a place called Khartang in Samarkand. He died in this region on 1st Shawwal, 256 Hijri.",
      "الامام محمد بن اسماعيل البخاري (رض)\nكلمة محدث تعني حرفيا الحديث. ويقال: أفضل المحدثين على الإطلاق محمد بن إسماعيل بن إبراهيم بن مغيرة بن برديبة. ولد في بخارى بخراسان يوم الجمعة 13 شوال سنة 194 هجرية. ويذكر بكتب الإمام محمد بن إسماعيل البخاري (رضي الله عنه). وهو معروف أكثر باسم الإمام البخاري في العالم الإسلامي. والده إسماعيل بن إبراهيم هو شخصية أخرى معروفة في العالم الإسلامي، وكان صعوده وهبوطه هو رواة الحديث العلامة حماد (رضي الله عنه) وحضرة عبد الله بن مبارك (رضي الله عنه). وكان أيضًا صاحب ثروة وافرة. لذلك فقد الإمام البخاري والده في سن مبكرة للغاية ولكن لم يضطر إلى الوقوع في أي موقف حرج. سبب آخر لذلك هو والدته. وكانت والدته امرأة مرحة وتقية. أعطى التعليم الصحيح لابنه. لذلك، في سن السادسة، أصبح البخاري (رضي الله عنه) حافظًا للقرآن ثم ركز على دراسة الحديث. حج وهو في السادسة عشرة من عمره وأقام بمكة يتعلم الحديث من علماء الحديث. عاد إلى بخارى بعد ستة عشر عاما بعد سفره إلى أماكن كثيرة منها العراق وسوريا ومصر والمدينة المنورة على أمل جمع الحديث. كشخص كان خيريا. وكانت ذاكرته حادة. ونتيجة لذلك، يمكنه أن يتذكر الحديث من خلال سماعه. ويقال إنه كان يستطيع قراءة 600 ألف حديث عن ظهر قلب، حتى الأخطاء البسيطة لم تفلت من ملاحظته. ونقصد بالكتاب الكامل للإمام محمد بن إسماعيل البخاري (رضي الله عنه) البخاري الشريف الذي يحتوي على الحديث الصحيح الذي جمعه الإمام البخاري (رضي الله عنه). ويبلغ عدد مؤلفاته المجمعة أكثر من 20 كتابا. وفي آخر عمره تم طرده من منزله ونقله إلى مكان يسمى خارتانج في سمرقند. وتوفي بهذه المنطقة في الأول من شوال سنة 256 هجرية."
    ],
    "image": "https://i.ibb.co/CVz07sk/islamic-man.jpg"
  },
  {
    "_id": "667dc1d47d866f035c07d625",
    "name": [
      "ইমাম মুহিউদ্দীন ইয়াহইয়া আন-নববী (রহ.)",
      "Imam Muhyiddin Yahya An-Nabawi (RA)",
      "الامام محيي الدين يحيى النبوي (رض)"
    ],
    "desc": [
      "তাঁর পূর্ণনাম মুহিউদ্দ্বীন আবু যাকারিয়া ইয়াহইয়া ইবনুশ শায়েখ আবু ইয়াহইয়া মুররি ইবনে হাসান ইবনে হুসাইন ইবনে মুহাম্মদ ইবনে জুম‘আ ইবনে হেযাম আল-হেযামী আন-নববী। ‘মুহিউদ্দ্বীন’ তাঁর উপাধি এবং ‘আবু যাকারিয়া’ হলো কুনিয়াত তথা উপনাম। তাঁর জীবদ্দশায় তিনি এতোটাই প্রসিদ্ধ ছিলেন এবং ইলম ও তাক্বওয়ার মানদণ্ডে এমন সমুন্নত হতে পেরেছিলেন যে, তাঁকে ‘মুহিউদ্দ্বীন মতান্তরে ‘মুহিউস্ সুন্নাহ’ উপাধিতে ভূষিত করা হয়।\n\n ৬৩১ হিজরীর মুহাররম মাসে দামেশকের নিকটবর্তী ‘নাওয়া’ নামক স্থানে তিনি জন্মগ্রহণ করেন। জন্মস্থানের দিকে সম্পর্কিত করেই তাঁর নামের শেষে ‘নাওয়ায়ী’ বা ‘নববী’ উল্লেখ করা হয়। এ ব্যাপারটা স্বতঃসিদ্ধ ও প্রমাণিত যে, আল্লাহ রাব্বুল আলামীন তাঁর যেসব বান্দাদের দিয়ে দীন ও মানুষের মহান খেদমত করান, ছোটবেলা থেকেই তাদেরকে সেভাবেই গড়ে তোলেন। ইমাম নববী রাহিমাহুল্লাহ’র ক্ষেত্রেও এর ব্যতিক্রম ঘটেনি। শৈশবে থেকেই তিনি ছিলেন আর সব শিশুদের চেয়ে আলাদা। অজপাড়া গ্রামে, নিম্নবিত্ত নিরক্ষর পরিবারে জন্ম নেওয়া সত্তে¡ও তাঁর সবটুকু ঝোঁক ছিলো ইলম অর্জনের দিকে। দোকানদার পিতা চাইতেন, ছেলে তার সাথে দোকানদারী করুক। কিন্তু তিনি পিতার কাছ থেকে অনুমতি নিয়ে দামেশকের ‘আর-রাওয়াহিয়্যাহ’ নামক প্রতিষ্ঠানে চলে যান ইলমের-অšে¦ষণে এবং আলেমদের সংস্পর্শে থাকার তাড়নায়। এখানে থেকেই তিনি ইলমের সবগুলো শাখায় নিজের উত্তরোত্তর ব্যুৎপত্তি ঘটান। ইমাম যাহাবী রাহিমাহুল্লাহ বলেন, ‘তিনি (নববী) দিন-রাত্রির বেশির ভাগ সময় জ্ঞানার্জনে ব্যয় করতেন। মেধা ও পরিশ্রমের জন্য তাঁকে দিয়ে উদাহরণ পেশ করা হতো।’ সারাদিনে একবার খেতেন। এমনকি পথ চলার সময়টুকুতেও মনে মনে পড়া আওড়াতেন।\n ৬৫১ হিজরীতে একুশ বছর বয়সে তিনি পিতার সাথে হজ্জ পালন করার জন্য মক্কায় যান। এই সফরকালে তিনি মক্কা-মদীনার শ্রেষ্ঠ আলেমগণের সান্নিধ্যে আসেন এবং হাদীস শাস্ত্রে বিশেষ বুৎপত্তি অর্জন করেন। ইমাম নববী রাহিমাহুল্লাহ যেসব ওস্তাদদের নিকট থেকে জ্ঞানার্জন করেছেন, তাঁদের মধ্যে মুহাম্মদ ইবনে আহমাদ আল-মাকদাসী, ইসমাইল ইবনে ইবরাহীম, আহমদ ইবনে আবদুদ্দায়েম, আবদুর রহমান আল-আন্বারী, ইবরাহীম ইবনে আলী আল-ওয়াসেতী প্রমূখ অন্যতম। ফিকহের ক্ষেত্রে নববী ছিলেন শাফেয়ী মাযহাবের অনুসারী। শুধু অনুসারীই নয়, বরং তিনি ছিলেন মাযহাবের প্রধান বিশ্লেষক ও ইমামদের একজন। ইবনে কাসীর রাহিমাহুল্লাহ বলেন, ‘তিনি ছিলেন শায়খুল মাযহাব এবং তাঁর যমানার শ্রেষ্ঠতম ফকীহ’। যাহাবী বলেন, ‘তিনি ছিলেন মাযহাবের ব্যাখ্যাকারদের শিরোমনি’। তাঁর রচিত ‘রাওদাতুল ত্বালেবীন’কে শাফেয়ী মাযহাবের প্রধানতম ব্যাখ্যাগ্রন্থ ও তথ্যসূত্র হিসেবে গণ্য করা হয়। অধিকাংশ শাফেয়ী আলেমদের মতো ইমাম নববী রাহিমাহুল্লাহও আকীদার ক্ষেত্রে ‘আশ‘আরী’ মতবাদের অনুসারী ছিলেন। যাহাবী, তাজউদ্দীন সুবকী, ইয়াফেয়ী-সহ তাঁর অপরাপর জীবনীকাররা এমনটাই উল্লেখ করেছেন। \nসহীহ মুসলিমের ব্যাখ্যায় তাঁর রচিত ‘আল মিনহাজ’ গ্রন্থে তিনি আশ‘আরী মতবাদসমূহকে ব্যাপকভাবে স্থান দিয়েছেন। ক্ষণজন্মা এই মহাত্মা বেঁচে ছিলেন মাত্র পয়তাল্লিশ বছর। কিন্তু এই স্বল্প সময়েও আল্লাহ রাব্বুল আলামীন তাঁকে দিয়ে দীন ও ইলমের যে বিশাল খেদমত করিয়েছেন, তা সত্যিই বিরল। ইলমের প্রায় প্রতিটি শাখাতেই তাঁর রচিত গ্রন্থ রয়েছে, যেগুলো কেয়ামত পর্যন্ত মানুষকে উপকার দিয়ে যাবে, ইনশাআল্লাহ! বিশেষ করে ‘আল-আরবাঈন আন-নববীয়্যাহ’, ‘রিয়াদুস সালেহীন’ এবং ‘আল-আযকার’ এই তিনটি গ্রন্থ তো সর্বস্তরের মুসলিমের কাছেই সমানভাবে সমাদৃত এবং পঠিত।\n \nএছাড়া তাঁর রচিত বিখ্যাত গ্রন্থাবলির মধ্যে অন্যতম হলো,\n (১) আল-মিনহাজ ফি শারহে মুসলিম ইবনুল হাজ্জাজ; (২) রাওদাতুল ত্বালেবীন ওয়া উমদাতুল মুফতীন; (৩) মিনহাজুল ত্বালেবীন ওয়া উমদাতুল মুফতীন; (৪) আদাবুল মুফতি ওয়াল মুসতাফতি; (৫) তুহফাতু তুল্লাবিল ফাদায়েল; (৬) আত-ত্বিবইয়ান ফি আদাবে হামালাতিল কুরআন। (৭) আত-তাহরীর ফি আলফাযিত তানবীহ; (৮) আল-উমদাহ ফি তাসহিহিত তানবীহ; (৯) আল ইদ্বাহ ফিল মানাসিক; (১০) আত তাইসীর ফি মুখতাসারিল ইরশাদ; (১১) ইরশাদু তুল্লাবিল হাক্বায়েক; (১২) আল-ফাতাওয়া; (১৩) আল মিনহাজ ফি মুখতাসারিল মুহাররার; (১৪) দাকায়েকুল মিনহাজ; (১৫) মুখতাসারু আসাদিল গাবাহ; (১৬) মানাকিবুশ শাফেয়ী; (১৭) মুহেম্মাতুল আহকাম; (১৮) রিসালাহ ফি ক্বিসমাতিল গানাঈম; (১৯) খুলাসাতুল আহকাম; (২০) বুসতানুল আরেফীন।\n এছাড়া তাঁর রচিত অসমাপ্ত গ্রন্থের সংখ্যাও কম নয়। তন্মধ্যে ‘আল মাজুমু শারহুল মুহায্যাব’ বিশেষভাবে উল্লেখযোগ্য। \nতাঁর মৃত্যুর পর ইমাম সুবকী রাহিমাহুল্লাহ এবং তারপর শায়েখ মুহাম্মদ নজীব এই গ্রন্থের রচনা সমাপ্ত করেন। এছাড়া ‘জামেউস সুন্নাহ’, ‘শারহুত ত্বানবীহ’, ‘শারহুল ওয়াসিত’, ‘শারহুল বুখারী’, ‘শারহু সুনানি আবু দাউদ’, ‘আল-আহকাম’ প্রমুখ উল্লেখযোগ্য। \n৬৭৬ হিজরীর রজব মাসের চব্বিশ তারিখে পয়তাল্লিশ বা ছেচল্লিশ বছর বয়সে এই মনীষী ইন্তেকাল করেন। তাজউদ্দীন সুবকী রাহেমাহুল্লাহ বলেন, ‘তাঁর মৃত্যুতে দামেশক ও তদ্সংলগ্ন শহরগুলো শোকে ডুবে গিয়েছিলো।’ জন্মস্থান ‘নাওয়া’তেই তাঁকে দাফন করা হয়। মহান আল্লাহ তাঁকে এবং তাঁর সকল খেদমতকে কবুল করুন।",
      "His full name is Muhyiddin Abu Zakariya Yahya Ibnush Shaykh Abu Yahya Murri Ibn Hasan Ibn Husayn Ibn Muhammad Ibn Juma'a Ibn Hezam Al-Hezami An-Nabawi. 'Muhiuddin' is his surname and 'Abu Zakaria' is his nickname. During his lifetime he was so famous and so advanced in the standards of knowledge and piety that he was awarded the title of 'Muhius Sunnah' in the 'Muhiuddin Matantar'.\n\n He was born in the month of Muharram 631 Hijri in a place called 'Nawa' near Damascus. 'Nawayi' or 'Nawabi' is mentioned at the end of his name, referring to his place of birth. This matter is self-evident and proven that Allah Rabbul Alamin, through whom He has done great service to the religion and people, has raised them in such a way from childhood. This was no exception in the case of Imam Nawabi Rahimahullah. From childhood he was different from other children. Although born in Ajpara village, in a low-class illiterate family, he had every inclination towards acquiring knowledge. The shopkeeper father wanted his son to shop with him. But he took permission from his father and went to the institution called Ar-Rawahiyah in Damascus in pursuit of knowledge and contact with scholars. From here he made his subsequent etymology in all branches of knowledge. Imam Zahabi Rahimahullah said, \"He (the Prophet) used to spend most of his day and night in learning.\" He used to be an example for his talent and hard work. He used to eat once a day. He used to read in his heart even during the journey.\n In 651 A.H., at the age of twenty-one, he accompanied his father to Mecca to perform Hajj. During this visit, he came into the presence of the best scholars of Makkah-Madinah and acquired special knowledge in Hadith. Muhammad Ibn Ahmad Al-Maqdasi, Ismail Ibn Ibrahim, Ahmad Ibn Abdudayem, Abdur Rahman Al-Anbari, Ibrahim Ibn Ali Al-Waseti are among the masters from whom Imam Nawabi (Rahimahullah) learned knowledge. Nawabi was a follower of the Shafi'i school of jurisprudence. Not only a follower, but he was one of the main analysts and Imams of the Madhhab. Ibn Qasir Rahimahullah said, \"He was of the Shaykhul Madhhab and the best jurist of his time.\" Zahabi said, \"He was the leader of the interpreters of the madhhab\". Rawdatul Talibeen, written by him, is considered as the main explanatory book and source of information for the Shafi'i Madhhab. Like most of the Shafi'i scholars, Imam Nawabi (Rahimahullah) also followed the 'Ash'ari' school of belief. His other biographers, including Zahabi, Tajuddin Subaki, Yafei, have mentioned this.\nIn the interpretation of Sahih Muslim in his book 'Al Minhaj', he gave a great place to Ash'ari doctrines. This short-lived Mahatma lived only forty-five years. But even in this short period of time Allah Rabbul Alamin has given him the great service of religion and knowledge, which is really rare. There are books written by him in almost every branch of science, which will benefit people until the Day of Judgment, InshaAllah! Especially the three books 'Al-Arba'in An-Nababiyyah', 'Riyadus Salehin' and 'Al-Azkar' are equally appreciated and read by Muslims of all levels.\n\nBesides, one of the famous books written by him is,\n (1) Muslim Ibn al-Hajjaj in al-Minhaj fi Sharh; (2) Rawdatul Talebeen wa Umdatul Muftin; (3) Minhajul Talebeen wa Umdatul Muftin; (4) Adabul Mufti Wal Mustafati; (5) Tuhfatu Tullabil Fadael; (6) At-tibiyan fi adaba Hamalatil Qur'an. (7) At-Tahrir Fee Alfajit Tanbeeh; (8) Al-Umdah fi Tashihit Tanbeeh; (9) Al Idwah Fil Manasiq; (10) At Taisir Fee Mukhtasaril Irshad; (11) Irshadu Tullabil Haqbayek; (12) Al-Fatawa; (13) Al Minhaj Fi Mukhtasaril Muharrar; (14) Dakayekul Minhaj; (15) Mukhtasaru Asadil Gabah; (16) Manakibush Shafeei; (17) Muhammadul Ahkam; (18) Risalah fi Qismatil Ganaim; (19) Khulasatul Ahkam; (20) Bustanul Arefin.\n Besides, the number of unfinished books written by him is not less. Among them, 'Al Majumu Sharhul Muhazyab' is particularly noteworthy.\nAfter his death Imam Subaki Rahimahullah and then Shaykh Muhammad Najeeb completed the composition of this book. Besides, 'Jameus Sunnah', 'Sharhut Twanbih', 'Sharhul Wasit', 'Sharhul Bukhari', 'Sharhu Sunani Abu Dawud', 'Al-Ahkam' etc. are notable.\nThis sage passed away at the age of forty-five or forty-six on the twenty-fourth day of the month of Rajab 676 Hijri. Tajuddin Subaki Raheemullah said, \"Damasha and the surrounding cities were drowned in grief at his death.\" He was buried in his birthplace, Nawa. May Allah Almighty accept him and all his services.",
      "اسمه الكامل محيي الدين أبو زكريا يحيى بنوش الشيخ أبو يحيى مري بن حسن بن حسين بن محمد بن جمعة بن حزام الحزامي النبوي. \"محي الدين\" هو لقبه و \"أبو زكريا\" هو لقبه. وكان في حياته مشهوراً جداً ومتقدماً في مقاييس العلم والتقوى حتى أنه حصل على لقب \"محي السنة\" في \"محي الدين مطران\".\n\n ولد في شهر المحرم سنة 631 هجرية في مكان يسمى نوى بالقرب من دمشق. وقد ورد \"نوائي\" أو \"نوابي\" في نهاية اسمه إشارة إلى مكان ولادته. وهذا الأمر بديهي وثابت أن الله رب العالمين الذي قدم به خدمة جليلة للدين والناس، قد رباهم على هذا النحو منذ الصغر. ولم يكن هذا استثناءً في حالة الإمام النوابي رحمه الله. منذ الطفولة كان مختلفًا عن الأطفال الآخرين. وعلى الرغم من ولادته في قرية أجبارا، في عائلة أمية من الطبقة الدنيا، إلا أنه كان لديه كل الميل نحو اكتساب المعرفة. أراد الأب صاحب المتجر أن يتسوق ابنه معه. لكنه أخذ الإذن من والده وذهب إلى المؤسسة المسماة الرواحية بدمشق طلباً للعلم والتواصل مع العلماء. ومن هنا صنع أصل الكلمة اللاحق في جميع فروع المعرفة. قال الإمام الذهبي رحمه الله: \"كان (النبي) يقضي معظم يومه وليلته في التعلم\". اعتاد أن يكون مثالا لموهبته وعمله الجاد. وكان يأكل مرة واحدة في اليوم. وكان يقرأ في قلبه حتى أثناء الرحلة.\n وفي سنة 651 هـ، وهو في الحادية والعشرين من عمره، رافق والده إلى مكة لأداء فريضة الحج. وخلال هذه الزيارة التقى بكبار علماء مكة والمدينة واكتسب معرفة خاصة في الحديث. محمد بن أحمد المقدسي، إسماعيل بن إبراهيم، أحمد بن عبد الدايم، عبد الرحمن العنبري، إبراهيم بن علي الواسطي من الأساتذة الذين أخذ عنهم العلم الإمام النوابي (رحمه الله). كان نوابي من أتباع المذهب الشافعي في الفقه. ولم يكن تابعاً فحسب، بل كان من كبار المحللين وأئمة المذهب. قال ابن قصير رحمه الله: كان شيخ المذهب، وأحسن فقهاء عصره. وقال الذهبي: \"وكان سيد مفسري المذهب\". ويعتبر روضة الطالبين الذي ألفه الكتاب الرئيسي لشرح المذهب الشافعي ومصدر معلوماته. مثل معظم علماء الشافعية، اتبع الإمام النوابي (رحمه الله) أيضًا المذهب الأشعري. وقد ذكر ذلك كتاب سيرته الآخرون، ومنهم الذهبي، وتاج الدين سوبكي، واليافعي.\nوفي تفسير صحيح مسلم في كتابه 'المنهاج' أعطى مكانة كبيرة للمذاهب الأشعرية. هذا المهاتما قصير العمر عاش خمسة وأربعين عامًا فقط. ولكن حتى في هذه الفترة القصيرة من الزمن، قدم له الله رب العالمين خدمة عظيمة للدين والعلم، وهو أمر نادر حقًا. وله كتب في كل فرع من فروع العلم تقريبًا، تنفع الناس إلى يوم القيامة إن شاء الله! ولا سيما الكتب الثلاثة \"الأربعين النبابية\" و\"رياض الصالحين\" و\"الأذكار\" تحظى بتقدير وقراءة متساويين من قبل المسلمين على جميع المستويات.\n\nإلى جانب ذلك فإن من الكتب المشهورة التي ألفها هو:\n (١) مسلم ابن الحجاج في المنهاج في الشرح؛ (2) روضة الطالبين وعمدة المفتين؛ (3) منهاج الطالبين وعمدة المفتين؛ (4) أدب المفتي والمصطفي؛ (5) تحفة تلابيل فضائل؛ (6) التبيان في أدبا حملاتيل القرآن. (7) التحرير في الفجيت تنبيه؛ (8) العمدة في كشف تنبيه؛ (9) العدوة في المناسك؛ (10) في تيسير في مختصر إرشاد؛ (11) إرشادو تلابيل حقبايك؛ (12) الفتاوى ؛ (13) المنهاج في مختصر المحرّر؛ (14) دكايكول منهاج؛ (15) مختسارو أسدايل جابه؛ (16) مناقيبوش شافعي؛ (17) محمد الأحكام؛ (18) رسالة في قسمة الغانم. (19) خلاصة الأحكام؛ (20) بستانول عارفين.\n علاوة على ذلك، فإن عدد الكتب غير المكتملة التي كتبها ليس أقل. ومن بينها \"الماجومو شرح المحظيات\" الجدير بالملاحظة بشكل خاص.\nوبعد وفاته أكمل الإمام السبكي رحمه الله ثم الشيخ محمد نجيب تأليف هذا الكتاب. ومن الجدير بالذكر \"جامع السنة\"، و\"شرح التوانبيه\"، و\"شرح واسط\"، و\"شرح البخاري\"، و\"شرح سناني أبو داود\"، و\"الأحكام\" وغيرها.\nوتوفي هذا الحكيم عن عمر يناهز الخامسة والأربعين أو السادسة والأربعين في اليوم الرابع والعشرين من شهر رجب سنة 676 هجرية. وقال تاج الدين سوبكي رحيم الله: \"غرقت دمشا والمدن المجاورة حزناً على وفاته\". ودفن في مسقط رأسه نوى. تقبل الله تعالى منه ومن جميع خدماته."
    ],
    "image": "https://i.ibb.co/CVz07sk/islamic-man.jpg"
  },
  {
    "_id": "667dc1de7d866f035c07d626",
    "name": [
      " শাইখ সিরাজ উদ্দিন মুহাম্মাদ বিন আব্দুর রশীদ সাজাওয়ান্দি হানাফী",
      "Sheikh Siraj al-Din Muhammad bin Abdul Rashid al-Sajawandi al-Hanafi",
      "  الشيخ سراج الدين محمد بن عبد الرشيد السجاوندي الحنفي"
    ],
    "desc": [
      "মুহাম্মদ বিন মুহাম্মদ বিন আব্দুল রশিদ সিরাজ আল-দিন আল-সাজাওয়ান্দি একজন জগত বিখ্যাত আলেম ছিলেন। তিনি ছিলেন হানাফি মাজহাবের অনুসারী ছিলেন। ”আস-সিরাজী ফিল মিরাস” তার অনবদ্য গ্রন্থ।",
      "Muhammad bin Muhammad bin Abdul Rashid Siraj al-Din al-Sajawandi. The author of “Al-Sirajiya” in the religious duties, and his explanation.",
      "محمد بن محمد بن عبد الرشيد سراج الدين السجاوندي. صاحب \"السراجية\"في الفرائض، وشرحها.\n"
    ],
    "image": "https://i.ibb.co/CVz07sk/islamic-man.jpg"
  },
  {
    "_id": "667dc1e57d866f035c07d627",
    "name": [
      " মুহাম্মদ বিন আব্দুল্লাহ আবু আব্দুল্লাহ ওয়ালীউদ্দীন আততিবরীজী রহঃ",
      "Muhammad bin Abdullah Abu Abdullah Waliuddin Attibariji",
      "محمد بن عبد الله أبو عبد الله ولي الدين الطبريجي"
    ],
    "desc": [
      " শায়েখ ওয়ালীউদ্দিন মুহাম্মাদ ইবনে আব্দুল্লাহ আল খাতীব আল আমরী আত তিবরিযী ৮০০ হিজরীর শেষের দিকে মৃত্যু বরণ করেন",
      "Shaykh Waliuddin Muhammad Ibn Abdullah Al Khatib Al Amri at Tibrizi died in late 800 AH.",
      "توفي الشيخ ولي الدين محمد بن عبد الله الخطيب العامري بالتبريزي في أواخر سنة 800هـ."
    ],
    "image": "https://i.ibb.co/CVz07sk/islamic-man.jpg"
  },
  {
    "_id": "667dc1ec7d866f035c07d628",
    "name": [
      "ইমাম বুরহানুদ্দীন মারগীনানী হানাফি রাহ.",
      "Imam Burhanuddin Marginani Hanafi Rah.",
      "برهان الدين أبو الحسن علي بن أبي بكر بن عبد الجليل الفرغاني المرغيناني"
    ],
    "desc": [
      "আল্লামা ইমাম বুরহান উদ্দীন আবুল হাসান আলী ইবনে আবু বকর ইবনে আব্দুল জলিল আল-ফারগানী আল-মারগিনানী আইনশাস্ত্রের হানাফী মাজহাবের একজন ইসলামী পণ্ডিত বা ফকিহ ছিলেন।  তিনি আল-হিদায়ার লেখক হিসাবে সর্বাধিক পরিচিত, যা হানাফী আইনশাস্ত্রের অন্যতম প্রভাবশালী ফিকাহ হিসাবে বিবেচিত হয়।",
      "Allama Imam Burhan Uddin Abul Hasan Ali Ibn Abu Bakr Ibn Abdul Jalil Al-Farghani Al-Marginani was an Islamic scholar or faqih of the Hanafi school of jurisprudence. He is best known as the author of al-Hidaya, which is considered one of the most influential fiqhs of Hanafi jurisprudence.",
      "العلامة الإمام برهان الدين أبو الحسن علي بن أبو بكر بن عبد الجليل الفرغاني المرجيناني كان عالمًا إسلاميًا أو فقيهًا من المذهب الحنفي في الفقه. اشتهر بأنه مؤلف كتاب الهداية، الذي يعتبر من أكثر الفقهاء تأثيرا في الفقه الحنفي."
    ],
    "image": "https://i.ibb.co/61SD2vv/islamic-man.jpg"
  },
  {
    "_id": "667dc1fb7d866f035c07d629",
    "name": [
      "আল্লামা জালালুদ্দিন সুয়ুতি (রাহ.)",
      "Allama Jalaluddin Suyuti (R.A.)",
      "العلامة جلال الدين السيوطي (ر)"
    ],
    "desc": [
      "নাম   ও  নসবনামা: তাঁর নাম  আব্দুর    রহমান। উপনাম আবুল ফদল। পিতার নাম  কামাল   উদ্দিন।   কিন্তু  তিনি সারাবিশ্বে  জালাল  উদ্দিন  সুয়ুতি  নামে  পরিচিত।  তাঁর  নসবনামা    হল   ‘আবুল    ফদল    জালাল    উদ্দিন   আব্দুর রহমান  বিন  কামাল  উদ্দিন   আবি  বকর  বিন     মুহাম্মদ বিন   সাবিক   উদ্দিন    বিন    উসমান   আস    সুয়ুতি    আশ শাফেয়ী।’\n\n\n\nবেলাদতশরীফ:      ইমাম   সুয়ুতি   ৮৪৯   হিজরি    পহেলা রজব মিশরের  নীল নদীর পশ্চিম  তীঁরে  অবস্থিত সুয়ুত নামক গ্রামে জন্মগ্রহণ  করেন।   মাত্র  পাঁচবছর বয়সেই তাঁর পিতা ইন্তেকাল করেন।\n\nইলম  অর্জন:  বাল্যকাল  থেকেই  ইমাম    সুয়ুতি   অত্যন্ত মেধাবী   ও   চমৎকার    স্মৃতিশক্তির    অধিকারী   ছিলেন। মাত্র  আটবছর  বয়সে  তিনি   কুরআনুল   কারীম    হিফ্জ করেন। যেমন তিনি নিজেই বলেছেন-\n\nقال ونشأت يتيما- فحفظت القران ولى دون ثمانى حسنين ثم حفظت    العمدة    ومنهاج    الفقه    والاصول    والفية    ابن  مالك\n\nঅর্থ:   আমি   এতিম  হিসেবে  জীবন     শুরু   করি।  প্রথমে আমি আটবছর বয়সে  কুরআনুল কারীম   হিফ্জ   করি। অতঃপর উমদাহ ‘মিনহাজুল ফিক্হ’ ‘আল  উসূল’  এবং ‘আল ফিয়াতু ইবনে মালিক’ মুখস্ত করি।\n\nইমাম সুয়ুতি  জগতবিখ্যাত উলামায়ে  কেরামদের কাছ থেকে    বিভিন্ন   বিষয়ে  জ্ঞান  অর্জন  করেন।   এ  প্রসঙ্গে  তিনি  বলেন- ورزقت التبحر  فى  سبعة  علوم অর্থ: আমি সাতটি   বিষয়ে   পারদর্শীতা     অর্জন    করি।    তা   হলো-  তাফসির,    হাদিস,  ফিক্হ,  নাহু,  মায়ানী,  বায়ান  এবং মানতিক। এছাড়াও তিনি ফারাইয ও আরবি ভাষাসহ বিভিন্ন বিষয়ের উপর   ইলম অর্জন করেন। তিনি দুইল  হাদিসের হাফিজ ছিলেন।\n\nআসাতিযায়ে  কেরামগণ:  ইমাম  জালাল  উদ্দিন  সুয়ুতি  কুরআন হাদিসের ইলম  অর্জনের জন্য কঠোর  পরিশ্রম করেছেন। তিনি শ্যাম, হিজাজ, ইয়ামন, হিন্দ, মাগরিব তাকরুরসহ       বিভিন্ন       দেশে       ভ্রমণ       করেন।       তিনি  কামালউদ্দিন     ইবনে     হুমাম,     জালাল    উদ্দিন    মহল্লী, ইলমুদ্দিন    বুলকিনী,    শিহাবউদ্দিন    আশ    শারমাসাহী,  ইমাম মানাভী,    ইমাম শামনী, ইমাম আল কাফিজীসহ অসংখ্য  উলামায়ে কিরামদের কাছ থেকে   ইলম অর্জন করেন। তাঁর  ছাত্র শা’রানী  বলেছেন- ইমাম  সুয়ুতি ছয় শতাধিক শায়খের কাছ থেকে ইলম অর্জন করেছেন।\n\nআখলাক:          ইমাম           সুয়ুতি          অত্যন্ত           খোদাভীরু, তাকওয়াবান  ও  পরহেজগার  লোক  ছিলেন।  জীবনের  বেশিরভাগ  সময়  তিনি  দ্বীনি   খেদমতে      কাটিয়েছেন। নাজমুদ্দিন  আল  কুরী  الكوكب  السائرة  باعيان  المائة  العاشر   গ্রন্থে   বলেছেন-   চল্লিশ   বছর   বয়স   হবার   পর  থেকে তিনি দুনিয়ার আরাম-আয়েশ থেকে মুখ ফিরিয়ে নিয়ে  সম্পূর্ণরূপে আল্লাহর ইবাদতে  মশগুল থাকতেন। তিনি একাকী ও নির্জনতাকে পছন্দ করতেন।  এমনকি পরিবার-পরিজন থেকেও  মুখ  ফিরিয়ে নেন, যেন তিনি কাউকে চিনেন না।   সদা-সর্বদা কিতাবাদী গবেষণাতে  মশগুল      থাকতেন।      মৃত্যু      পর্যন্ত      তিনি      ‘রওদাতুল  মিকয়াছ’  নামক    স্থানে   অবস্থান  করেন।  ঘরের  দরজা জানালা পর্যন্ত খুলতেন না। বিভিন্ন বিত্তশালী আমিরগণ মূল্যবান   উপঢৌকন  নিয়ে   তাঁর   জিয়ারতে  আসতেন। কিন্তু তিনি তা ফিরিয়ে দিতেন।\n\nকিতাবাদী: ইমাম সুয়ুতি বিভিন্ন বিষয়ের উপর অসংখ্য কিতাবাদী রচনা করেছেন। আল ইদরূসী النور السافرة গ্রন্থে বলেছেন-\n\nووصلت مصنفاته نحو الستمائة مصنفا-\nঅর্থ: তাঁর রচনাবলী ছয়শত পর্যন্ত পৌঁছেছে। নিম্নে তাঁর বিখ্যাত কয়েকটি কিতাবের নাম প্রদত্ত হলো-\n১. আল ইতকান ফি উলুমিল কুরআন।\n২. আদ দুররুল মানসুর ফি তাফসিরি বিল মা’ছুর।\n৩. লুবানুন নুকুল ফি আসবাবিন নুজুল।\n৪. তাফসিরে জালালাইন।\n৫. হাশিয়াতু আলা তাফসিরে বায়জাবী।\n৬. শরহু ইবনে মাজাহ।\n৭. তাদরীবুর রাওয়ী।\n৮. শরহুস     সুদুর    বি    শরহে    হালিল     মাওতা     ওয়াল কুবুর।\n৯. আল বুদুরুস সাফিরাহ আন উমুরিল আখিরাহ।\n১০. আত তিব্বুন নাবাওয়ী।\n১১. আল আশবাহু ওয়ান নাজাইর।\n১২. আল হাবী লিল ফাতাওয়া।\n১৩. তারিখুল খুলাফা।\n\nওফাত শরীফ: ইসলামের এই মহান খাদিম, মুজাদ্দিদে দ্বীন ইমাম  সুয়ুতি ৯১১  হিজরি  সনের    ১৯ জামাদিউল উলা, শুক্রবার রাতে ‘রওদাতুল   মিকয়াস’ নামক  স্থানে  ইন্তেকাল করেন। ইন্তেকালের সময় তাঁর বয়স হয়েছিল ৬১ বৎসর ১০ মাস ১৮ দিন।\nআল্লাহ     তাঁকে     জান্নাতুল     ফিরদাউস     নসিব     করুন।  আমিন",
      "Muassatur Risalahnam   and  Nasbanama: His name  was  Abdur    Rahman. Surname Abul Fadl. Father's name is Kamal Uddin. But he is known all over the world as Jalal Uddin Suyuti.His name is Abul Fadl Jalal Uddin Bin Kamal Uddin Abi Bakr Bin Uddin Bin Uthman As Suyuti Shafee .'\n\n\n\nBeladat Sharif: Imam Suyuti was born in 849 Hijri in the first Rajab of Egypt in the village of Suyut on the west bank of the Nile River. His father died when he was only five years old.\n\nAttainment of Knowledge: Since childhood, Imam Suyuti was highly intelligent and possessed of an excellent memory. He memorized the Holy Quran at the age of eight. As he himself said-\n\nقال ونشاحت يتيما- فحفزت القران ولى دون ثماني حسنين ثم حفظت    العمدة    ومنهاج    الفقه    والاسول    والفيا    ابن  مالك\n\nMeaning: I start life as an orphan.First, I memorized the Quran at the age of eight. Then I memorized Umdah 'Minhajul Fiqh', 'Al-Usool' and 'Al-Fiyat Ibn Malik'.\n\nImam Suyuti acquired knowledge on various subjects from the world-renowned Ulama.In this  context  he  said- ورزقت التبحر  في  سبيب  علوم Meaning: I acquire proficiency in seven   subjects .These are Tafsir, Hadith, Fiqh, Nahu, Mayani, Bayan and Mantiq. He also acquired knowledge on various subjects including Fara'iz and Arabic languages. He was the Hafiz of Dual Hadith.\n\nAsatizaye Keramgan: Imam Jalal Uddin Suyuti worked hard to acquire the knowledge of Qur'anic Hadith. He traveled to different countries including Sham, Hijaz, Yaman, Hind, Maghrib Takrur.He is from Kamaluddin Ibn Humam, Jalaluddin Mohalli, Ilmuddin Bulkini, Shihabuddin Ash Sharmasahi, Imam Shamni, Imam Al Kafizi and many other scholars   acquired knowledge. His student Sha'rani said - Imam Suyuti acquired knowledge from more than six hundred Shaykhs.\n\nAkhlaq: Imam Suyuti was a very pious, pious and pious person.He spent most of his life in religious service. Najmuddin al-Quri al-Kookb al-Saîratha Baayan al-Maîtah al-Aasher said that after reaching the age of forty, he turned away from the comforts of the world and was completely engaged in the worship of Allah. He loved solitude and solitude. He turned away even from his family, as if he did not know anyone. He was always engaged in literary research.Until his death he resided in a place called 'Raudatul Miqayash'.He did not open the door of the house even the window. Various wealthy amirs used to visit him with valuable gifts. But he would return it.\n\nKitabadi: Imam Suyuti composed numerous Kitabadi on various subjects. Al-Idrushi said in Al-Nour al-Safarah:\n\nووسلت اسنفراته نحذ الستمئة اسنفا-\nMeaning: His works reached six hundred. Some of his famous books are given below-\n1. Al Itqan Fi Ulumil Quran.\n2. Ad Durrul Mansoor Fi Tafsiri Bill Ma'chur.\n3. Lubanun nukul fi asbin nuzul.\n4. Jalalain in Tafsir.\n5. Bayzabi in Hashyatu Ala Tafsir.\n6. Sharhu Ibn Majah.\n7. Then the narrator.\n8. Sharhus     Sudur    B    Sharhe    Halil     Mawta     Wal Qubur.\n9. Al Budurus Safirah an Umuril Akhirah.\n10. At Tibbun Nabawi.\n11. Al Ashbahu wan Nazair.\n12. Al Habi Lil Fatawa.\n13. Tarikhul Khulafa.\n\nOfat Sharif: This great Khadim of Islam, Mujaddid Deen Imam Suyuti 911 Hijri 19 Jamadiul Ula, passed away on Friday night at a place called Rawdatul Mikayas. He was 61 years 10 months 18 days old at the time of his death.\nMay Allah grant him Jannatul Firdaus.Amen",
      "مُؤَسِّرٌ رسالُهنامُ   و  نسباناما : اسمه   عبدُ الرحمن . اللقب أبو الفضل. اسم الأب كمال الدين. لكنه معروف في جميع أنحاء العالم باسم جلال الدين السيوطي. اسمه أبو الفضل جلال الدين بن كمال الدين أبي بكر بن الدين بن عثمان السيوطي الشافعي.\n\n\n\nبلادات شريف: ولد الإمام السيوطي سنة 849 هجرية في أول رجب من مصر في قرية سيوط على الضفة الغربية لنهر النيل. توفي والده عندما كان عمره خمس سنوات فقط.\n\nتحصيل العلم: كان الإمام السيوطي منذ طفولته شديد الذكاء، وذو ذاكرة ممتازة. حفظ القرآن الكريم وهو في الثامنة من عمره. كما قال هو نفسه-\n\nقال ونشاحت يتيما- فحفزت القران ولى دون ستنان حسنين ثم حفظت    العمدة    ومنهاج    الفقه    والاسول    والفيا    ابن  مالك\n\nالمعنى: بدأت حياتي يتيما. أولا حفظت القرآن في الثامنة من عمري. ثم حفظت عمدة «منهج الفقه» و«الأصول» و«الفية ابن مالك».\n\nوقد أخذ الإمام السيوطي العلم في مواضيع مختلفة من العلماء المشهورين. وفي هذا ’’السياق‘‘ قال- ورزقت التبحر  في  سبيب  علوم: يعني: أتقن سبعة ’مواد‘. وهي التفسير، والحديث، والفقه، والنحو، والمياني، والبيان، والمنطق. كما اكتسب المعرفة في مواضيع مختلفة بما في ذلك الفرائز واللغات العربية. وكان حافظ ثنائي الحديث.\n\nAsatizaye Keramgan: عمل الإمام جلال الدين السيوطي بجد لاكتساب معرفة الحديث القرآني. سافر إلى بلدان مختلفة منها الشام والحجاز واليمن وهند والمغرب تكرور. وهو من كمال الدين بن همام وجلال الدين محلي وعلم الدين بولكيني وشهاب الدين الشرمساهي والإمام شمني والإمام الكافيزي وغيرهم من العلماء. قال تلميذه الشعراني - أخذ الإمام السيوطي العلم عن أكثر من ستمائة شيخ.\n\nأخلاق: كان الإمام السيوطي إنساناً تقياً ورعاً وتقياً جداً، قضى معظم حياته في الخدمة الدينية. وقال نجم الدين القوري الكوكب الصراطة بيان الميطة العاشر إنه بعد أن بلغ الأربعين أعرض عن متاع الدنيا وانشغل بعبادة الله تماما. كان يحب العزلة والعزلة. وابتعد حتى عن أهله كأنه لا يعرف أحدا. كان دائمًا منخرطًا في البحث الأدبي. وأقام حتى وفاته في مكان يُدعى \"روضة المقياش\". ولم يفتح باب المنزل حتى النافذة. وكان العديد من الأمراء الأثرياء يزورونه بالهدايا القيمة. لكنه سيعيدها.\n\nالكتبادي: قام الإمام السيوطي بتأليف العديد من الكتبادي في مواضيع مختلفة. قال الإدروشي في النور السفرة :\n\nوسلت اسنفراته نحذ الستمئة اسنفا-\nيعني: بلغت أعماله ستمائة. بعض كتبه الشهيرة مذكورة أدناه-\n1. الإتقان في علوم القرآن.\n2. الدر المنصور في تفسيري بيل معشور.\n3. Lubanun nukul fi asbin nuzul.\n4. الجلالين في التفسير.\n5. البيزابي في حاشية على تفسير.\n6. شرحو ابن ماجه.\n7. ثم الراوي.\n8. شرحوس     سدور    ب    شرح    خليل     موطى     والقبور.\n9. السفيرة البدورس والأمر الآخرة.\n10. في تبون النبوي.\n11. الاشباهو والنظائر.\n12. فتاوى الحبي ليل.\n13. تاريخ الخلفاء.\n\nعوفات شريف: توفي خادم الإسلام العظيم مجدد الدين الإمام السيوطي 911 هجرية 19 جمادى الأولى ليلة الجمعة في مكان يسمى روضة الميكاياس. كان عمره 61 عامًا و10 أشهر و18 يومًا وقت وفاته.\nرحمه الله جنة الفردوس .آمين"
    ],
    "image": "https://i.ibb.co/61SD2vv/islamic-man.jpg"
  }
]
