[
  {
    "_id": { "$oid": "65814c5c1b86d8edca1267ee" },
    "title": ["ইমাম আবু জাফর ত্হাভী", "Aqidatut tohavi", "عقيدة الطحاوي"],
    "writer": ["writer02"],
    "translator": ["translator831571", "translator898163"],
    "editor": ["editor02"],
    "publisher": "publisher540",
    "publisherCountry": ["বাংলাদেশ", "Bangladesh", "بنغلاديش"],
    "category": "category8",
    "subCategory": "category8sub1",
    "thumb": "https://i.ibb.co/ynhT6Zg/417722234-901765291956303-1729565998989043404-n-1.jpg",
    "price": "200",
    "pages": "200",
    "stock": "20",
    "status": "published",
    "desc": [
      "স্বপ্ন-ষড়যন্ত্র-দাসত্ব-দুর্ভিক্ষ-রাজত্ব—কী দারুণ এক সত্য আখ্যান! বাধা-বিপত্তির দেয়াল পেরিয়ে মঞ্জিলে পৌঁছার এই অসাধারণ গল্প কোটি হৃদয়কে উজ্জীবিত করছে শত সহস্র বছর ধরে। হতাশার পাহাড় মাড়িয়ে আশার আলো জ্বালিয়ে দেওয়ার এ গল্প আজকের প্রজন্মকেও স্পর্শ করে খুব। লালসার সমুদ্রে এ যেন পবিত্র একফোঁটা স্বচ্ছ জলবিন্দু! ইউসুফ আলাইহিস সালাম আমাদের বিজয়ী মহানায়ক, বিশ্বাসীদের নকিব। সূরা ইউসুফ আমাদের প্রত্যাশিত জীবনের এক অনন্য রিফ্লেকশন।",
      "Dream-conspiracy-slavery-famine-reign—what a great true story! This extraordinary story of crossing the walls of obstacles and reaching the destination has been enlivening millions of hearts for hundreds of thousands of years. This story of breaking the mountain of despair and lighting the light of hope touches today's generation too. In the sea of lust, this is like a holy drop of clear water! Yusuf Alaihis Salam is our victorious hero, Naqeeb of the believers. Surah Yusuf is a unique reflection of our expected life.",
      "حلم، مؤامرة، عبودية، مجاعة، حكم، يا لها من قصة حقيقية عظيمة! هذه القصة الاستثنائية لعبور أسوار العوائق والوصول إلى الوجهة قد ساهمت في إحياء ملايين القلوب لمئات الآلاف من السنين. إن قصة كسر جبل اليأس وإضاءة نور الأمل تمس جيل اليوم أيضًا. في بحر الشهوة، هذا مثل قطرة ماء صافية مقدسة! يوسف عليه السلام هو بطلنا المنتصر نقيب المؤمنين. سورة يوسف هي انعكاس فريد لحياتنا المتوقعة."
    ],
    "importedCountry": "country573",
    "sold": { "$numberInt": "0" }
  }
]
